#ifndef __FN_VIB_MONITOR_H /* 再読み込み防止用 */
/****************************************************************************
  Description   : Online Vibration Monitor (Fn207)
-----------------------------------------------------------------------------
  Author        : Yaskawa Electric Corporation. 
                  Copyright (c) 2010 All Rights Reserved

  Project       : INGRAM

----------------------------------------------------------------------------
  Changes		:
	Name   Date          Description
----------------------------------------------------------------------------
	Y.Oka   2011.01.28   created

****************************************************************************/
#include "Basedef.h"




/****************************************************************************************************/
/*																									*/
/*		Structure Definition																		*/
/*																									*/
/****************************************************************************************************/
typedef	struct VIBMON
{
	struct {
		USHORT	VibmState;					/* 0x2017 : オンライン振動モニタ完了確認				*/
	} OpeReg;
/*--------------------------------------------------------------------------------------------------*/
	struct {
		BOOL	FftReq;						/* 周波数解析要求										*/
		SHORT	VibDetLvl;					/* 周波数解析検出トリガレベル							*/
		SHORT	FftStat;					/* 周波数解析ステータス									*/
		ULONG	TimeOutCtr;					/* タイムアウト検出用カウンタ							*/
	} var;
} VIBMON;


/****************************************************************************************************/
/*																									*/
/*		Constant Definition																			*/
/*																									*/
/****************************************************************************************************/
enum VIBMON_SEQ_STS {
	VIBMON_SEQ_INIT		= 0,				/* 振動レベル検出開始待ち								*/
	VIBMON_SEQ_DETECT,						/* 周波数解析中											*/
	VIBMON_SEQ_DISPLAY,						/* 周波数解析結果(フィルタ設定待ち)						*/
	VIBMON_SEQ_CALC,						/* フィルタ設定中										*/
	VIBMON_SEQ_STORE,						/* フィルタ保存中										*/
	VIBMON_SEQ_DETERR,						/* 周波数解析エラー										*/
	VIBMON_SEQ_END,							/* 終了処理												*/
};
/*--------------------------------------------------------------------------------------------------*/
enum VIBMON_CMP_STS {
	VMON_STS_END		= 0,				/* 完了													*/
	VMON_STS_RUN,							/* 未完了(実行中)										*/
	VMON_STS_ERR,							/* 検出不可												*/
	VMON_STS_STOP,							/* 検出停止												*/
};



/****************************************************************************************************/
/*																									*/
/*		Function Prototype Definition																*/
/*																									*/
/****************************************************************************************************/




/****************************************************************************************************/
#define __FN_VIB_MONITOR_H
#endif /* __FN_VIB_MONITOR_H */
