/****************************************************************************************************/
/*																									*/
/*																									*/
/*		XlsAlmDefCmOpt.h : アラーム定義ヘッダファイル												*/
/*																									*/
/*																									*/
/****************************************************************************************************/
/*																									*/
/*																									*/
/*		1. アラーム定義構造体																		*/
/*																									*/
/*		2. アラームＩＤ定義																			*/
/*																									*/
/*		3. ワーニングＩＤ定義																		*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/************** Copyright (C) Yaskawa Electric Corporation ******************************************/
/*																									*/
/*		2009.08.03 : Made by Excel Macro															*/
/*																									*/
/*																									*/
/****************************************************************************************************/





/****************************************************************************************************/
/*																									*/
/*		アラーム定義																				*/
/*																									*/
/****************************************************************************************************/
/*--------------------------------------------------------------------------------------------------*/
/*		アラーム定義構造体																			*/
/*--------------------------------------------------------------------------------------------------*/
#ifndef	ALMDEF_VERSION
typedef struct	{
		USHORT	AlmCode;						/* アラームコード									*/
		UCHAR	AlmAttr;						/* アラーム属  性									*/
		UCHAR	StopMode;						/* アラーム発生時の停止方法,ＯＬ属性				*/
		UCHAR	AlmCodeOut;						/* アラームコード出力信号							*/
		UCHAR	AlmLedOut;						/* アラームＬＥＤ出力信号							*/
		UCHAR	AlmAttrEx;						/* アラーム拡張属性									*/
		UCHAR	Spare;							/* Spare											*/
} ALMDEF;
typedef const ALMDEF CALMDEF;					/* const アラーム定義								*/
#endif
/*--------------------------------------------------------------------------------------------------*/
/*		ALMDEF Version																				*/
/*--------------------------------------------------------------------------------------------------*/
#define ALMDEF_VERSION			0x0001			/* ALMDEF Version									*/
/*--------------------------------------------------------------------------------------------------*/
/*		アラーム属性定義																			*/
/*--------------------------------------------------------------------------------------------------*/
#define ALMDEF_ATTR_WARNING		0x01			/* ワーニング(1),アラーム(0)						*/
#define ALMDEF_ATTR_NOEEPROM	0x02			/* EEPROM非格納(1),EEPROM格納(0)					*/
#define ALMDEF_ATTR_COMALARM	0x04			/* 通信Alarm(1),アンプAlarm(0)						*/
#define ALMDEF_ATTR_NOTRESET	0x08			/* リセット不可(1),リセット可(0)					*/
#define ALMDEF_ATTR_MENCDANG	0x10			/* モータエンコーダデータ無効(1)					*/
#define ALMDEF_ATTR_POSNG		0x20			/* 位置データ無効(1)								*/
/*--------------------------------------------------------------------------------------------------*/
/*		ＯＬアラーム情報定義																		*/
/*--------------------------------------------------------------------------------------------------*/
#define ALMDEF_OLINFO_OLF		0x01			/* 過負荷											*/
#define ALMDEF_OLINFO_RGOL		0x02			/* 回生過負荷										*/
#define ALMDEF_OLINFO_DBOL		0x04			/* ＤＢ過負荷										*/
/*--------------------------------------------------------------------------------------------------*/
/*		ストップモード定義(整合性チェック用)														*/
/*--------------------------------------------------------------------------------------------------*/
#define STOPMODE_NOTSTOP		0x00			/* 非停止(何もしない)								*/
#define STOPMODE_ZEROSTOP		0x01			/* ゼロ速停止										*/
/*--------------------------------------------------------------------------------------------------*/
/*		アラーム拡張属性定義																		*/
/*--------------------------------------------------------------------------------------------------*/
#ifdef		MCCSW_SGDVM3
#define ALMDEF_M3ATTR_CMDALM	0x01			/* M3コマンドアラーム(1)							*/
#define ALMDEF_M3ATTR_COMALM	0x02			/* M3通信アラーム(1)								*/
#define ALMDEF_M3ATTR_CODEMASK	0xF0			/* M3アラームコードマスク							*/
#endif
/*--------------------------------------------------------------------------------------------------*/



/****************************************************************************************************/
/*																									*/
/*		アラームＩＤ定義																			*/
/*																									*/
/****************************************************************************************************/
#define	ALM_OPTPRM_ERR		128		/* A.04A : オプションパラメータ設定異常							*/
#define	ALM_COMLSI_ERR1		129		/* A.B6A : 通信ASIC設定異常										*/
#define	ALM_COMLSI_ERR2		130		/* A.B6B : 通信ASICシステム異常									*/
#define	ALM_SCANN_STOP		131		/* A.BFB : ScanN実行停止										*/
#define	ALM_OPCARD_TOUT		132		/* A.E00 : オプション同期アクセス要求受信タイムアウト			*/
#define	ALM_DPM_CHKSUM		133		/* A.E03 : DPRAM Checksum error									*/
#define	ALM_TCYC_ERR		134		/* A.E40 : MECHATROLINK 伝送周期設定異常 for IDM				*/
#define	ALM_COMSYNC			135		/* A.E50 : ネットワーク同期エラー								*/
#define	ALM_COMSYNC_TOUT	136		/* A.E51 : ネットワーク同期確立失敗								*/
#define	ALM_COM				137		/* A.E60 : ネットワーク受信エラー								*/
#define	ALM_COMGBL_ERR		138		/* A.E61 : ネットワーク同期フレーム受信異常						*/
#define	ALM_NOANS			139		/* A.EA0 : サーボパック故障										*/
#define	ALM_SVINIT_ERR		140		/* A.EA1 : サーボパック初期アクセス異常							*/
#define	ALM_SVWDC_ERR		141		/* A.EA2 : サーボパックWDC異常									*/
#define	ALM_SVANS_TOUT		142		/* A.ED0 : サーボパック応答タイムアウト							*/
#define	ALM_CMDEXEC			143		/* A.ED1 : コマンド実行未完										*/
/*--------------------------------------------------------------------------------------------------*/



/****************************************************************************************************/
/*																									*/
/*		ワーニングＩＤ定義																			*/
/*																									*/
/****************************************************************************************************/
#define	WRN_PRM_NO			64		/* A.94A : データ設定警告(ユーザ定数番号) for IDM				*/
#define	WRN_DATA_AREA		65		/* A.94B : データ設定警告(データ範囲外) for IDM					*/
#define	WRN_DATA_CALC		66		/* A.94C : データ設定警告(演算異常) for IDM						*/
#define	WRN_DATA_SIZE		67		/* A.94D : データ設定警告(データサイズ異常) for IDM				*/
#define	WRN_DATA_LTMOD		68		/* A.94E : データ設定警告(ラッチモード異常) for IDM				*/
#define	WRN_CMD_CNDTN		69		/* A.95A : コマンド警告(条件外) for IDM							*/
#define	WRN_CMD_NOSPT		70		/* A.95B : コマンド警告(未サポート) for IDM						*/
#define	WRN_CMD_PRM			71		/* A.95C : コマンド警告(ユーザ定数による条件外) for IDM			*/
#define	WRN_CMD_CNFLCT		72		/* A.95D : コマンド警告(コマンドの干渉) for IDM					*/
#define	WRN_SUBCMD			73		/* A.95E : コマンド警告(サブコマンド不可) for IDM				*/
#define	WRN_FUNC_CNFLCT		74		/* A.95F : コマンド警告(ポートの干渉) for IDM					*/
#define	WRN_COM				75		/* A.960 : MECHATROLINK通信警告									*/
/*--------------------------------------------------------------------------------------------------*/







/***************************************** end of file **********************************************/
