/****************************************************************************
Description	: Definitions for each product functionality
----------------------------------------------------------------------------
Author			: Yaskawa Electric Corp.,
					Copyright (c) 2012 All Rights Reserved

Project			: Mercury

----------------------------------------------------------------------------
Changes :
	Name	Date		Description
  ------------------------------------------------------------------------
	Y.Oka	2012.08.06	created

******************************************************************************/
#ifndef _SYSTEM_SETTING_H
#define _SYSTEM_SETTING_H

#include "SpecCommon.h"

#ifdef _TEST_BOARD_
#define _JL076_USE_
#endif

/*****************************************************************************/
/*		Product information													 */
/*****************************************************************************/
#define MAX_AXIS_NUMBER		1			/* 最大接続軸数 */
#define MAX_SLOT_NUMBER		1			/* 最大スロット(ASIC)数 */

#define SERVO_FIRM_CODE		0x02250000	/* デバイスコード	*//* <S0D9> */
#define TCYC_TIME_MIN		12500		/* 伝送周期最小値	*//* <S159> */
#define CCYC_TIME_MIN		12500		/* 通信周期最小値	*//* <S159> */

#define	CSW_NETIF_TYPE		NETIF_M3_TYPE
#define CSW_BOARD_TYPE		SGD7S_TYPE										  /* <S0A2> */


/****************************************************************************/
/*		機種依存H/W定義														*/
/****************************************************************************/
#define SVFSEL_EEPROM_USE 	(1)			/* 1: EEPROM使用 0: 未使用			*/
#define SVFSEL_VIRSIF_USE	(0)			/* 1: パネル使用 0: 未使用			*/
#define SVFSEL_PANELOP_USE	(0)			/* 1: パネル使用 0: 未使用			*/
#define EEPROM_SIZE			0x1000		/* EEPROM Memory Size				*//* <S10A> */


/*****************************************************************************/
/*		デバッグ用コンパイルSW定義											 */
/*****************************************************************************/
#if !defined(CSW_CSTR_MBB_TYPE) && defined(CSW_BSP_CSTR_IFM3)
#define CSW_CSTR_DB_REVERSE		TRUE
#endif


#define CSW_CSTR_IF_PROTO_USE		FALSE
#define CSW_CSTR_AUTO_ADDR_CFG		FALSE	/* MDINIT=ON時の自動軸アドレス割り付け有無 */
#define CSW_DEBUG_PRINT_EBABLE		FALSE
#define CSW_DX_CONVERTER_USE		FALSE
#define CSW_DIF_USE					FALSE
#ifdef _VC_DEBUG_
//#define CSW_NO_SERVO_ASICS
#define CSW_NO_M3_ASICS
#else
//#define CSW_NO_SERVO_ASICS
#endif

//#ifdef _IF_BOARD_REVC_	/* <S063> */
//#define	_USB_FUNC_USE_		/* revC基板からUSB機能有効(ソフトで判断できないためコンパイルスイッチとする) */
//#endif	//#ifdef _IF_BOARD_REVC_	/* <S063> */



#define	CSW_SCANA_ENABLE				/* CPU ScanA処理有効 */


/****************************************************************************/
/*		サーボ機能選択スイッチ(CSW_SVCF_****)								*/
/****************************************************************************/
/*--------------------------------------------------------------------------*/
/*		電子ギア使用・不使用設定(処理時間対策)								*/
/*--------------------------------------------------------------------------*/
#define CSW_SVCF_EGEAR_USE			TRUE
/*--------------------------------------------------------------------------*/
/*		モデル追従制御使用・不使用設定										*/
/*--------------------------------------------------------------------------*/
#define CSW_SVCF_MFC_USE			TRUE
/*--------------------------------------------------------------------------*/
/*		A型制振制御使用・不使用設定											*/
/*--------------------------------------------------------------------------*/
#define CSW_SVCF_ATYPE_RES_VIB_USE	TRUE
/*--------------------------------------------------------------------------*/
/*		振動検出使用・不使用設定											*/
/*--------------------------------------------------------------------------*/
#define CSW_SVCF_VIB_DETECT_USE		TRUE
/*--------------------------------------------------------------------------*/
/*		振動抑制フィルタ使用・不使用設定									*/
/*--------------------------------------------------------------------------*/
#define CSW_SVCF_RESVIB_FIL_USE		TRUE
/*--------------------------------------------------------------------------*/
/*		弱め界磁制御使用・不使用設定										*/
/*--------------------------------------------------------------------------*/
#define CSW_SVCF_WEAKENFIELD_USE	TRUE
/*--------------------------------------------------------------------------*/
/*		マイクロ電圧補償ゲイン機能使用・不使用設定							*/
/*--------------------------------------------------------------------------*/
#define CSW_SVCF_MPKVVCOMP			TRUE
/*--------------------------------------------------------------------------*/
/*		外乱オブザーバ使用・不使用設定										*/
/*--------------------------------------------------------------------------*/
#define CSW_SVCF_DISTURBOBS			TRUE
/*--------------------------------------------------------------------------*/
/*		位相補償速度オブザーバ使用・不使用設定								*/
/*--------------------------------------------------------------------------*/
#define CSW_SVCF_EHVOBS_USE			TRUE
/*--------------------------------------------------------------------------*/
/*		位置指令移動平均使用・不使用設定									*/
/*--------------------------------------------------------------------------*/
#define CSW_SERVO_PCMD_FIL_USE		TRUE									  /* <S065> */
/*--------------------------------------------------------------------------*/
/*		位置指令移動平均(指令更新周期補間用)使用・不使用設定				*/
/*--------------------------------------------------------------------------*/
#define CSW_CMDRENEW_PCMD_FIL_USE	FALSE									  /* <S065> */
/*--------------------------------------------------------------------------*/
/*		位置指令High Filter 使用・不使用設定				                        */
/*--------------------------------------------------------------------------*/
#define CSW_SERVO_PCMD_HIGH_FIL_USE   TRUE                                    /* <S0C3> */
/*--------------------------------------------------------------------------*/
/*		フルクローズド制御使用・不使用設定									*/
/*--------------------------------------------------------------------------*/
#define CSW_FULC_NO_SUPPORT			0	/* フルク制御無効 					*/
#define CSW_FULC_BASIC_SUPPORT		1	/* フルク制御有効					*/
#define CSW_FULC_SB_SUPPORT			2	/* フルク制御有効(ScanB位置ループ)	*/
//#define CSW_FULC_SA_SUPPORT		3	/* フルク制御有効(ScanA位置ループ)	*/
#define CSW_SVCF_FULC_MODE			CSW_FULC_BASIC_SUPPORT
/*--------------------------------------------------------------------------*/
/*		バックラッシ使用・不使用設定										*/
/*--------------------------------------------------------------------------*/
#define CSW_SVCF_BACKLASHCOMP		TRUE		/* <S18B> */
/*--------------------------------------------------------------------------*/
/*		FB位置ラッチ使用・不使用設定										*/
/*--------------------------------------------------------------------------*/
#define CSW_SVCF_FBLATCH			TRUE									/* <S004> */
/*--------------------------------------------------------------------------*/
/*		機種定義（機種による低速ＯＬ機能の有無）									*/
/*--------------------------------------------------------------------------*/
#define CSW_SVCF_CHKAMPLOL 			1										/* <S154> */
/*--------------------------------------------------------------------------*/
/*		寿命予測使用・不使用設定											*/
/*--------------------------------------------------------------------------*/
//#define CSW_SVCF_LIFEPRED_USE 		TRUE									/* <S154> *//* <S186> */
#define CSW_SVCF_LIFEPRED_USE 		FALSE									/* <S154> *//* <S186> */
/*--------------------------------------------------------------------------*/
/*		消費電力モニタ使用・不使用設定										*/
/*--------------------------------------------------------------------------*/
#define CSW_POWER_MONITOR_USE		TRUE									/* <S020> */
/*--------------------------------------------------------------------------*/
/*		トレースネットワークトリガ使用・不使用設定							*/
/*--------------------------------------------------------------------------*/
//#define CSW_NET_TRG_USE				TRUE								/* <S02D> *//* <S021> */
//#define CSW_NET_TRG_USE				FALSE								/* <S035> */	/* <S0C9> Delete */
#define CSW_NET_TRG_USE				TRUE									/* <S0C9> Delete */
/*--------------------------------------------------------------------------*/
/*		温度ICによるOH使用・不使用設定										*/
/*--------------------------------------------------------------------------*/
#define CSW_DETECT_OH_FROM_TEMPIC	TRUE									  /* <S0ED> */
/*--------------------------------------------------------------------------*/
/*		  	  ∑-7/∑-M Option												*/
/*--------------------------------------------------------------------------*/
#define PRODUCT_SERIES_SEVEN		TRUE                                		/* <S09F> */
#if(PRODUCT_SERIES_SEVEN == TRUE )                                          /* <S09F> */
/*---------------------------------------------------------------------------*/
/*		HWBB制御実行選択													 */
/*---------------------------------------------------------------------------*/
#define CSW_HW_HWBB_SUPPORT			FALSE
/*--------------------------------------------------------------------------*/
/*		分周パルス出力定義													*/
/*--------------------------------------------------------------------------*/
#define	SVFSEL_DIVOUT_USE			TRUE	 /* 分周出力(TRUE:使用;FALSE:不使用)   *//*<S02D>*/
/*--------------------------------------------------------------------------*/
/*		オプションカード対応定義											*/
/*--------------------------------------------------------------------------*/
/* CSW_OPT_CARD_OPTION_SUPPORT ０ｘ＊＊＊＊									*/
/* 								   │││└	セーフティー対応状態			*/
/* 								   ││└ 指令オプション対応状態			*/
/* 								   │└ フィードバックオプション対応状態	*/
/* 								   └ 予約									*/
/*--------------------------------------------------------------------------*//* <S04D> */
/*	セーフティー対応定義													*/
#define CSW_SAFETY_NO_SUPPORT	0x0000			/* セーフティー無効 		*/
#define CSW_OPT_CARD_SAFETY		CSW_SAFETY_NO_SUPPORT

/*	指令オプション対応定義													*/
#define CSW_CMDOPTION_NO_SUPPORT	0x0000		/* 指令オプション無効 		*/
#define CSW_OPT_CARD_CMDOPTION		CSW_CMDOPTION_NO_SUPPORT

/*	フィードバックオプション対応定義										*/
#define CSW_FBOPTION_NO_SUPPORT	0x0000		/* フィードバックオプション無効 */
#define CSW_FBOPTION_SUPPORT	0x0100		/* フィードバックオプション有効 */
#define CSW_OPT_CARD_FBOPTION	CSW_FBOPTION_SUPPORT

/*	オプションカード対応定義												*/
#define CSW_OPT_CARD_NO_SUPPORT	0x0000		/* オプションカード無効			*/
#define CSW_OPT_CARD			(CSW_OPT_CARD_SAFETY |\
								  CSW_OPT_CARD_CMDOPTION |\
								   CSW_OPT_CARD_FBOPTION )
									   
/*--------------------------------------------------------------------------*/
/*		AD(オーバヒート)制御実行選択									    */
/*--------------------------------------------------------------------------*/
#define	SVFSEL_ONLY_OH_ADC_USE 		(1)		/* 1: ADC使用 0: 未使用		    */

/*	デシメーションフィルタ	<S202>											*/
#define CSW_DECIMATION	0x0000		/* CH1,2 Mode3 CH3 Mode1	*/

#endif

/*--------------------------------------------------------------------------*/
/*		基板温度検出機能定義												*/
/*--------------------------------------------------------------------------*/
#define CSW_DETECT_TEMPERATURE		TRUE									/* <S03A> */
/*--------------------------------------------------------------------------*/
/*		分周パルス出力定義													*/
/*--------------------------------------------------------------------------*/
//#define	SVFSEL_DIVOUT_USE			TRUE /* 分周出力(TRUE:使用;FALSE:不使用) <S09F> *//*<S02D>*/


/****************************************************************************/
/*		スキャン周期、実行タイミング定義									*/
/****************************************************************************/
/*--------------------------------------------------------------------------*/
/*		サイクルタイム定義													*/
/*--------------------------------------------------------------------------*/
#define NS_CHANGE_MS	1000000					/* [ms] ⇒ [ns]変換係数		*/
#define US_CHANGE_MS	1000					/* [us] ⇒ [ms]変換係数		*/
#define NS_CHANGE_US	1000					/* [ns] ⇒ [us]変換係数		*/

/*--------------------------------------------------------------------------*/
/*		JL-077μスキャン周期												*/
/*--------------------------------------------------------------------------*/
#define KPI_MACYCLENS	15625							/* ScanI Cycle[ns]	*/
#define KPI_MBCYCLENS	62500							/* MprgB Cycle[ns]	*/
#define KPI_SACYCLENS	62500							/* ScanA Cycle[ns]	*/
#define KPI_SACYCLEUS	((KPI_SACYCLENS + 500)/1000)	/* ScanA Cycle[us]	*/
#define KPI_MBCYCLEUS	((KPI_MBCYCLENS + 500)/1000)	/* MprgB Cycle[us]	*/
#define KPI_SACOUNTMS	(1000000/KPI_SACYCLENS)			/* ScanA Cycle Count per 1ms */

/*--------------------------------------------------------------------------*/
/*		ScanB周期(ScanB周期はパラメータで決まるため、デフォルト値を定義)	*/
/*--------------------------------------------------------------------------*/
#define KPI_SBCYCLE_BASE_NS		125000		/* ScanB Base Cycle Time [ns]	*/
#define KPI_SBCYCLEUS			(KPI_SBCYCLE_BASE_NS / 1000 )	  /* [us]	*//* <S039> */
#define KPI_SBCYCLE_TIME		2			/* ScanB Cycle Time [125us]		*/
#define KPI_SBCOUNTMS			(1000000/KPI_SBCYCLE_BASE_NS)	/* ScanB Cycle Count per 1 ms */
#define	KPI_SCANB_MS( ms )		( (ms)*KPI_SBCOUNTMS )

/*--------------------------------------------------------------------------*/
/*		ScanC周期														 	*/
/*--------------------------------------------------------------------------*/
#define KPI_SCCYCLEMS			2
#define KPI_SCCYCLEUS			( KPI_SCCYCLEMS * 1000  )
#define KPI_SCANC_MS( ms )		( (ms)/KPI_SCCYCLEMS )

/*--------------------------------------------------------------------------*/
/*		MECHATROLINK処理タイミング定義										*/
/*--------------------------------------------------------------------------*/
#define SCAN_N_DEFCYCLE			1				/* デフォルト通信TASK周期[ScanBカウント] */
#define CFG_TIO_BASE_TIME		500				/* サーボ制御周期[0.25us]	*/
//#define CFG_POSERR_DELAY		KPI_MBCYCLENS	/* 位置偏差モニタ用補正時間[ns] */
#define CFG_POSERR_DELAY		KPI_SBCYCLE_BASE_NS	/* 位置偏差モニタ用補正時間[ns] *//* <S0C0> */



/*****************************************************************************/
/*		電源関連、HW制御機能SW定義											 */
/*****************************************************************************/
/*---------------------------------------------------------------------------*/
/*		DMA転送有効スイッチ													 */
/*---------------------------------------------------------------------------*/
#define CSW_MAICRO_DMA_TRANSFER	FALSE	/* Enable DMA transfer for JL077-uP and CPU */
#define CSW_M3_DMA_TRANSFER		FALSE	/* Enable DMA transfer for JL100 and CPU */

/*---------------------------------------------------------------------------*/
/*		PN Voltage Detect by Decimation Filter(PnE0C.bit13, PnE7Cで定義)	 */
/*---------------------------------------------------------------------------*/
/* PnE0C.bit13=1 & このSWで切り替え(後でパラメータOnlyにする) */
#define AD_DETECT_DECIMATION		TRUE

#define CSW_HW_POWER_MANAGE			TRUE	/* 電源管理処理実行選択 */
#define CSW_HW_REGENERATION_CTRL	TRUE	/* 回生処理選択*/
#define CSW_HW_CHKRUSH				TRUE	/* 突入抵抗過負荷検出選択 */
#define CSW_HW_DC_DETECT			TRUE	/* DC電源電圧検出選択 */
#define CSW_HW_INTERNAL_FAN			TRUE	/* 内蔵ファンの有無 */
#define CSW_HW_DCBUS				FALSE	/* DC入力モード選択 */


/*---------------------------------------------------------------------------*/
/*		DB制御実行選択														 */
/*---------------------------------------------------------------------------*/
#define CSW_HW_DB_CTRL				TRUE
/*---------------------------------------------------------------------------*/
/*		HWBB制御実行選択													 */
/*---------------------------------------------------------------------------*/
//#define CSW_HW_HWBB_SUPPORT			FALSE   /* <S09F> */

/*---------------------------------------------------------------------------*/
/*		複数軸同時インタロック機能選択										 */
/*---------------------------------------------------------------------------*/
#ifdef CSW_BSP_SGDZ_IFBS80
#define CSW_SVON_INTERLOCK
#define SVON_LOCK_GRP1				0x00000006		// Axis 1 and 2 on CB2 board
#define SVON_LOCK_GRP2				0x000000f8		// Axis 3 and 8 on CC board
#define SVON_LOCK_GRP1_MAX			1
#define SVON_LOCK_GRP2_MAX			3

#define OH_ALM_SLOT_GRP1			0x00000006		// Axis 1 and 2 on CB2 board
#define OH_ALM_SLOT_GRP2			0x000000f8		// Axis 3 and 8 on CC board

#endif	//CSW_BSP_SGDZ_IFBS80

/*****************************************************************************/
/*		その他																 */
/*****************************************************************************/
/*---------------------------------------------------------------------------*/
/*		Amp and Mot Type Definition											 */
/*---------------------------------------------------------------------------*/
#define MOTTYPE_ROTARY				0x00		/* 回転型モーター */
#define MOTTYPE_LINEAR				0x01		/* リニアモーター */

/*---------------------------------------------------------------------------*/
/*		Un Monitor Average time												 */
/*---------------------------------------------------------------------------*/
#define SVCDEF_UNSPD_SCMEANNUM		((64 + KPI_SCCYCLEMS - 1) / KPI_SCCYCLEMS)
#define SVCDEF_UNSPD_SCMEANTMMS		( KPI_SCCYCLEMS * SVCDEF_UNSPD_SCMEANNUM )
/*---------------------------------------------------------------------------*/
/*		Motor Selection Definition											 */
/*---------------------------------------------------------------------------*//* <S04D> */
#define	MOTSEL_YASKAWA		0x00				/* 安川モータ(標準)			 */
#define	MOTSEL_NONYASKAWA	0xF0				/* 他社モータ				 */
/*---------------------------------------------------------------------------*/
/*		Encoder Selection Definition										 */
/*---------------------------------------------------------------------------*//* <S04D> */
#define	ENCSEL_SERIAL		0x00				/* シリアルエンコーダ		 */
#define	ENCSEL_PULSE		0x10				/* ＡＢパルエンコーダ		 */
#define	ENCSEL_ANALOG 		0x20				/* アナログエンコーダ		 */
#define	ENCSEL_ENCLESS		0xFF				/* エンコーダレス			 */

/*---------------------------------------------------------------------------*/
/*		Normalize Multiplier Factor											 */
/*---------------------------------------------------------------------------*/
#define NORM_TRQ_TO_IQ			3840000		/* TrqRef(2^24) --> IqRef(15000) */
#define NORM_IQ_TO_TRQ			73300775	/* IqRef(15000) --> TrqRef(2^24) */


/*---------------------------------------------------------------------------*/
/*		<S031> LCD Operator Parameter Copy									 */
/*---------------------------------------------------------------------------*/
#define	SVFSEL_LCDPRMCOPY_USE 	(1)		/* 1: LCDパラメータコピー使用 0: 未使用			*/

extern LONG NumberOfAxes;		// 制御軸数



#endif /* _SYSTEM_SETTING_H */

/* <S056>	Start */
/*---------------------------------------------------------------------------*/
/*		Information Register Definition										 */
/*---------------------------------------------------------------------------*/
#define SERVO_ID			0x072	/* サーボ機種ID : SFD7S_M3 = 0x0072 */
#define INPUT_SIGNAL_INFO	0x0000007f	/* 入力信号 有効/無効情報 */
										/* SI0?SI6:有効 */
										/* SI7?SI31:無効 */
/* <S173> Start */
/* 出力信号 有効/無効情報見直しの為、コメントアウト */
#if 0
#define OUTPUT_SIGNAL_INFO	0x0000000E	/* 出力信号 有効/無効情報 */
										/* SO1?SO3:有効 */
										/* SO0,SO4?SO31:無効 */
#endif

/* 出力信号 有効/無効情報見直し */
#define OUTPUT_SIGNAL_INFO	0x0000000f	/* 出力信号 有効/無効情報 */
										/* ALM,SO1～SO3:有効 */
										/* SO4～SO31:無効 */

#define	INPUT_SIGMON_BIT_NUM		7	/* SI*の入力点数(同SGDV)		*//* <S1C0> */
#define	OUTPUT_SIGMON_BIT_NUM		3	/* SO*の出力点数(同SGDV)		*//* <S1C0> */
#define	OUTPUT_SIGMON_BIT_SFT		7	/* SO0の格納位置(同SGDV)		*//* <S1C0> */
/* <S173> End */
/* <S056>	End */

#define ALM_WARNING_AUTO_CLEAR	FALSE	/* <S184> ワーニング自動クリア選択 */


/*---------------------------------------------------------------------------*/
/*		<S09B> Auto Gain Change												 */
/*---------------------------------------------------------------------------*/
#define		SVFSEL_ATGAINCHANGE_USE	(1)				/* 1: 自動ゲイン切替使用 0: 未使用				*/
/***************************************** end of file **********************************************/
