#ifndef	_MEMOBUS_IF_H /* 再読み込み防止用 */
/****************************************************************************************************/
/*																									*/
/*																									*/
/*		MemobusIF.h : Memobus処理関数定義															*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/************** Copyright (C) Yaskawa Electric Corporation ******************************************/
/*																									*/
/*																									*/
/*																									*/
/*	Note	:	初版	2010.09.13	T.Kira	For INGRAM												*/
/*																									*/
/*	Log		:	Ver1.00																				*/
/*																									*/
/****************************************************************************************************/
#include "Basedef.h"
#ifndef	_MERCURY_PLATFORM_			/*<S190>*/
#include "PrmAccessIf.h"
#endif	/*_MERCURY_PLATFORM_*/



/****************************************************************************************************/
/*		DEFINES																						*/
/****************************************************************************************************/
/*--------------------------------------------------------------------------------------------------*/
/*		チャンネル定義																				*/
/*--------------------------------------------------------------------------------------------------*/
#define	COM2_OPT1		0x01				/* CH2 : C1 message										*/
#define	COM3_OPT2		0x02				/* CH3 : C2 message										*/

/*--------------------------------------------------------------------------------------------------*/
/*	MEMOBUS メッセージ通信ヘッダ部定義																*/
/*--------------------------------------------------------------------------------------------------*/
#define	MSG_MAXBUFSZB			582				/* バッファサイズ(>=最大Memobusサイズ)				*/
#define	MBUS_MINSIZE			8				/* MEMOBUSメッセージ最小バイト数					*/
#define	MBUS_MAXSIZE			480				/* MEMOBUSメッセージ最大バイト数(LONGで割り切れる数)*/
#define	MBUS_HDROFS				0x00			/* ヘッダ部のサイズ(0Byte)							*/
#define	MBUS_MIN_REGNUM			1				/* 最小レジスタ読出し書込み個数						*/





#ifndef	_MERCURY_PLATFORM_			/*<S190>*/
/****************************************************************************************************/
/*		STRUCT DEFINITION																			*/
/****************************************************************************************************/
typedef	struct	_MEMOBUS_ADDR_MAP {
	LONG				AxisAddress;
	REG_MANAGER_HANDLE	*hRegMngr;
	void				*Axis;		/* 軸毎の先頭アドレス */
} MEMOBUS_ADDR_MAP;

/*--------------------------------------------------------------------------------------------------*/
/*		レジスタＩＦ用データ定義																	*/
/*--------------------------------------------------------------------------------------------------*/
typedef	struct	_MEMOBUS_IF {					/* メッセージＩＦ用構造体定義						*/
	UCHAR	RxBuf[ MSG_MAXBUFSZB ];				/* 受信データバッファ								*//* <S01C> */
	UCHAR	TxBuf[ MSG_MAXBUFSZB ];				/* 送信データバッファ								*//* <S01C> */
//	UCHAR	*RxBuf;								/* 受信データバッファ								*//* <S01C> */
//	UCHAR	*TxBuf;								/* 送信データバッファ								*//* <S01C> */
	UCHAR	*CmdBuf;							/* 指令メッセージバッファポインタ					*/
	UCHAR	*ResBuf;							/* 応答メッセージバッファポインタ					*/
	USHORT	RelayHdSize;						/* 中継コマンドヘッダーサイズ						*/
	USHORT	RcvbLength;							/* 受信データ長(バイト単位)							*/
	USHORT	RcvwLength;							/* 受信データ長(ワード単位)							*/
	USHORT	TrnbLength;							/* 送信データ長(バイト単位)							*/
	LONG	NodeAddress;						/* 自局アドレス										*/
	ULONG	ComTimeLong;						/* 通信タイムアウト計測用							*/

	MEMOBUS_ADDR_MAP	AxisMap[MAX_AXIS_NUMBER];/* 軸アドレス定義									*/
	
	ULONG	ErrRno;								/* レジスタ読み出し:MEMOBUSエラー情報				*/	/* <S056> */
	USHORT	OpeDspMode;							/* オペレータのユーザー定数表示選択					*/	/* <S056> */

} MEMOBUS_IF;



/****************************************************************************************************/
/*		PROTOTYPE																					*/
/****************************************************************************************************/
/* MEMOBUS メッセージ処理初期化 */
void	MbusFuncInitialize(MEMOBUS_IF *MbusIfPtr, MEMOBUS_ADDR_MAP *AxisCfg, LONG node_address );

/* MEMOBUS メッセージ解析＆実行処理	*/
USHORT	MbusFuncMsgProcedure( MEMOBUS_IF *MbusIfPtr );

/* MEMOBUS メッセージバッファ Swap処理(BigEndian用) */
void mbusFuncBufSwap( UCHAR *RxBuf );
#endif	/*_MERCURY_PLATFORM_*/




/***************************************** end of file **********************************************/
#define _MEMOBUS_IF_H /* 再読み込み防止用 */
#endif /* _MEMOBUS_IF_H */
