/****************************************************************************
Description	: ANALOG&PULSE Task Interface Procedure
----------------------------------------------------------------------------
Author        : Yaskawa Electric Corp.,
				Copyright (c) 2013 All Rights Reserved

Project       : Mercury

----------------------------------------------------------------------------
Changes		:
Name   Date          Description
------------------------------------------------------------------------
	  2013.09.20     created <S00C>

****************************************************************************/
#include "ScanN.h"

/****************************************************************************
 ネットワークモジュール初期化処理
****************************************************************************/
VOID OpiInitialize(void *axRsc)
{
	;
}

/****************************************************************************
 ネットワークモジュール初期パラメータ計算処理
****************************************************************************/
VOID OpiCalcInitParam( VOID *axRsc )
{
	;
}

/****************************************************************************
 ネットワークモジュールデバイス初期化処理
****************************************************************************/
VOID OpiInitDevice(void *axRsc, void *DeviceAddress)
{
	;
}

/****************************************************************************
 ネットワークモジュールデバイススタートアップ処理
****************************************************************************/
VOID OpiStartDevice( VOID *axRsc, void *DeviceAddress )
{
	;
}


/****************************************************************************
 ネットワークモジュールRound処理
****************************************************************************/
BOOL OpiRoundProcedure(VOID *axRsc)
{
	return FALSE;
}


BOOL OpiIntSync(VOID *axRsc, BOOL IntStatus)
{
	return FALSE;
}


/****************************************************************************
 ネットワークモジュールサイクリック入力処理
****************************************************************************/
BOOL OpiInputProcess( VOID *axRsc, BOOL IntStatus )
{
	return FALSE;
}

/****************************************************************************
 ネットワークモジュール定周期処理
****************************************************************************/
VOID OpiRunTimeScanProcess( void *axRsc, BOOL irqSts )
{
int ax_no;
AXIS_HANDLE *pAxRsc = (AXIS_HANDLE *)axRsc;
SV_OPTION_IF *pSvOptionIf = &(pAxRsc->SvControlIf->CmdOptionIf);

	for( ax_no = 0; ax_no < NumberOfAxes; ax_no++ )
	{
		NpiScanNMain( pSvOptionIf++ );
	}
}

/****************************************************************************
 ネットワークモジュールサイクリック出力処理
****************************************************************************/
BOOL OpiOutputProcess( VOID *axRsc, BOOL IntStatus )
{
	return FALSE;
}

/****************************************************************************
 ネットワークモジュールScanC処理
****************************************************************************/
VOID OpiScanCProcedure(VOID)
{
	;
}

/****************************************************************************
 ネットワーク安定状態取得処理		<S1DB>
****************************************************************************/
BOOL OpiCheckStableState( void *axRsc )
{
//	return TRUE;			/* 2ms内処理時間測定用修正 <S1FE> */
	return FALSE;
}

/****************************************************************************
 ネットワーク安定状態取得処理		<S1DB>
****************************************************************************/
void OpiResetSyncExe( void *axRsc )
{
	return;
}
