/****************************************************************************
Description	: Motor Less Test Mode
----------------------------------------------------------------------------
Author        : Yaskawa Electric Corp.,
				Copyright (c) 2013 All Rights Reserved

Project       : Mercury

Functions	  :
	-- APIs --
	 - モータレステスト -
	ApxMotorLessTestModeMechaModel()	: モータレステストモードメカモデル演算
	PcalMotorLessTestMode()				: モータレステストモードパラメータ計算
	ApxInitMotorLessTestMode()			: モータレステストモード変数初期化
	ApiSetCurDatasMotorLessTestMode()	: モータレステストモード電流データ設定
	ApiSetMechaDatasMotorLessTestMode()	: モータレステストモード速度・位置データ設定
	ApiReadMotPrmMotorLessTestMode()	: モータレステストモード用モータパラメータ計算：エンコーダ未接続時
	ApiReadFencPrmMotorLessTestMode()	: モータレステストモード用モータパラメータ計算：フルクエンコーダ未接続時

	 - モータレステストモード -
	MltSetMotorLessTestMode()			: モータレステストモードフラグ設定

	- モータレステストモードIF定義アドレス取得(現状未使用) -
	MltGetMotorLessTestMode()			: モータレステストモードステータス取得
	MltGetMotorLessTestHandle()			: モータレステストモードIF定義アドレス取得

----------------------------------------------------------------------------
	 - セミクローズドエンコーダ関連 - (SencScanService.cに存在)
	LpxSencMotLessInitVariables()		: エンコーダ変数初期化処理
	RmxReadMotorLessPosition()			: 回転型位置データ読込み
	LmxReadMotorLessPosition()			: リニア位置データ読込み
	LpxSetSencInfoMotorLessTestMode()	: エンコーダパラメータ設定処理
	LpxGetSencMotLessMturnData()		: マルチターンデータ取得処理
	LpxSencMotLessMultiTurnSet()		: マルチターンデータ設定処理

	 - フルクローズドエンコーダ関連 - (SencScanService.cに存在)
	LpxFencMotLessInitVariables()		: エンコーダ変数初期化処理
	LpxSetFencInfoMotorLessTestMode()	: エンコーダパラメータ設定処理
	LpxReadMotorLessFencPosition()		: 位置データ読込み

----------------------------------------------------------------------------
Changes		:
Name		Date			Description
------------------------------------------------------------------------
K.Sakamoto	2013.11.11		created	<S00X>

****************************************************************************/
#include "Basedef.h"
#include "config.h"
#include "MercuryGlobals.h"
#include "BaseControlPrmCalc.h"
#include "MotorLessTest.h"
#include "KnlApi.h"
#include "Mlib.h"

/*==========================================================================*/
/* defines																	*/
/*==========================================================================*/
#define	MDLCYCLE		KPI_SACYCLENS			/* メカモデル演算ｻｲｸﾙﾀｲﾑ(速度ﾙｰﾌﾟと同じｽｷｬﾝ)	[ns]*/
#define	C10POW9			1000000000				/* 10^9												*/
#define	C10POW7			10000000				/* 10^7												*/
#define	C2PAIE7			62831853				/* (2*PAI) * 10^7									*/


/*==========================================================================*/
/* PROTOTYPE																*/
/*==========================================================================*/


/*==========================================================================*/
/* PROGRAM																	*/
/*==========================================================================*/

/*****************************************************************************
  Description : モータレステストモードメカモデル演算
	入力されたトルク指令に対する剛体メカモデルの速度、位置応答を演算する

	MotorLessMdl.V.MotMdlSpdFbk		：速度ＦＢ				[2^24/OvrSpd]
	MotorLessMdl.V.MotMdldPosFbk	：モータ位置ＦＢ差分	[pluse/scan]
	MotorLessMdl.V.MotMdlPosFbk		：モータ位置ＦＢ		[pluse]
	MotorLessMdl.V.MechaMdldPosFbk	：位置ＦＢ差分			[pluse/scan]
	MotorLessMdl.V.MechaMdlPosFbk	：位置ＦＢ				[pluse]
----------------------------------------------------------------------------
  Parameters:
	TrqRef;					トルク指令	[2^24/MaxTrq]
	BeComplete;				ベースイネーブル完了状態
	MotorLessTest;			モータレステストモードIF定義へのポインタ
  Return:
	none
----------------------------------------------------------------------------
  Note:
*****************************************************************************/
void ApxMotorLessTestModeMechaModel( LONG TrqRef, BOOL BeComplete, MOTLESSTST *MotorLessTest )
{
	MOTLESSMDL	*MotorLessMdl;		/* 内部メカモデル用データへのポインタ	*/
	MOTLESSMDLP	*MotorLessMdl_P;	/* 有効なパラメータへのポインタ			*/

	LONG		MotSpd;				/* モータ速度							*/
	LONG		dMotPos;			/* モータ位置ＦＢ差分					*/
	LONG		dFbPos;				/* 位置ＦＢ差分							*/
	LONG		MotAcc;				/* 加速度ＦＢ							*/

	/* 変数初期化	*/
	MotorLessMdl	= &(MotorLessTest->MotorLessMdl);
	MotorLessMdl_P	= MotorLessMdl->PrmPtr;

	/*----------------------------------------------------------------------*/
	/*	ベースブロック時の処理												*/
	/*----------------------------------------------------------------------*/
	if( BeComplete == FALSE )
	{
		MotorLessMdl->V.MotMdlpfbrem = 0;
		MotorLessMdl->V.MotMdlpfbremM = 0;
		MotorLessMdl->V.Mvar = 0;
		MotorLessMdl->V.MotMdlSfbrem = 0;
	}

	/*----------------------------------------------------------------------*/
	/*	剛体メカモデル														*/
	/*----------------------------------------------------------------------*/
	/* 加速度ＦＢ	*/
	MotAcc = MlibPfbkxremNolim( TrqRef, MotorLessMdl_P->MdlKj, &MotorLessMdl->V.MotMdlSfbrem );
	/* 速度ＦＢ		*/
	MotorLessMdl->V.Mvar = MlibLimitul( (MotorLessMdl->V.Mvar + MotAcc), 0x2000000, -0x2000000 );
	MotSpd = MotorLessMdl->V.Mvar;

	/* モータ位置ＦＢ差分 → フルク時はフルク位置差分を返す		*/
	dFbPos = MlibPfbkxremNolim( MotorLessMdl->V.Mvar, MotorLessMdl_P->MdlKvp, &MotorLessMdl->V.MotMdlpfbrem );

	/* モータ位置ＦＢ差分 → フルク時でもモータ位置差分を返す	*/
	dMotPos = MlibPfbkxremNolim( MotorLessMdl->V.Mvar, MotorLessMdl_P->MdlKvpM, &MotorLessMdl->V.MotMdlpfbremM );

	/*----------------------------------------------------------------------*/
	/*	速度、位置ＦＢ作成													*/
	/*----------------------------------------------------------------------*/
	MotorLessMdl->V.MotMdlSpdFbk = MotSpd;		/* 速度ＦＢ				[2^24/OvrSpd]	*/
	MotorLessMdl->V.MotMdldPosFbk = dMotPos;	/* モータ位置ＦＢ差分	[pluse/scan]	*/
	MotorLessMdl->V.MotMdlPosFbk += dMotPos;	/* モータ位置ＦＢ		[pluse]			*/
	MotorLessMdl->V.MechaMdldPosFbk = dFbPos;	/* 位置ＦＢ差分			[pluse/scan]	*/
	MotorLessMdl->V.MechaMdlPosFbk += dFbPos;	/* 位置ＦＢ				[pluse]			*/

	/*----------------------------------------------------------------------*/
	/*	モニタ用変数出力													*/
	/*----------------------------------------------------------------------*/
//[org]	BoutV.AmonMotorLessTestMdlSpd = MotorLessMdl->V.MotMdlSpdFbk;

	return;

}


/*****************************************************************************
  Description : モータレステストモードパラメータ計算
----------------------------------------------------------------------------
  Parameters:
	Fenc;					フルクエンコーダデータへのポインタ
	Bprm;					基本パラメータ定義へのポインタ
	Prm;					パラメータ定義へのポインタ
	MOTLESSMDL;				内部メカモデル用データへのポインタ
  Return:
	none
----------------------------------------------------------------------------
  Note:
*****************************************************************************/
void PcalMotorLessTestMode( MENCV *FencV, BPRMDAT *Bprm, PRMDATA *Prm, MOTLESSMDL *MotorLessMdl )
{

	LONG		sx;						/* ゲイン計算用ワーク				*/
	LONG		kx;						/* ゲイン計算用ワーク				*/
	LONG		index;					/* 編集側パラメータインデックス		*/
	MOTLESSMDLP	*wrkp;					/* 編集側パラメータへのポインタ		*/

	/* 更新する側のインデックスを取得 */
	index = 0;
	if( MotorLessMdl->PrmPtr == &(MotorLessMdl->P[index]) )
	{
		index = 1;
	}

	/* 編集側パラメータアドレスの取得	*/
	wrkp = &(MotorLessMdl->P[index]);

	/*----------------------------------------------------------------------*/
	/*	モデル演算	: NormalizedSpeed -> Pulse/Scan							*/
	/*----------------------------------------------------------------------*/
	/*																		*/
	/*			  scantime[ns]												*/
	/*	MdlKvp = -----------------											*/
	/*			 Hprm.Kpx * 10^9  											*/
	/*																		*/
	/*----------------------------------------------------------------------*/
	wrkp->MdlKvp = MlibScalKxkxks( 1, 1, Bprm->Kpx, &sx,  0 );
	wrkp->MdlKvp = MlibPcalKxgain( wrkp->MdlKvp, MDLCYCLE, C10POW9, &sx, 24 );

	/*--------------------------------------------------------------------------------------*/
	/*	モータモデル演算	: NormalizedSpeed -> Pulse/Scan									*/
	/*--------------------------------------------------------------------------------------*/
	/*																						*/
	/*		  	    scantime[ns]		Bprm.MotPulse										*/
	/*	MdlKvpM = -----------------	* ------------------	Bprm.MotPulse	:[pulse/rev]	*/
	/*			   Hprm.Kpx * 10^9  	     kx 			FencP.MotPulseNo:[pulse/rev]	*/
	/*																						*/
	/*										kx : Full-Closed -> FencP.MotPulseNo			*/
	/*											 Semi-Closed -> Bprm.MotPulse				*/
	/*--------------------------------------------------------------------------------------*/
	if( Bprm->FencUse )
	{
		kx = FencV->PulseNo;							/* Full-Closed Control				*/
	}
	else
	{
		kx = Bprm->MotPulse;							/* Semi-Closed Control				*/
	}
	wrkp->MdlKvpM = MlibScalKxkxks( 1, 1, Bprm->Kpx, &sx,  0 );
	wrkp->MdlKvpM = MlibPcalKxgain( wrkp->MdlKvpM, Bprm->MotPulse, kx, &sx,  0 );
	wrkp->MdlKvpM = MlibPcalKxgain( wrkp->MdlKvpM, MDLCYCLE, C10POW9, &sx, 24 );

	/*----------------------------------------------------------------------*/
	/*	モデル演算	:  NormalizedObsJGain									*/
	/*----------------------------------------------------------------------*/
	wrkp->MdlKj = BpxNorObsJGainCal( Bprm->Kvx, Prm->jrate, 100 , MDLCYCLE );

	/*----------------------------------------------------------------------*/
	/*	Set Parameters														*/
	/*----------------------------------------------------------------------*/
	/* 参照用ポインタを更新する */
	MotorLessMdl->PrmPtr = &(MotorLessMdl->P[index]);

	return;
}


/*****************************************************************************
  Description : モータレステストモード変数初期化
----------------------------------------------------------------------------
  Parameters:
	AxisRsc;				軸ハンドル
  Return:
	none
----------------------------------------------------------------------------
  Note:
	暫定版
*****************************************************************************/
void ApxInitMotorLessTestMode( AXIS_HANDLE *AxisRsc )
{
	MOTLESSTST	*MotorLessTest;		/* モータレステストモードIF定義へのポインタ	*/
	MOTLESSMDL	*MotorLessMdl;		/* 内部メカモデル用データへのポインタ		*/

	/* 変数初期化 */
	MotorLessTest	= AxisRsc->MotorLessTest;
	MotorLessMdl 	= &(MotorLessTest->MotorLessMdl);

	/* APIの引数で指定が困難なデータへのポインタの初期化	*/
	MotorLessTest->MencV	= AxisRsc->MencV;
	MotorLessTest->FencV	= AxisRsc->FencV;
	MotorLessTest->Prm		= AxisRsc->UniPrms->Prm;

	/* 領域初期化 */
	MlibResetLongMemory( &(MotorLessMdl->V), sizeof(MotorLessMdl->V)/4 );

	return;
}


/*****************************************************************************
  Description : モータレステストモード電流データ設定
	電流データをＦＢデータに代入する
----------------------------------------------------------------------------
  Parameters:
	BaseLoops;				制御ループ演算用データへのポインタ
	CtrlLoopOut;			ScanA出力データへのポインタ
  Return:
	none
----------------------------------------------------------------------------
  Note:
*****************************************************************************/
void ApiSetCurDatasMotorLessTestMode( BASE_LOOPCTRLS *BaseLoops, CTRL_LOOP_OUT *CtrlLoopOut )
{
	/*----------------------------------------------------------------------*/
	/*	電流指令、ＦＢ														*/
	/*----------------------------------------------------------------------*/
	/* ｑ軸電流指令			[15000/Imax]	*/
	CtrlLoopOut->IqRefMon = MlibMulhigh32( BaseLoops->TrqRefoLimit, 3840000 );
	/* ｄ軸電流指令			[15000/Imax]	*/
	CtrlLoopOut->IdRefMon = 0;

	CtrlLoopOut->IqRefMon_a = ( CtrlLoopOut->IqRefMon + CtrlLoopOut->IqRefMon_l ) >> 1;
	CtrlLoopOut->IqRefMon_l = CtrlLoopOut->IqRefMon;

	/* ｑ軸電流ＦＢ = ｑ軸電流指令			*/
	CtrlLoopOut->IqFbMon = CtrlLoopOut->IqRefMon;
	/* ｄ軸電流ＦＢ = ｄ軸電流指令			*/
	CtrlLoopOut->IdFbMon = CtrlLoopOut->IdRefMon;

	return;
}


/*****************************************************************************
  Description : モータレステストモード速度・位置データ設定
	メカモデルデータをＦＢデータに代入する
----------------------------------------------------------------------------
  Parameters:
	Bprm;					基本パラメータ定義へのポインタ
	MotorLessTest;			モータレステストモードIF定義へのポインタ
  Return:
	none
----------------------------------------------------------------------------
  Note:
*****************************************************************************/
void ApiSetMechaDatasMotorLessTestMode( BPRMDAT *Bprm, MOTLESSTST *MotorLessTest )
{
	MENCV		*MencV;					/* モータエンコーダデータへのポインタ	*/
	MENCV		*FencV;					/* フルクエンコーダデータへのポインタ	*/
	MOTLESSMDL	*MotorLessMdl;			/* 内部メカモデル用データへのポインタ	*/
	MOTOR_LESS	*MotorLessTestDatas;	/* エンコーダIF用データへのポインタ		*/

	/* 変数初期化	*/
	MencV				= MotorLessTest->MencV;
	FencV				= MotorLessTest->FencV;
	MotorLessMdl		= &(MotorLessTest->MotorLessMdl);
	MotorLessTestDatas	= &(MotorLessTest->MotorLessTestDatas);

	/*----------------------------------------------------------------------*/
	/*	モータ位置ＦＢ差分													*/
	/*----------------------------------------------------------------------*/
	if( MencV->RevAsmMotor ^ Bprm->RvsDir )	/* 反転接続 XOR 逆回転モード	*/
	{
		MotorLessTestDatas->dSemiModePos =-MotorLessMdl->V.MotMdldPosFbk;
	}
	else
	{
		MotorLessTestDatas->dSemiModePos = MotorLessMdl->V.MotMdldPosFbk;
	}

	/*----------------------------------------------------------------------*/
	/*	フルク位置ＦＢ差分	-->		モータ位置ＦＢ差分と同じ				*/
	/*----------------------------------------------------------------------*/
	if( FencV->RevAsmMotor ^ Bprm->RvsDir )	/* Fenc逆回転モード XOR 逆回転モード	*/
	{
		MotorLessTestDatas->dFullModePos =-MotorLessMdl->V.MechaMdldPosFbk;
	}
	else
	{
		MotorLessTestDatas->dFullModePos = MotorLessMdl->V.MechaMdldPosFbk;
	}

	return;

}


/*****************************************************************************
  Description : モータレステストモード用モータパラメータ計算
	エンコーダ未接続時仮想モータパラメータをPnFxxに読み込む
----------------------------------------------------------------------------
  Parameters:
	MencV;					モータエンコーダデータへのポインタ
	Prm;					パラメータ定義へのポインタ
  Return:
	none
----------------------------------------------------------------------------
  Note:
*****************************************************************************/
void ApiReadMotPrmMotorLessTestMode( MENCV *MencV, PRMDATA *Prm )
{
	LONG	kx;						/* ゲイン計算用ワーク					*/
	LONG	sx;						/* ゲイン計算用ワーク					*/
	USHORT	ivcode;					/* 入力電圧コード						*/
	USHORT	EncBitNo;				/* エンコーダビット数					*/
	USHORT	EncType;				/* エンコーダタイプ						*/
	MENCPRM	*MencP;					/* エンコーダパラメータ定義へのポインタ	*/

	/* 変数初期化	*/
	MencP = &(Prm->MencP);

	/****************************************************************************/
	/*	PnF00 : モータ形式(8bit), 入力電圧(4bit), エンコーダタイプ(4bit) [－]	*/
	/****************************************************************************/

	/* モータ形式	*/
	MencP->typm_e.b.l = 0xFF;						/* 未定義					*/

	/* 入力電圧	*/
	ivcode = ( Prm->styp.b.h & 0xFF );				/* PnE11.H					*/
	if( ivcode == 0x05 )	ivcode = 0x01;			/* 100V倍電圧は200Vにする 	*/

	/* エンコーダタイプ	*/
	switch((Prm->b_prmC >> 8) & 0x0F)				/* Pn00C.2					*/
	{
		case 0x00:
		default :
				EncType = 0;						/* インクリメンタル			*/
			break;
		case 0x01:
				EncType = 1;						/* アブソリュート			*/
			break;
	}

	MencP->typm_e.b.h = ivcode + (EncType << 4);

	/****************************************************************************/
	/*	PnF01 : エンコーダソフトバージョン [－]									*/
	/****************************************************************************/
	MencP->encver = 0x0000;

	/****************************************************************************/
	/*	PnF02 : モータ容量 [W]													*/
	/****************************************************************************/
	MencP->motw = Prm->ampw;						/* = PnE12					*/

	/****************************************************************************/
	/*	PnF03 : エンコーダビット数, 位置データ小数点位置 [－]					*/
	/****************************************************************************/
/* <S1BB> >>>>> */
	/* Pn000.3の値でモータレステストモード時の回転形／リニアを決定しエンコーダ情報を更新する */
	switch( (Prm->b_prm0 >> 12) & 0xF )				/* Pn000.3					*/
	{
	case 0: /* 回転形 */
		/* fall through */
	default:
		MencV->AxisMotType = MOTTYPE_ROTARY;
		break;
	case 1:	/* リニア */
		MencV->AxisMotType = MOTTYPE_LINEAR;
		break;
	}
/* <<<<< <S1BB> */
	if( MencV->AxisMotType == MOTTYPE_LINEAR )
	{
		MencP->bit_dp.b.l = 0x08;
		MencP->bit_dp.b.h = 0x44;					/* 68桁目固定				*/
	}
	else
	{
		/* エンコーダ分解能	*/
		switch((Prm->b_prmC >> 4) & 0x0F)			/* Pn00C.1					*/
		{
			case 0x00:	
					EncBitNo = 13;					/* 13bit					*/
				break;
			case 0x01:
					EncBitNo = 20;					/* 20bit					*/
				break;
			case 0x02:
					EncBitNo = 22;					/* 22bit					*/
				break;
			case 0x03:
			default :
					EncBitNo = 24;					/* 24bit					*/
				break;
		}

		MencP->bit_dp.b.l = EncBitNo;
		MencP->bit_dp.b.h = 0x50;					/* 80桁目固定				*/
	}

	/****************************************************************************/
	/*	PnF04 : マルチターンリミット [Rev]										*/
	/****************************************************************************/
	MencP->limmlt = Prm->mtlmt;						/* = Pn205					*/

	/****************************************************************************/
	/*	PnF05 : 定格速度, 最大速度 [100min-1]									*/
	/****************************************************************************/
	MencP->vrat_max.w = Prm->MLess_vrat_max.w;		/* = PnEE0					*/

	/****************************************************************************/
	/*	PnF06 : ＯＳ検出レベル, ポール数 [%, -]									*/
	/****************************************************************************/
	MencP->oslv_pol.w = Prm->MLess_oslv_pol.w;		/* = PnEE1					*/

	/****************************************************************************/
	/*	PnF07 : 定格トルク [0.01Nm]												*/
	/*																			*/
	/*						ﾓｰﾀ容量[W] * 60			モータ容量:PnF02(=PnE12)	*/
	/*		定格ﾄﾙｸ[Nm] = -----------------------	定格速度  :PnF05.L(=PnEE0.L)*/
	/*						2π * 定格速度[min-1]								*/
	/*																			*/
	/****************************************************************************/
	kx = MlibScalKxgain( (LONG)MencP->motw, (60*C10POW7),  C2PAIE7, &sx, 0 );
	kx = MlibPcalKxgain( kx, 1, MencP->vrat_max.b.l, &sx, -24 );

	MencP->rattrq = MlibLimitul( kx, 0xFFFF, 0x0000 );

	/****************************************************************************/
	/*	PnF08 : 最大トルク [%]													*/
	/*																			*/
	/*		最大ﾄﾙｸ[%] = 最大電流 * 100 / 定格電流		最大電流:PnE15			*/
	/*													定格電流:PnE14			*/
	/****************************************************************************/
	MencP->maxtrq = (((Prm->imaxs * 200)/Prm->irats) + 1) >> 1;

	/****************************************************************************/
	/*	PnF09 : 定格電流 [0.1A]													*/
	/****************************************************************************/
	MencP->irat = Prm->irats;						/* PnF09 = PnE14			*/

	/****************************************************************************/
	/*	PnF0A : 瞬時最大電流 [0.1A]												*/
	/****************************************************************************/
	MencP->imax = Prm->imaxs;						/* PnF0A = PnE15			*/

	/****************************************************************************/
	/*	PnF0B : ＥＭＦ定数 [0.1mV/min-1]										*/
	/****************************************************************************/
	MencP->emfcmp = 100;							/* 未使用					*/

	/****************************************************************************/
	/*	PnF0C : ロータイナーシャ [10-6kgm2]										*/
	/****************************************************************************/
	MencP->jmot = Prm->Mless_jmot;					/* PnF0C = PnEE2			*/

	/****************************************************************************/
	/*	PnF0D : 電機子巻線抵抗 [0.001Ω]										*/
	/****************************************************************************/
	MencP->motr = 1000;								/* 未使用					*/

	/****************************************************************************/
	/*	PnF0E : 電機子インダクタンス [0.01mH]									*/
	/****************************************************************************/
	MencP->motl = 1000;								/* 未使用					*/

	/****************************************************************************/
	/*	PnF0F : 過負荷検出ベース電流 [%]										*/
	/****************************************************************************/
	MencP->bastrq = Prm->ibs_md.b.l;				/* PnF0F = PnE17.l			*/

	/****************************************************************************/
	/*	PnF10 : 過負荷検出中間電流 [%]											*/
	/****************************************************************************/
	MencP->midtrq = Prm->ibs_md.b.h * 10;			/* PnF10 = PnE17.h			*/

	/****************************************************************************/
	/*	PnF11 : 過負荷検出中間時間 [10s]										*/
	/****************************************************************************/
	MencP->midolt = Prm->imdt_mxt.b.l;				/* PnF11 = PnE18.l			*/

	/****************************************************************************/
	/*	PnF12 : 過負荷検出中間電流２ [%]										*/
	/****************************************************************************/
													/* PnF12 = PnE61.h	* imaxs/irats	*/
	kx = (LONG)Prm->ratmtt_2.b.h * (LONG)MencP->maxtrq / 100;
	MencP->mtrq2 = (USHORT)kx;

	/****************************************************************************/
	/*	PnF13 : 過負荷検出中間時間２ [s]										*/
	/****************************************************************************/
	MencP->mtolt2 = Prm->imdt_mxt.b.h;				/* PnF13 = PnE18.h			*/

	/****************************************************************************/
	/*	PnF14 : 位相補償１(補償値,開始速度) [deg,100min-1]						*/
	/****************************************************************************/
	MencP->phscmpM1.w = 0;							/* 未使用					*/

	/****************************************************************************/
	/*	PnF15 : ポールピッチ [0.1mm/180deg]										*/
	/****************************************************************************/
	MencP->ppitch = 225;							/* 22.5mm固定				*/

	/****************************************************************************/
	/*	PnF16 : q軸インダクタンスLq0 [0.01mH]									*/
	/****************************************************************************/
	MencP->motlq0 = 1000;							/* 未使用					*/

	/****************************************************************************/
	/*	PnF17 : q軸インダクタンスLq1 [0.01mH]									*/
	/****************************************************************************/
	MencP->motlq1 = 1000;							/* 未使用					*/

	/****************************************************************************/
	/*	PnF18 : 下位：定格トルク指数、上位：ロータイナーシャ指数 [10n]			*/
	/****************************************************************************/
	MencP->exp_trat_jmot.b.l = 0;					/* 未使用					*/
													/* PnF18.h = PnEE3.h		*/
	MencP->exp_trat_jmot.b.h = Prm->Mless_exp_spd_jmot.b.h;

	/****************************************************************************/
	/*	PnF19 : 下位：定格出力指数、上位：回転数指数 [10n]						*/
	/****************************************************************************/
	MencP->exp_motw_spd.b.l = 0;					/* 未使用					*/
													/* PnF19.h = PnEE3.l		*/
	MencP->exp_motw_spd.b.h = Prm->Mless_exp_spd_jmot.b.l;

	/****************************************************************************/
	/*	PnF1A : フルクエンコーダビット数, 位置データ小数点位置 [－]				*/
	/****************************************************************************/
	/* ここでは設定しない */

	/****************************************************************************/
	/*	PnF1B : ポールセンサオフセット量 [deg]									*/
	/****************************************************************************/
	MencP->poleoffset = 0;							/* 未使用					*/

	/****************************************************************************/
	/*	PnF1C : モータ共振抑制用ノッチフィルタ周波数 [Hz]						*/
	/****************************************************************************/
	MencP->motresfrq = 0;							/* 未使用					*/

	/****************************************************************************/
	/*	PnF1D : 位相角補正値 [0.01deg]											*/
	/****************************************************************************/
	MencP->phscmpM2 = 0;							/* 未使用					*/

	/****************************************************************************/
	/*	PnF1E : フラグ [-]														*/
	/****************************************************************************/
	MencP->flg_wf = 0;								/* 未使用					*/

}


/*****************************************************************************
  Description : モータレステストモード用フルクパラメータ計算
	フルクエンコーダ未接続時仮想エンコーダパラメータをPnFxxに読み込む
----------------------------------------------------------------------------
  Parameters:
	MencP;					エンコーダパラメータ定義へのポインタ
  Return:
	none
----------------------------------------------------------------------------
  Note:
*****************************************************************************/
void ApiReadFencPrmMotorLessTestMode( MENCPRM *MencP )
{

	/*	PnF1A : フルクエンコーダビット数, 位置データ小数点位置 [－]			*/
	MencP->BitnoDpoint.b.l = 8;				/* ８bit固定					*/
	MencP->BitnoDpoint.b.h = 0x44;			/* ６８桁目固定					*/

	return;
}

#if 0	// 現状未使用
/*****************************************************************************
  Description : モータレステストモードステータス取得
----------------------------------------------------------------------------
  Parameters:
	none
  Return:
	TRUE;					モータレステストモード
	FALSE;					通常モード
----------------------------------------------------------------------------
  Note:
	暫定版
*****************************************************************************/
BOOL MltGetMotorLessTestMode( void )
{
	AXIS_HANDLE		*AxisRsc;			/* 軸情報	*/
	MOTLESSTST		*MotorLessTest;

	/* 軸ハンドルを取得する */
	/* TODO:複数軸対応が必要 */
	AxisRsc = GetAxisHandle(0);
	MotorLessTest = AxisRsc->MotorLessTest;

	/* モードステータスを返す */
	return( MotorLessTest->MotorLessTestMode );
}
#endif

/*****************************************************************************
  Description : モータレステストモードフラグ設定
----------------------------------------------------------------------------
  Parameters:
	AxisRscI;					軸ハンドル(全軸)
	AxisRscNum;					軸数
  Return:
	none
----------------------------------------------------------------------------
  Note:
*****************************************************************************/
void MltSetMotorLessTestMode( AXIS_HANDLE *AxisRscI, INT AxisRscNum )
{
	AXIS_HANDLE 	*AxisRsc;
	PRMDATA 		*Prm;
	MOTLESSTST		*MotorLessTest;

	INT	 			ax_no;
	BOOL			flag;

	/*----------------------------------------------------------------------*/
	/*	モータレステストモード設定											*/
	/*----------------------------------------------------------------------*/
	for( ax_no = 0; ax_no < AxisRscNum; ax_no++ )
	{
		AxisRsc = &AxisRscI[ax_no];
		Prm = AxisRsc->UniPrms->Prm;
		MotorLessTest = AxisRsc->MotorLessTest;

		/* モータレステストモード */
		flag = FALSE;
		if( Prm->b_prmC & 0x0001)
		{
			flag = TRUE;
		}
		MotorLessTest->MotorLessTestMode = flag;

		/* フルクローズドエンコーダタイプ */
		flag = FALSE;
		if( Prm->b_prmC & 0x0100)
		{
			flag = TRUE;
		}
		MotorLessTest->MotorLessTestDatas.FencType = flag;
	}

	return;
}


#if 0	// 現状未使用
/*****************************************************************************
  Description : モータレステストモードIF定義アドレス取得
----------------------------------------------------------------------------
  Parameters:
	none
  Return:
	モータレステストモードIF定義のアドレス
----------------------------------------------------------------------------
  Note:
	暫定版
*****************************************************************************/
MOTLESSTST *MltGetMotorLessTestHandle( void )
{
	AXIS_HANDLE		*AxisRsc;			/* 軸情報	*/

	/* 軸ハンドルを取得する */
	/* TODO:複数軸対応が必要 */
	AxisRsc = GetAxisHandle(0);

	/* モータレステスト構造体のアドレスを返す */
	return( AxisRsc->MotorLessTest );
}
#endif

/******************************* end of file  *******************************/
