/****************************************************************************************************/
/*																									*/
/*																									*/
/*		SvIdDef.h : Servo ID Definition Common Header File											*/
/*																									*/
/*																									*/
/****************************************************************************************************/
/*																									*/
/*																									*/
/*		1. サーボ機種ＩＦ定義																		*/
/*																									*/
/*		2. 																							*/
/*																									*/
/*		3. 																							*/
/*																									*/
/*		4. 																							*/
/*																									*/
/*		5. 																							*/
/*																									*/
/*		6. 																							*/
/*																									*/
/*																									*/
/*																									*/
/************** Copyright (C) Yaskawa Electric Corporation ******************************************/
/*																									*/
/*		Rev.1.00 : 2013.10.18  K.Ozaki																*/
/*																									*/
/*																									*/
/****************************************************************************************************/
#ifndef ___SERVOID___
#define ___SERVOID___


/****************************************************************************************************/
/*																									*/
/*		製品用ＩＤ定義(外部仕様：変更不可)															*/
/*																									*/
/****************************************************************************************************/
/*																									*/
/*	注 意 : サーボ機種ＩＤによる処理＆ＩＦは、可能な限り、作成しないこと。							*/
/*			サーボ機種が増える度に、処理＆ＩＦの追加が必要であり、いずれ破綻する！！！				*/
/*																									*/
/****************************************************************************************************/
/*--------------------------------------------------------------------------------------------------*/
/*		サーボ機種ＩＤ定義																			*/
/*--------------------------------------------------------------------------------------------------*/
#define SVID_SGDS				0x0014					/* SGDS：標準型								*/
#define SVID_SGDS_FC			0x0015					/* SGDS：ＦＣ型								*/
/*--------------------------------------------------------------------------------------------------*/
#define	SVID_SJDE				0x0021					/* SJDE：標準型								*/
/*--------------------------------------------------------------------------------------------------*/
#define SVID_SGDX				0x0024					/* SGDX：標準型								*/
#define SVID_SGDX_FC			0x0025					/* SGDX：ＦＣ型								*/
/*--------------------------------------------------------------------------------------------------*/
#define SVID_SGDV_R				0x0028					/* SGDV：標準型(ｱﾅﾛｸﾞ/ﾊﾟﾙｽ列形)				*/
#define SVID_SGDV_RM2			0x0029					/* SGDV：標準型(MECHATROLINK形)				*/
#define SVID_SGDV_ROP			0x002A					/* SGDV：標準型(指令ｵﾌﾟｼｮﾝ対応形)			*/
#define SVID_SGDV_L				0x002B					/* SGDV：リニア型(ｱﾅﾛｸﾞ/ﾊﾟﾙｽ列形)			*/
#define SVID_SGDV_LM2			0x002C					/* SGDV：リニア型(MECHATROLINK形)			*/
#define SVID_SGDV_LOP			0x002D					/* SGDV：リニア型(指令ｵﾌﾟｼｮﾝ対応形)			*/
#define SVID_SGDW_R				0x0030					/* SGDW：標準型(ｱﾅﾛｸﾞ/ﾊﾟﾙｽ列形)				*/
#define SVID_SGDW_RM2			0x0031					/* SGDW：標準型(MECHATROLINK形)				*/
#define SVID_SGDW_L				0x0032					/* SGDW：リニア型(ｱﾅﾛｸﾞ/ﾊﾟﾙｽ列形)			*/
#define SVID_SGDW_LM2			0x0033					/* SGDW：リニア型(MECHATROLINK形)			*/
/*--------------------------------------------------------------------------------------------------*/
#define	SVID_IDM				0x0040					/* IDM ：ネットワーク型						*/
#define	SVID_IDM35				SVID_IDM				/* IDM ：35mm								*/
#define	SVID_IDM50				SVID_IDM				/* IDM ：50mm								*/
#define	SVID_IDM60				SVID_IDM				/* IDM ：60mm								*/
/*--------------------------------------------------------------------------------------------------*/
#define	SVID_CACR_JUS_M3		0x0050					/* CACR-JU:単軸(MECHATROLINK3形)			*/
#define	SVID_CACR_JUM_M3		0x0051					/* CACR-JU:多軸(MECHATROLINK3形)			*/
#define	SVID_CACR_JUS_COE		0x0052					/* CACR-JU:単軸(COE形)						*/
#define	SVID_CACR_JUM_COE		0x0053					/* CACR-JU:多軸(COE形)						*/
#define	SVID_CACR_JUS_AN		0x005C					/* CACR-JU:単軸(Analog形)					*/
/*--------------------------------------------------------------------------------------------------*/
#define SVID_SGD7S_AN			0x0070					/* SGD7S：ｱﾅﾛｸﾞ/ﾊﾟﾙｽ列指令形				*/
#define SVID_SGD7S_M2			0x0071					/* SGD7S：MECHATROLINK-II通信指令形			*/
#define SVID_SGD7S_M3			0x0072					/* SGD7S：MECHATROLINK-III通信指令形		*/
#define SVID_SGD7S_OP			0x0073					/* SGD7S：指令ｵﾌﾟｼｮﾝ取り付け形				*/
#define SVID_SGD7S_COE			0x0074					/* SGD7S：EtherCAT通信指令形				*/
#define SVID_SGD7W_M3			0x0075					/* SGD7W：MECHATROLINK-III通信指令形		*/
/*--------------------------------------------------------------------------------------------------*/
#define	SVID_SGDA				0xFFFF					/* SGDA：標準型		@CHK@：仮処置			*/
/*--------------------------------------------------------------------------------------------------*/
/*		参考サーボ機種ＩＤ(サーボＯＳでは、現在不使用)												*/
/*--------------------------------------------------------------------------------------------------*/
#define	SVID_SGDM				0x0001					/* SGDM：標準型		(参考,Wcmd-IF)			*/
#define	SVID_SGDH				0x0002					/* SGDH：標準型		(参考,Wcmd-IF)			*/
#define	SVID_SGDH_LM			0x0004					/* SGDH：リニア型	(参考,Wcmd-IF)			*/
#define	SVID_IDM_M4				0x0016					/* IDM ：M4,IRIS	(参考,Smsg-IF)			*/
/*--------------------------------------------------------------------------------------------------*/
#define SVID_SGDV_MD_M3			0x005E					/* SGDV-MD：MECHATROLINK-III指令形(参考)	*/
/*--------------------------------------------------------------------------------------------------*/

/****************************************************************************************************/
/*																									*/
/*		サーボ機種ＩＤテーブル定義：ＬＣＤオペレータパラメータコピー用								*/
/*																									*/
/****************************************************************************************************/
/*																									*/
/*	注 意 : ＬＣＤオペレータを使用するサーボ機種ＩＤを追加した場合は、								*/
/*			本ＩＤテーブル定義にも、サーボ機種ＩＤと名称を追加すること。							*/
/*																									*/
/****************************************************************************************************/
/*--------------------------------------------------------------------------------------------------*/
/*		適用サーボモータ出力表示定義																*/
/*--------------------------------------------------------------------------------------------------*/
#define	WATT				0							/* [Ｗ]表示									*/
#define	AMPERE				1							/* [Arms]記号表示							*/
/*--------------------------------------------------------------------------------------------------*/
typedef struct
{
	USHORT	Id;											/* サーボ機種ＩＤ							*/
	UCHAR	Name[10];									/* サーボ機種名称(表示用,etc)				*/
	UCHAR	IfTyp[6];									/* インターフェイス名称						*/
	UCHAR	Disp;										/* 適用モータ出力表示						*/
} SVIDTBL;
/*--------------------------------------------------------------------------------------------------*/
#define	SVIDTBL_ENTRY_DEF								/* SVIDTBL Entry Definition					*/\
	{	SVID_SGDS,		"SGDS",		"\0",	WATT	},		/* SGDS Standard   Type					*/\
	{	SVID_SGDS_FC,	"SGDS_FC",	"\0",	WATT	},		/* SGDS FullClosed Type					*/\
	{	SVID_SGDX,		"SGDX",		"01A",	WATT	},		/* SGDX Standard   Type					*/\
	{	SVID_SGDX_FC,	"SGDX",		"02A",	WATT	},		/* SGDX FullClosed Type					*/\
	{	SVID_SJDE,		"SJDE",		"NA",	WATT	},		/* SJDE Standard   Type					*/\
	{	SVID_IDM,		"IDM",		"N"	,	WATT	},		/* IDM  Network    Type					*/\
	{	SVID_SGDV_R,	"SGDV",		"01A",	AMPERE	},		/* SGDV Standard   Type					*/\
	{	SVID_SGDV_L,	"SGDV",		"05A",	AMPERE	},		/* SGDV Linear     Type					*/\
	{	SVID_SGDV_RM2,	"SGDV",		"11A",	AMPERE	},		/* SGDV M-Ⅱ Standard Type				*/\
	{	SVID_SGDV_LM2,	"SGDV",		"15A",	AMPERE	},		/* SGDV M-Ⅱ Linear   Type				*/\
	{	SVID_SGDW_R,	"SGDW",		"01A",	AMPERE	},		/* SGDW Standard      Type				*/\
	{	SVID_SGDW_L,	"SGDW",		"05A",	AMPERE	},		/* SGDW Linear        Type				*/\
	{	SVID_SGDW_RM2,	"SGDW",		"11A",	AMPERE	},		/* SGDW M-Ⅱ Standard Type				*/\
	{	SVID_SGDW_LM2,	"SGDW",		"15A",	AMPERE	},		/* SGDW M-Ⅱ Linear   Type				*/\
	{	SVID_SGD7S_AN,	"SGD7S",	"00",	AMPERE	},		/* SGD7S Analog/Pulse Type				*/\
	{	SVID_SGD7S_M2,	"SGD7S",	"10",	AMPERE	},		/* SGD7S M-II Type						*/\
	{	SVID_SGD7S_M3,	"SGD7S",	"20",	AMPERE	},		/* SGD7S M-III Type						*/\
	{	SVID_SGD7S_OP,	"SGD7S",	"E0",	AMPERE	},		/* SGD7S Command Option Type			*/\
	{	SVID_SGD7S_COE,	"SGD7S",	"A0",	AMPERE	},		/* SGD7S EtherCAT Type					*/\
	{	SVID_SGD7W_M3,	"SGD7W",	"20",	AMPERE	},		/* SGD7W M-III Type						*/\
	{	SVID_SGDV_MD_M3,"SGDV_MD",	"\0",	AMPERE	},		/* SGDV-MD M-III Type (後で消す)		*/\


/*--------------------------------------------------------------------------------------------------*/

#endif
/***************************************** end of file **********************************************/
