#ifndef __ADV_AUTO_TUNING_H
#define __ADV_AUTO_TUNING_H
/****************************************************************************
Description	: Advanced Auto Tuning
----------------------------------------------------------------------------
Author        : Yaskawa Electric Corp.,
				Copyright (c) 2010 All Rights Reserved

Project       : INGRAM

----------------------------------------------------------------------------
Changes		:
Name   Date          Description
----------------------------------------------------------------------------
*****************************************************************************/
#include "Basedef.h"
#include "SystemSetting.h"
#include "FnPrgJog.h"
#include "PowerManager.h"
#include "CheckMotSts.h"
#include "CheckAlarm.h"
#include "RemVibFreq.h"
#include "AlarmManager.h"

/****************************************************************************************************/
/*																									*/
/*		Constant Definition																			*/
/*																									*/
/****************************************************************************************************/
/*--------------------------------------------------------------------------------------------------*/
/*	アドバンスドオートチューニングゲイン変更設定定数定義											*/
/*--------------------------------------------------------------------------------------------------*/
#define		GAIN_DW					0		/* ゲインダウン											*/
#define		GAIN_UP					1		/* ゲインアップ											*/
#define		GAIN_BAL				2		/* ゲインバランス１										*/
#define		GAIN_BAL2				3		/* ゲインバランス２										*/
#define		GAIN_CAL				4		/* ゲイン計算											*/
#define		GAIN_BAL3				5		/* ゲインバランス３										*/
#define		GAIN_BAL4				6		/* ゲインバランス４										*/
/*--------------------------------------------------------------------------------------------------*/
/*	アドバンスドオートチューニングパラメータ定数定義												*/
/*--------------------------------------------------------------------------------------------------*/
#define		RESGMAX					200		/* 指令応答発振検出閾値 [%]								*/
#define		STPVIBDET				300		/* 停止時振動検出閾値 [%]								*/
#define		STPVIBLMT				5		/* 停止時振動検出リミット[%]							*/
#define		STPTRQFIL				1000	/* 停止時トルクハイパスフィルタ周波数 [0.1Hz]			*/
/*--------------------------------------------------------------------------------------------------*/
/*	アドバンスドオートチューニングエラーステータス定数定義											*/
/*--------------------------------------------------------------------------------------------------*/
#define		ADAT_STS_INIT			0x00	/* イニシャル/中断										*/
#define		ADAT_STS_DONE			0x01	/* チューニング完了										*/
#define		ADAT_STS_ERR			0x11	/* チューニング失敗										*/
#define		ADAT_STS_NG				0x21	/* 動作不良												*/
#define		ADAT_STS_ABORT			0x22	/* 異常による中断										*/
#define		ADAT_STS_JERR			0x31	/* イナーシャ同定不良									*/
#define		ADAT_STS_DRVWAIT		0x41	/* 初期設定完了 入力待ち								*/
#define		ADAT_STS_JRUN			0x50	/* イナーシャ同定実行中									*/
#define		ADAT_STS_JEND			0x51	/* イナーシャ同定完了									*/
#define		ADAT_STS_VIBDET			0x60	/* 振動レベル測定実行中									*/
#define		ADAT_STS_MAXGNADJ		0x70	/* 限界ゲイン探索実行中									*/
#define		ADAT_STS_OPTGNADJ		0x80	/* 動作評価ゲイン探索実行中								*/
//#define		ADAT_STS_NOTCHSET		0x90	/* ノッチフィルタ自動設定実行中						*/
#define		ADAT_STS_VIBDISSET		0x90	/* 振動抑制設定実行中									*/
/*--------------------------------------------------------------------------------------------------*/
#define		ADAT_STS_COINNOWAIT		0x0000	/* COIN待ちなしステータス								*/
#define		ADAT_STS_COINERR		0x0100	/* COIN待ちエラーステータス								*/
#define		ADAT_STS_COINWAIT		0x0200	/* COIN待ち中ステータス									*/
#define		ADAT_STS_COINWARN		0x0300	/* COIN待ち中解除ステータス								*/
/*--------------------------------------------------------------------------------------------------*/
#define		ADAT_END				99		/* 強制終了												*/
#define		ADAT_OK					0		/* 正常終了												*/
#define		ADAT_CONTINUE			1		/* 実行中												*/
#define		ADAT_BUSY				2		/* 処理継続中											*/
#define		ADAT_NG					-1		/* 異常終了												*/
#define		ADAT_NOTRDYERR			-2		/* 運転準備未完エラー									*/
#define		ADAT_MOSESETERR			-3		/* モード設定エラー										*/
#define		ADAT_JST_ERR			-4		/* イナーシャ同定開始エラー								*/
#define		ADAT_J_ERR				-5		/* イナーシャ同定エラー									*/
#define		ADAT_PROGERR			-6		/* 運転指令エラー										*/
#define		ADAT_QFILERR			-7		/* 周波数解析エラー										*/
#define		ADAT_NTCHNG				-8		/* ノッチ設定エラー										*/
#define		ADAT_COINERR			-9		/* COIN未出力エラー										*/
#define		ADAT_COMERR				-50		/* 動作中の通信エラー									*/
/*--------------------------------------------------------------------------------------------------*/
/*	アドバンスドオートチューニング処理要求定義														*/
/*--------------------------------------------------------------------------------------------------*/
#define		ADAT_SEQ_INIT			0		/* 初期設定状態											*/
#define		ADAT_SEQ_MODESET		1		/* チューニングモード設定状態							*/
#define		ADAT_SEQ_JRATSET		2		/* イナーシャ設定状態									*/
#define		ADAT_SEQ_NORMVIB		3		/* 通常振動レベル探索状態								*/
#define		ADAT_SEQ_SEARCHOPTKV	4		/* 最適Kv、Tiゲイン探索状態								*/
#define		ADAT_SEQ_NOTCHSET		5		/* ノッチフィルタ設定状態								*/
#define		ADAT_SEQ_SEARCHOPTKP	6		/* 最適Kpゲイン探索状態									*/
#define		ADAT_SEQ_ADJMFC			7		/* モデル追従制御調整状態								*/
#define		ADAT_SEQ_ENDDISP		10		/* 終了表示状態											*/
#define		ADAT_SEQ_END			8		/* 最終設定状態											*/
#define		ADAT_SEQ_WAIT			9		/* 終了待ち状態											*/
#define		ADAT_SEQ_RETURN			11		/* モード終了状態										*/
#define		ADAT_SEQ_NOOPWAIT		12		/* No Operation 表示ウェイト							*/
#define		ADAT_SEQ_START			13		/* 初期化処理状態										*/
#define		ADAT_SEQ_2MASSSET		14		/* MFC(剛体+機台振動)設定状態							*/
#define		ADAT_SEQ_KPSET			15		/* Kp設定状態											*/
/*--------------------------------------------------------------------------------------------------*/
#define		ADAT_NO_OPE				100		/* no operation 										*/
#define		ADAT_CHKKV				101		/* 指令応答による安全確認								*/
#define		ADAT_VIBCOIN			102		/* モデル追従制御COIN割れ確認							*/
/*--------------------------------------------------------------------------------------------------*/
/*	アドバンスドオートチューニング最適ゲイン探索シーケンス定義										*/
/*--------------------------------------------------------------------------------------------------*/
#define		ADAT_OPTGN_INI			0		/* 最適ゲイン探索初期設定状態							*/
#define		ADAT_OPTGN_REQ			1		/* 最適ゲイン探索要求状態								*/
#define		ADAT_OPTGN_SEARCH		2		/* 最適ゲイン探索状態									*/
#define		ADAT_OPTGN_WAIT			3		/* 振動収束待ち状態										*/
#define		ADAT_OPTGN_CHKKV_REQ	4		/* 指令応答安全確認要求状態								*/
#define		ADAT_OPTGN_CHKKV		5		/* 最適ゲイン探索状態2									*/
#define		ADAT_OPTGN_INIWAIT		6		/* 最適ゲイン探索初期振動収束待ち						*/
/*--------------------------------------------------------------------------------------------------*/
/*	アドバンスドオートチューニング最適Ｋｐゲイン探索シーケンス定義									*/
/*--------------------------------------------------------------------------------------------------*/
#define		ADAT_OPTKP_INI			0		/* 最適kp探索初期設定状態								*/
#define		ADAT_OPTKP_CHK_REQ		1		/* COIN割れ確認要求状態									*/
#define		ADAT_OPTKP_CHK			2		/* COIN割れ確認状態										*/
#define		ADAT_OPTKP_WAIT			3		/* 振動収束待ち状態										*/
/*--------------------------------------------------------------------------------------------------*/
/*	アドバンスドオートチューニングモデル追従調整シーケンス定義										*/
/*--------------------------------------------------------------------------------------------------*/
#define		ADAT_MFC_INI			0		/* モデル追従調整初期設定状態							*/
#define		ADAT_MFC_MAXREQ			1		/* Kpm調整要求状態										*/
#define		ADAT_MFC_MAXSEARCH		2		/* Kpm調整状態											*/
#define		ADAT_MFC_WAIT			3		/* 振動収束待ち状態										*/
#define		ADAT_MFC_CHK_REQ		4		/* COIN割れ確認要求状態									*/
#define		ADAT_MFC_CHK			5		/* COIN割れ確認状態										*/
#define		ADAT_MFC_INIWAIT		6		/* モデル追従調整初期振動収束待ち						*/
/*--------------------------------------------------------------------------------------------------*/
/*	アドバンスドオートチューニング スキャンＣステータス定義											*/
/*--------------------------------------------------------------------------------------------------*/
#define		ADAT_SEAR_NORMALEND		5		/* 探索処理正常終了										*/
#define		ADAT_SEAR_VIBEND		1		/* 振動検出終了											*/
#define		ADAT_SEAR_STOPVIBEND	2		/* 停止時振動検出終了									*/
#define		ADAT_SEAR_COINBREAKEND	3		/* COIN割れ検出終了										*/
#define		ADAT_SEAR_CONTINUE		4		/* 探索処理中											*/
#define		ADAT_SEAR_ERR			-1		/* 探索処理異常											*/
#define		ADAT_SEAR_NOVIBDETECT	6		/* 振動未検出終了										*/
#define		ADAT_SEAR_COINOK		7		/*														*/
/*--------------------------------------------------------------------------------------------------*/
/*	アドバンスドオートチューニング プログラムＪＯＧステータス定義									*/
/*--------------------------------------------------------------------------------------------------*/
#define		ADAT_PJOG_NOP			0		/* 運転停止中											*/
#define		ADAT_PJOG_EXEC			1		/* 運転中												*/
#define		ADAT_PJOG_FIN			2		/* 運転完了												*/
#define		ADAT_PJOG_PLUSEND		3		/* 正転方向指令完了										*/
#define		ADAT_PJOG_MINUSEND		4		/* 逆転方向指令完了										*/
#define		ADAT_PJOG_WAIT			5		/* 運転開始待機											*/
/*--------------------------------------------------------------------------------------------------*/
/*	振動検出制限値																					*/
/*--------------------------------------------------------------------------------------------------*/
#define		VIBMFC_DET_FRQ_MIN		10		/* Fn023内の残留振動検出周波数下限 1.0Hz				*/
#define		VIBMFC_DET_FRQ_MAX		1000	/* Fn023内の残留振動検出周波数上限 100.0Hz				*/
/*--------------------------------------------------------------------------------------------------*/
/*	MFC(剛体+機台)パラメータ設定																	*/
/*--------------------------------------------------------------------------------------------------*/
#define		VIBMFC_PRM_ACTIVE		0x0011	/* 剛体系＋機台モデル設定(Pn140)						*/
#define		RIGMFC_PRM_ACTIVE		0xff0f	/* 剛体系モデル設定(Pn140)								*/
/*--------------------------------------------------------------------------------------------------*/
/*	アドバンスドオートチューニング プログラムＪＯＧ運転パターン定義									*/
/*																									*/
/*		パターン設定例	０ｘ００Ｆ□□Ｆ□□														*/
/*							  ｜｜｜｜｜｜｜														*/
/*							  ｜｜｜｜｜｜１回目の運転選択											*/
/*							  ｜｜｜｜｜２回目の運転選択											*/
/*							  ｜｜｜｜１回目、２回目を繰り返し										*/
/*							  ｜｜｜３回目の運転選択												*/
/*							  ｜｜４回目の運転選択													*/
/*							  ｜３回目、４回目を繰り返し											*/
/*							  運転停止																*/
/*		運転選択	0：停止																			*/
/*					1：早送り正転																	*/
/*					2：早送り逆転																	*/
/*					3：通常送り正転																	*/
/*					4：通常送り逆転																	*/
/*					6：ｲﾅｰｼｬ同定中早送り正転														*/
/*					7：ｲﾅｰｼｬ同定中早送り逆転														*/
/*					F：繰り返し（繰り返し回数は、ﾚﾍﾞﾙに従う）										*/
/*																									*/
/*	注）運転終了時は、開始時と同じ位置になるようにﾊﾟﾀｰﾝを作成すること								*/
/*																									*/
/*--------------------------------------------------------------------------------------------------*/
#define		ADAT_PJOG_STOP			0x00000000	/* 運転パターン０ 運転停止							*/
#define		ADAT_PJOG_PATTERN1		0x00002121	/* 運転パターン１ 早送り、正負方向(２往復)			*/
#define		ADAT_PJOG_PATTERN2		0x0000F4F3	/* 運転パターン２ 通常送り、正負方向				*/
#define		ADAT_PJOG_PATTERN3		0x0021F4F3	/* 運転パターン３ 通常送り → 早送り				*/
#define		ADAT_PJOG_PATTERN5		0x00000006	/* 運転パターン５ 同定中早送り、正負方向			*/
/*--------------------------------------------------------------------------------------------------*/
#define		VIBOBS_KS				800		/* 振動検出オブザーバKs切り替えKvゲイン [0.1Hz]			*/
#define		DETVIBLP				3183	/* ワンパラ振動検出用ローパスフィルタ(3183us = 50Hz)	*/
#define		DETVIBHP2				3183	/* AAT振動検出用ハイパスフィルタ(3183us = 50Hz)			*/
#define		DETVIBHP3				1591	/* AAT振動検出用ハイパスフィルタ(1591us = 100Hz)		*/
#define		DETVIBHP				320		/* 発振検出用ハイパスフィルタ：0.32[ms]=500[Hz]			*/
/*--------------------------------------------------------------------------------------------------*/
#define		TUNEACCTRQ2				1000	/* チューニング加速トルク(新仕様)	[0.1%]				*/
#define		JRATACCTRQ				100		/* イナーシャ同定時加速トルク(開始)	[0.1%]				*/
#define		JRATACCTRQ2				500		/* イナーシャ同定時加速トルク(同定中)[0.1%]				*/
#define		AATCONSVELTM			150		/* 基準一定速時間	[ms]								*/
#define		JRATE_VFFGN				100		/* イナーシャ同定中速度ＦＦゲイン[%]					*/
#define		JRATPJOGACC				15		/* イナーシャ同定時加速度下限値	[ms]					*/
/*--------------------------------------------------------------------------------------------------*/
#define		AATPJOGWAITTM			300		/* プログラムJOG運転待ち時間		[ms]				*/
/*--------------------------------------------------------------------------------------------------*/
#define		ADATVIBWAITTM1			500		/* チューニング中振動収束待ち時間	500ms				*/
#define		ADATVIBWAITTM2			300		/* チューニング中振動収束待ち時間	300ms				*/
#define		ADATVIBWAITTM3			100		/* チューニング中振動収束待ち時間	100ms				*/
#define		ADATSTOPWAITTM			3000	/* チューニング中モータ停止待ち時間	3000ms				*/
/*--------------------------------------------------------------------------------------------------*/
#define		ADATCOINWAIT1			8000	/* COINエラー検出待ち時間								*/
#define		ADATCOINWAIT2			3000	/* COIN警告検出待ち時間									*/
#define		ADATDRVWAIT				300		/* モータ運転待ち時間									*/
/*--------------------------------------------------------------------------------------------------*/
#define		COINOFFLMT				1000	/* 位置決め失敗許容時間を1msとする[1us]					*/
#define		STPDETTM				100		/* 停止判別時間	100ms			[2ms]					*/
#define		ADAT_LFVIBDET_LVL		300		/* 残留振動検出レベル(COIN幅比)	300%	[%]				*/
/*--------------------------------------------------------------------------------------------------*/
#define		GNUPTM2					400		/* ゲイン探索間隔(新仕様)	400ms	[2ms]				*/
/*--------------------------------------------------------------------------------------------------*/
#define		KVUP_UNIT				20		/* Kv UP幅					[0.1Hz]						*/
#define		KV_UNLMT				100		/* Kv 下限値				[0.1Hz]						*/
#define		KPUP_UNIT				30		/* Kp UP幅					[0.1s-1]					*/
#define		KPDOWN_UNIT				30		/* Kp DOWN幅				[0.1s-1]					*/
#define		KP_UNLMT				100		/* Kp 下限値				[0.1s-1]					*/
#define		KPM_UNLMT				10		/* Kpm 下限値				[0.1s-1]					*/
/*--------------------------------------------------------------------------------------------------*/
#define		ADAT_DTUN_MAX			5		/* 移動距離調整桁										*/
#define		ADAT_DIST_MAX			99990000	/* 移動距離最大値									*/
/*--------------------------------------------------------------------------------------------------*/
#define		MINIMUM_LINEAR_MM		5		/* リニアモータ最小移動距離[mm]							*/
#define		DEFAULT_STROKE_ROTARY	30		/* 回転型モータ初期移動距離[0.1rev]						*/
#define		DEFAULT_STROKE_LINEAR	900		/* リニアモータ初期移動距離[0.1mm]						*/
/*--------------------------------------------------------------------------------------------------*/
#define		ADAT_DRV_PLUS			0		/* 運転方向：正											*/
#define		ADAT_DRV_MINUS			1		/* 運転方向：逆											*/
/*--------------------------------------------------------------------------------------------------*/
#define		ADAT_JDRV_MAXCNT		9		/* 慣性モーメント同定運転最大回数						*/
#define		ADAT_JRAT_CHGCNT		5		/* 慣性モーメント同定初期同定値補正回数					*/
#define		ADAT_JRAT_CHG_RATE		200		/* 慣性モーメント同定初期同定値補正１回当りの補正値		*/
/*--------------------------------------------------------------------------------------------------*/
#define		ADAT_ERR_ULMT( data )	(((data)*33)>>5)	/* +3.125%									*/
#define		ADAT_ERR_LLMT( data )	(((data)*31)>>5)	/* -3.125%									*/
#define		ADAT_ERR2_ULMT( data )	(((data)*21)>>4)	/* +31.25%									*/
#define		ADAT_ERR2_LLMT( data )	(((data)*11)>>4)	/* -31.25%									*/
/*--------------------------------------------------------------------------------------------------*/
#define		ADAT_GRAT_80( data )	(((data)*205)>>8)	/* 80%										*/
#define		ADAT_GRAT_70( data )	(((data)*180)>>8)	/* 70%										*/
#define		ADAT_GRAT_50( data )	((data)>>1)			/* 50%										*/
#define		ADAT_GRAT_62( data )	(((data)*5)>>3)		/* 62.5%									*/
#define		ADAT_GRAT_150( data )	(((data)*3)>>1)		/* 150%										*/
#define		ADAT_GRAT_94( data )	(((data)*15)>>4)	/* 93.75%									*/
#define		ADAT_GRAT_106( data )	(((data)*17)>>4)	/* 106.25%									*/
#define		ADAT_GRAT_113( data )	(((data)*9)>>3)		/* 112.5%									*/
/*--------------------------------------------------------------------------------------------------*/
#define		ADAT_STS_NF_SETOK		0		/* ノッチフィルタ設定完了								*/
#define		ADAT_STS_NF_SETERR		-1		/* ノッチフィルタ設定異常								*/
#define		ADAT_STS_NF_ANAERR		-2		/* 周波数解析異常										*/
/*--------------------------------------------------------------------------------------------------*/
#define		ADAT_LVL_50				0x0A000200	/* ゲイン補正： 50%									*/
#define		ADAT_LVL_70				0x0A0002CD	/* ゲイン補正： 70%									*/
#define		ADAT_LVL_80				0x0A000333	/* ゲイン補正： 80%									*/
#define		ADAT_LVL_100			0x0A000400	/* ゲイン補正：100%									*/
/*--------------------------------------------------------------------------------------------------*/
#define		ADATMFC_ONE_MASS		0x01	/* 剛体系モデル											*/
#define		ADATMFC_TWO_MASS1		0x02	/* ２慣性系系モデル１									*/
#define		ADATMFC_TWO_MASS2		0x03	/* ２慣性系系モデル２									*/
#define		ADATMFC_ONE_BASE		0x04	/* 剛体系＋機台モデル									*/
/*--------------------------------------------------------------------------------------------------*/
#define		ADAT_MODE_MIN			0		/* モード下限											*/
#define		ADAT_MODE_MAX			1		/* モード上限											*/
/*--------------------------------------------------------------------------------------------------*/
#define		ADAT_LEVEL_MIN			1		/* レベル下限											*/
#define		ADAT_LEVEL_MAX			3		/* レベル上限											*/
#define		ADAT_LEVEL_NOR			1		/* 調整レベル＝標準										*/
#define		ADAT_LEVEL_POS			2		/* 調整レベル＝位置決め専用								*/
#define		ADAT_LEVEL_POS_ST		3		/* 調整レベル＝位置決め専用(オーバーシュート重視)		*/
/*--------------------------------------------------------------------------------------------------*/
#define		ADAT_SCROLL_MIN			0		/* 内部指令AAT設定画面スクロール下限					*/
#define		ADAT_SCROLL_MAX			3		/* 内部指令AAT設定画面スクロール上限					*/
/*--------------------------------------------------------------------------------------------------*/
#define		ADAT_REFIN_SCROLL_MIN	1		/* 指令入力型AAT設定画面スクロール下限					*/
#define		ADAT_REFIN_SCROLL_MAX	2		/* 指令入力型AAT設定画面スクロール上限					*/
/*--------------------------------------------------------------------------------------------------*/
#define		ADAT_JRAT_OK			0		/* 慣性モーメント同定：正常動作中						*/
#define		ADAT_JRAT_ERR1			1		/* 慣性モーメント同定：推定開始失敗						*/
#define		ADAT_JRAT_ERR2			2		/* 慣性モーメント同定：推定不良							*/
#define		ADAT_JRAT_ERR3			3		/* 慣性モーメント同定：低周波数振動検出					*/
#define		ADAT_JRAT_ERR4			4		/* 慣性モーメント同定：トルク制限エラー					*/
#define		ADAT_JRAT_ERR5			5		/* 慣性モーメント同定：Ｐ制御、偏差クリア				*/
/*--------------------------------------------------------------------------------------------------*/

/****************************************************************************************************/
/*																									*/
/*		Struct Definition																			*/
/*																									*/
/****************************************************************************************************/
/*--------------------------------------------------------------------------------------------------*/
/*		アドバンスドオートチューニング操作レジスタ構造体											*/
/*--------------------------------------------------------------------------------------------------*/
typedef struct ADATREG{			/* 操作レジスタ														*/
	USHORT	AdatMode;						/* 0x2090 : アドバンストATモード						*/
	USHORT	AdatLevel;						/* 0x2091 : アドバンストATレベル						*/
	DWORDX	AdatMovep;						/* 0x2092 : アドバンストAT移動距離						*/
	USHORT	AdatState;						/* 0x2094 : アドバンストAT完了確認						*/
	USHORT	AdatFilType;					/* 0x2095 : アドバンストATフィルタタイプ				*/
}ADATREG;

/*--------------------------------------------------------------------------------------------------*/
/*		アドバンスドオートチューニングデータ構造体													*/
/*--------------------------------------------------------------------------------------------------*/
typedef	struct ADATV {
/*--------------------------------------------------------------------------------------------------*/
	struct {					/* ビット信号														*/
		UINT	RefInType		:1;			/* 指令入力型											*/
		UINT	UsedAllNtFil	:1;			/* 全ノッチフィルタ使用									*/
		UINT	UsedAResCtrl	:1;			/* Ａ型制振使用											*/
		UINT	JratCalRun		:1;			/* 慣性モーメント同定中									*/
		UINT	GainTuneRun		:1;			/* ゲイン調整中											*/
		UINT	FftReq			:1;			/* 周波数解析要求										*/
		UINT	VibDetect		:1;			/* 振動検出												*/
		UINT	CoinBreak		:1;			/* COIN割れ												*/
		UINT	VibDetectatStop	:1;			/* 停止時振動検出										*/
		UINT	VibDetectinCycle:1;			/* 今回運転での振動検出									*/
		UINT	CoinLatch		:1;			/* COINラッチフラグ										*/
		UINT	LastCoinLatch	:1;			/* 前回COINラッチフラグ									*/
		UINT	CoinIgnore		:1;			/* COIN無視												*/
		UINT	OrgIPSpdControl	:1;			/* I-P制御での動作										*/
		UINT	DrvPatternSet	:1;			/* 運転パターン設定										*/
		UINT	DrvErrDetect	:1;			/* 運転エラー検出										*/
		UINT	CoinWaitStart	:1;			/* COIN待ち処理開始フラグ								*/
		UINT	Used2MassMfc	:1;			/* MFC(剛体+機台モデル)設定済みフラグ					*/
		UINT	Mfc2MassOK		:1;			/* MFC(剛体+機台モデル)最終設定済みﾌﾗｸﾞ					*/
		UINT	Used2MassOld	:1;			/* AAT前にMFC設定済みフラグ								*/
		UINT	MfcLastSet		:1;			/* MFC最終調整済み済みフラグ							*/
		UINT	OvsErr			:1;			/* オーバーシュートエラーフラグ							*/
		UINT	StopDetectMode2	:1;			/* 指令入力AAT停止判定モード２フラグ					*/
											/* FALSE：COINで停止判定　TURE：指令=0で停止判定		*/
		UINT	KvTuneWait 		:1;			/* Kvゲインチューニング停止フラグ						*/
	} f;
/*--------------------------------------------------------------------------------------------------*/
//	USHORT	TunStartMFCModel;				/* AAT調整開始時のMFCメカモデル							*/
/*--------------------------------------------------------------------------------------------------*/
	SHORT	ErrState;						/* エラーステータス										*/
/*--------------------------------------------------------------------------------------------------*/
	USHORT	ModeSetPtr;						/* モード設定：シーケンスポインタ						*/
	UCHAR	ModeMin;						/* モード設定：モード選択下限							*/
	UCHAR	ModeMax;						/* モード設定：モード選択上限							*/
	UCHAR	ModeSetMin;						/* モード設定：モード設定下限							*/
	UCHAR	ModeSetMax;						/* モード設定：モード設定上限							*/
	USHORT	TunModeMax;						/* モード設定：調整モード最大値							*/
/*--------------------------------------------------------------------------------------------------*/
	USHORT	JratSetPtr;						/* 慣性モーメント同定：シーケンスポインタ				*/
/*--------------------------------------------------------------------------------------------------*/
	USHORT	VibDetPtr;						/* 振動検出：シーケンスポインタ							*/
	SHORT	VibDetStat;						/* 振動検出：ステータス									*/
/*--------------------------------------------------------------------------------------------------*/
	USHORT	KvTunePtr;						/* Kv調整：シーケンスポインタ							*/
	USHORT	MaxKv;							/* Kv調整：最大Kv値										*/
/*--------------------------------------------------------------------------------------------------*/
	USHORT	NextSeqPtr;						/* 次のシーケンスポインタ								*/
	USHORT	NextSubSeqPtr;					/* 次のサブシーケンスポインタ							*/
	USHORT	Set2MassMfcSequence;			/* ２慣性MFCを設定したシーケンスポインタ				*/
/*--------------------------------------------------------------------------------------------------*/
	USHORT	KpSetPtr;						/* Kp設定：シーケンスポインタ							*/
	USHORT	MaxKp;							/* Kp設定：最大Kp値										*/
/*--------------------------------------------------------------------------------------------------*/
	USHORT	KpTunePtr;						/* Kp調整：シーケンスポインタ							*/
/*--------------------------------------------------------------------------------------------------*/
	USHORT	MaxKpm;							/* Kpm設定：最大Kpm値									*/
	USHORT	MfcTunePtr;						/* モデル追従制御調整：シーケンスポインタ				*/
/*--------------------------------------------------------------------------------------------------*/
	USHORT	NotchSetPtr;					/* ノッチフィルタ設定：シーケンスポインタ				*/
	SHORT	NotchSetStat;					/* ノッチフィルタ設定：ノッチ設定ステータス				*/
	USHORT	VibMaxKv;						/* ノッチフィルタ設定：ノッチ未設定時の限界ゲイン		*/
	USHORT	VibMaxKvAresOFF;				/* Ａ型制振設定：Ａ型制振未設定時の限界ゲイン			*/
	USHORT	MaxKvbk;						/* ノッチフィルタ設定：振動Kv値							*/
	SHORT	FftStat;						/* ノッチフィルタ設定：周波数解析ステータス				*/
	UCHAR	ANotchSetStat;					/* ノッチフィルタ設定：自動ノッチ設定ステータス			*/
	UCHAR	ANotchSetStatBk;				/* ノッチフィルタ設定：自動ノッチ設定保存ステータス		*/
	UCHAR	AResSetStat;					/* ノッチフィルタ設定：自動Ａ型設定ステータス			*/
	UCHAR	AResSetStatBk;					/* ノッチフィルタ設定：自動Ａ型設定保存ステータス		*/
/*--------------------------------------------------------------------------------------------------*/
	USHORT	ScanCRequest;					/* スキャンCへの要求データ								*/
	SHORT	ScanCStat;						/* スキャンCからの応答ステータス						*/
/*--------------------------------------------------------------------------------------------------*/
	ULONG	PrgJogPatternReq;				/* 運転指令：要求パターン								*/
	ULONG	PrgJogPattern;					/* 運転指令：受領パターン								*/
	ULONG	PrgJogActPattern;				/* 運転指令：現在のパターン								*/
	USHORT	PrgJogPatternCnt;				/* 運転指令：パターンインデックス						*/
	SHORT	PrgJogStat;						/* 運転指令：運転ステータス								*/
	USHORT	PrgJogPtr;						/* 運転指令：シーケンスポインタ							*/
	USHORT	PrgJogTimes;					/* 運転指令：運転繰り返し回数							*/
	USHORT	PrgJogDrvCnt;					/* 運転指令：運転回数									*/
	ULONG	PrgJogDrvCntr;					/* 運転指令：運転持続時間検出用カウンタ					*/
	ULONG	PrgJogWaitCntr;					/* 運転指令：運転停止時間生成用カウンタ					*/
	ULONG	PrgJogMovStartCntr;				/* 運転指令：移動開始待ちカウンタ						*/
/*--------------------------------------------------------------------------------------------------*/
	LONG	TrqRefatStop;					/* 停止時通常トルク指令値								*/
	LONG	MaxTrqRefatStop;				/* 停止時通常トルク最大値								*/
	LONG	MinTrqRefatStop;				/* 停止時通常トルク最小値								*/
	LONG	VibSpeed;						/* 通常運転振幅レベル									*/
/*--------------------------------------------------------------------------------------------------*/
	ULONG	CoinWaitStat;					/* COIN検出：ステータス									*/
	ULONG	CoinWaitCntr;					/* COIN検出：COIN割れ時間検出用カウンタ					*/
	ULONG	CoinOnCntr;						/* COIN検出：COINオン時間検出用カウンタ					*/
/*--------------------------------------------------------------------------------------------------*/
	ULONG	GainUpCntr;						/* ゲイン調整：ゲインアップ後の振動有無検出用カウンタ	*/
	ULONG	KpGainUpCntr;					/* ゲイン調整：ゲインアップ後の振動有無検出用カウンタ	*/
/*--------------------------------------------------------------------------------------------------*/
	LONG	KTrqHpFil;						/* トルクハイパスフィルタ時定数換算値					*/
	LONG	KTrqHpftmp;						/* トルクハイパスフィルタバッファ						*/
/*--------------------------------------------------------------------------------------------------*/
	LONG	MinDistance;					/* 最小移動距離											*/
	LONG	DefaultDistance;				/* 初期移動距離											*/
	LONG	MoveDistance;					/* 移動距離		[指令単位]								*/
/*--------------------------------------------------------------------------------------------------*/
	USHORT	PositioningTimes;				/* 位置決め回数											*/
/*--------------------------------------------------------------------------------------------------*/
	USHORT	JratDrvCnt;						/* 慣性モーメント同定：運転回数							*/
	SHORT	LastEstimatJrat;				/* 慣性モーメント同定：推定比				[%]			*/
	USHORT	Jrate;							/* 慣性モーメント同定：ゲイン調整使用推定比	[%]			*/
	USHORT	JratChangeTimes;				/* 慣性モーメント同定：初期同定値補正回数				*/
	ULONG	JratVibWaitCntr;				/* 慣性モーメント同定：初期振動収束時間検出用カウンタ	*/
	ULONG	JratVibWaitCntr2;				/* 慣性モーメント同定：振動収束時間検出用カウンタ		*/
	USHORT	JratErr;						/* 慣性モーメント同定：エラー状態						*/
/*--------------------------------------------------------------------------------------------------*/
	ULONG	KvTuneCntr;						/* Kv調整：シーケンス内時間計測カウンタ					*/
	ULONG	KvTuneWaitCntr;					/* Kv調整：シーケンス内時間計測カウンタ					*/
	ULONG	NotchSetCntr;					/* ノッチフィルタ設定：シーケンス内時間計測カウンタ		*/
	ULONG	KpTuneCntr;						/* Kp調整：シーケンス内時間計測カウンタ					*/
	ULONG	MfcTuneCntr;					/* モデル追従制御調整：シーケンス内時間計測カウンタ		*/
	ULONG	KpSetCntr;						/* Kp設定：シーケンス内時間計測カウンタ					*/
/*--------------------------------------------------------------------------------------------------*/
	USHORT	frq_buf;						/* 共振・反共振周波数バッファ							*/
	USHORT	Kpm_buf;						/* Kpmバッファ											*/
	USHORT	Kv_buf;							/* Kvバッファ											*/
/*--------------------------------------------------------------------------------------------------*/
	LONG	settling_max;					/* 整定時間の最大値										*/
	LONG	settling_buf;					/* 整定時間の最大値バッファ								*/
/*--------------------------------------------------------------------------------------------------*/
	BOOL	ScanCReqFlg;
	USHORT	ScanCReqCmd;
/*--------------------------------------------------------------------------------------------------*/
} ADATV;

/*--------------------------------------------------------------------------------------------------*/
/*		アドバンスドオートチューニング データポインタ												*/
/*--------------------------------------------------------------------------------------------------*/
typedef	struct ADATP{
	FUN_CMN_CONTROL 	*FnCmnCtrl;
	UNI_PRM_STR 		*UniPrms;
	MENCV 				*MencV;
	BASE_CTRL_HNDL 		*BaseCtrlData;
	REG_MANAGER_HANDLE 	*RegManager;
//	SEQ_CTRL_HNDL 		*SeqCtrlData;
	SEQ_MOT_STS 		*SeqMotSts;
	SEQ_CTRL_OUT 		*SeqCtrlOut;
	ALMMAN_HANDLE 		*AlmManager;
	SETTLINGTIME 		*SettlingTime;
	AUTONOTCH   		*ANotch;
//	DET_HWBB_STS 		*DetHwbbSts;
	REMVIBFREQ   		*RemVibFreq;
	FFTANALYZE			*FftAna;
	ASICS 				*SvAsicRegs;
	MOTSPDMAFIL  	 	*MotSpdMafil;
	DETVIB 				*DetVib;
	SERVO_CONTROL_IF 	*SvControlIf;
} ADATP;

/*--------------------------------------------------------------------------------------------------*/
/*		アドバンスドオートチューニング構造体														*/
/*--------------------------------------------------------------------------------------------------*/
typedef	struct ADATHNDL {
	ADATREG AdatReg;
	ADATV	AdatV;
	ADATP	AdatP;
	PJOGV	OrgPJogV;						/* プログラムJOG用変数									*/
}ADATHNDL;

/****************************************************************************************************/
/*																									*/
/*		Function Prototype Definition																*/
/*																									*/
/****************************************************************************************************/
void	CpxAdvancedAutoTuning( ADATHNDL	*AdatHndl, FUN_CMN_CONTROL *FnCmnCtrl );
void 	AdatSetStrPtr( void *Axis );
LONG 	AdatPcalDefautDistance( ADATP *AdatP, LONG AxisMotType, BOOL LowSpdMotor ); /* <S145> */
#endif //__ADV_AUTO_TUNING_H
/***************************************** end of file **********************************************/
