/****************************************************************************************************/
/*																									*/
/*																									*/
/*		XlsPrmSgdtsIxOpt.h : パラメータ定義ヘッダファイル											*/
/*																									*/
/*																									*/
/****************************************************************************************************/
/*																									*/
/*																									*/
/*		1. パラメータ定義構造体																		*/
/*																									*/
/*		2. パラメータ設定データ構造体																*/
/*																									*/
/*		3. 標準パラメータ計算関数																	*/
/*																									*/
/*		4. パラメータ定義Extern宣言																	*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/************** Copyright (C) Yaskawa Electric Corporation ******************************************/
/*																									*/
/*		2013.01.11 : Made by Excel Macro															*/
/*																									*/
/*																									*/
/****************************************************************************************************/
#ifndef ___XLS_PRM_SGDTS___
#define  ___XLS_PRM_SGDTS___

#define FORMAT_ID			0x0808





/****************************************************************************************************/
/*																									*/
/*		エクセル表共通定義																			*/
/*																									*/
/****************************************************************************************************/
/*--------------------------------------------------------------------------------------------------*/
/*		表示時の底																					*/
/*--------------------------------------------------------------------------------------------------*/
#define DSPDEF_BASENBL			0				/* 属性：ニブル表示									*/
#define DSPDEF_BASEDEC			1				/* 属性：10進表示									*/
#define DSPDEF_BASEHEX			2				/* 属性：16進表示									*/
#define DSPDEF_BASEBIT			3				/* 属性：ビット表示									*/
/*--------------------------------------------------------------------------------------------------*/
/*		符号付きか否か																				*/
/*--------------------------------------------------------------------------------------------------*/
#define DSPDEF_W_SIGN			TRUE			/* 符号付											*/
#define DSPDEF_NOSIGN			FALSE			/* 符号なし											*/
/*--------------------------------------------------------------------------------------------------*/
/*		アクセスレベル(注意：0 は使用不可)															*/
/*--------------------------------------------------------------------------------------------------*/
#define ACCLVL_USER1			1				/* ユーザー１										*/
#define ACCLVL_USER2			2				/* ユーザー２										*/
#define ACCLVL_USER3			3				/* ユーザー３										*//* <S0FE> */
//#define ACCLVL_SYSTEM			3				/* システム											*//* <S0FE> */
#define ACCLVL_SYSTEM			4				/* システム											*//* <S0FE> */
/*--------------------------------------------------------------------------------------------------*/


/****************************************************************************************************/
/*																									*/
/*		パラメータ設定データ構造体定義																*/
/*																									*/
/****************************************************************************************************/
typedef struct
{
//	LONG	OTStop;				/* PnB1F : ｵｰﾊﾞｰﾄﾗﾍﾞﾙ停止方法										*/
/*--------------------------------------------------------------------------------------------------*/
//	LONG	LinerCircle;		/* PnB20 : 移動方法													*/
//	LONG	PosLimP;			/* PnB21 : 直線型(PnB20=0) の場合：ソフトリミット正転側(P-LS) 回転型(PnB20≠0) の場合：回転座標の終端	*/
//	LONG	PosLimN;			/* PnB23 : 直線型(PnB20=0) の場合：ソフトリミット逆転側 (N-LS) 回転型(PnB20≠0) の場合：回転座標の始端	*/
//	LONG	HomePos;			/* PnB25 : 原点位置 （インクリメンタルエンコーダの場合）絶対値エンコーダオフセット（絶対値エンコーダの場合）	*/
//	LONG	PosSpd;				/* PnB27 : 位置決め/ﾚｼﾞｽﾄﾚｰｼｮﾝ速度									*/
	LONG	AccRate;			/* PnB29 : 加速度													*/
	LONG	DecRate;			/* PnB2B : 減速度													*/
	LONG	InPosWidth;			/* PnB2D : /INPOSITION幅											*/
	LONG	NearWidth;			/* PnB2F : NEAR幅													*/
/*--------------------------------------------------------------------------------------------------*/
	USHORT	HomeMethod;			/* PnB31 : 原点復帰方法												*/
	USHORT	bHomeDir;			/* PnB32 : 原点復帰方向												*/
	LONG	HomeSpd;			/* PnB33 : 原点復帰移動速度											*/
	LONG	ApproachSpd;		/* PnB35 : 原点復帰ｱﾌﾟﾛｰﾁ速度										*/
	LONG	CreepSpd;			/* PnB37 : 原点復帰ｸﾘｰﾌﾟ速度										*/
	LONG	FinalDst;			/* PnB39 : 原点復帰最終移動距離										*/
//	LONG	SetupInfo0;			/* PnB3B : 予約ﾊﾟﾗﾒｰﾀ(ｾｯﾄｱｯﾌﾟ情報0)									*/
//	LONG	SetupInfo1;			/* PnB3D : 予約ﾊﾟﾗﾒｰﾀ(ｾｯﾄｱｯﾌﾟ情報1)									*/
//	LONG	SetupInfo2;			/* PnB3F : 予約ﾊﾟﾗﾒｰﾀ(ｾｯﾄｱｯﾌﾟ情報2)									*/
/*--------------------------------------------------------------------------------------------------*/
//	LONG	SetupInfo3;			/* PnB41 : 予約ﾊﾟﾗﾒｰﾀ(ｾｯﾄｱｯﾌﾟ情報3)									*/
//	LONG	SetupInfo4;			/* PnB43 : 予約ﾊﾟﾗﾒｰﾀ(ｾｯﾄｱｯﾌﾟ情報4)									*/
//	LONG	SetupInfo5;			/* PnB45 : 予約ﾊﾟﾗﾒｰﾀ(ｾｯﾄｱｯﾌﾟ情報5)									*/
//	LONG	SetupInfo6;			/* PnB47 : 予約ﾊﾟﾗﾒｰﾀ(ｾｯﾄｱｯﾌﾟ情報6)									*/
//	LONG	SetupInfo7;			/* PnB49 : 予約ﾊﾟﾗﾒｰﾀ(ｾｯﾄｱｯﾌﾟ情報7)									*/
//	LONG	SetupInfo8;			/* PnB4B : 予約ﾊﾟﾗﾒｰﾀ(ｾｯﾄｱｯﾌﾟ情報8)									*/
//	LONG	SetupInfo9;			/* PnB4D : 予約ﾊﾟﾗﾒｰﾀ(ｾｯﾄｱｯﾌﾟ情報9)									*/
//	LONG	bPOutInitZone;		/* PnB4F : ZONE信号指定												*/
/*--------------------------------------------------------------------------------------------------*/
//	LONG	Backlash;			/* PnB50 : ﾊﾞｯｸﾗｯｼｭ補正												*/
/*--------------------------------------------------------------------------------------------------*/
//	LONG	SIMode;				/* PnB90 : 信号入力方式												*/
/*--------------------------------------------------------------------------------------------------*/
//	USHORT	MODE01Lgc;			/* PnBA0 : /MODE 0/1 信号割り付け									*/
//	USHORT	STARTHOMELgc;		/* PnBA1 : /START-STOP, /HOME 信号割り付け							*/
//	USHORT	PGMRESJOGPLgc;		/* PnBA2 : /PGMRES , /JOGP 信号割り付け								*/
//	USHORT	SEL0JOGNLgc;		/* PnBA3 : /SEL0 , /JOGN 信号割り付け								*/
//	USHORT	SEL1JOG0Lgc;		/* PnBA4 : /SEL1 信号割り付け										*/
//	USHORT	SEL2JOG1Lgc;		/* PnBA5 : /SEL2 信号割り付け										*/
//	USHORT	SEL3JOG2Lgc;		/* PnBA6 : /SEL3 信号割り付け										*/
//	USHORT	SEL4JOG3Lgc;		/* PnBA7 : 予約パラメータ（SEL4)									*/
//	USHORT	SEL5Lgc;			/* PnBA8 : 予約パラメータ（SEL5)									*/
//	USHORT	SEL6Lgc;			/* PnBA9 : 予約パラメータ（SEL6)									*/
//	USHORT	SEL7Lgc;			/* PnBAA : 予約パラメータ（SEL7)									*/
	USHORT	SONLgc;				/* PnBAB : /S-ON信号割り付け										*/
	USHORT	POTLgc;				/* PnBAC : 予約パラメータ（P-OT 信号割り付け）						*/
	USHORT	NOTLgc;				/* PnBAD : 予約パラメータ（N-OT 信号割り付け）						*/
//	USHORT	DECLgc;				/* PnBAE : /DEC 信号割り付け										*/
	USHORT	RTRGLgc;			/* PnBAF : 予約パラメータ（/RGRT信号割り付け)						*/
/*--------------------------------------------------------------------------------------------------*/
	USHORT	ALMRSTLgc;			/* PnBB0 : /ALM-RST 信号割り付け									*/
	USHORT	PCLLgc;				/* PnBB1 : /P-CL信号割り付け										*/
	USHORT	NCLLgc;				/* PnBB2 : /N-CL信号割り付け										*/
//	USHORT	CLRLgc;				/* PnBB3 : /CLR信号割り付け											*/
	USHORT	PCONLgc;			/* PnBB4 : /PCON信号割り付け										*/
	USHORT	ZCLAMPLgc;			/* PnBB5 : /ZCLAMP信号割り付け										*/
	USHORT	INHIBITLgc;			/* PnBB6 : /INHIBIT信号割り付け										*/
	USHORT	PSELLgc;			/* PnBB7 : /PSEL信号割り付け										*/
/* <S03D> Start */
/*--------------------------------------------------------------------------------------------------*/
	USHORT	SPDDLgc;			/* /SPD-D 信号割り付け												*/
	USHORT	SPDALgc;			/* /SPD-A 信号割り付け												*/
	USHORT	SPDBLgc;			/* /SPD-B 信号割り付け												*/
	USHORT	CSELLgc;			/* /C-SEL 信号割り付け												*/
/* <S03D> End */
/*--------------------------------------------------------------------------------------------------*/
	USHORT	GSELLgc;			/* /G-SEL 信号割り付け <S09B> 										*/
	USHORT	SENLgc;				/* /SEN 信号割り付け <S168>											*/
	USHORT	FstpLgc;			/* /Fstp 信号割り付け <S1F5>										*/
	USHORT	PdetLgc;			/* /P-DET(Pn50D.3)										 <S21C> 	*/
/*--------------------------------------------------------------------------------------------------*/
	USHORT	bINPOSLgc;			/* PnBC0 : /INPOSITION 信号割り付け									*/
//	USHORT	bPOUT0Lgc;			/* PnBC1 : /POUT0 信号割り付け										*/
//	USHORT	bPOUT1Lgc;			/* PnBC2 : /POUT1 信号割り付け										*/
//	USHORT	bPOUT2Lgc;			/* PnBC3 : /POUT2 信号割り付け										*/
//	USHORT	bPOUT3Lgc;			/* PnBC4 : /POUT3 信号割り付け										*/
//	USHORT	bPOUT4Lgc;			/* PnBC5 : 予約パラメータ（/POUT4 信号割り付け）					*/
//	USHORT	bPOUT5Lgc;			/* PnBC6 : 予約パラメータ（/POUT5 信号割り付け）					*/
//	USHORT	bPOUT6Lgc;			/* PnBC7 : 予約パラメータ（/POUT6 信号割り付け）					*/
//	USHORT	bPOUT7Lgc;			/* PnBC8 : 予約パラメータ（/POUT7 信号割り付け）					*/
	USHORT	bWRNLgc;			/* PnBC9 : /WARN 信号割り付け										*/
	USHORT	bBKLgc;				/* PnBCA : /BK 信号割り付け											*/
	USHORT	bSRDYLgc;			/* PnBCB : /S-RDY 信号割り付け										*/
	USHORT	CLTLgc;				/* PnBCC : /CLT 信号割り付け										*/
	USHORT	TGONLgc;			/* PnBCD : /TGON 信号割り付け										*/
	USHORT	NEARLgc;			/* PnBCE : /NEAR 信号割り付け										*/
	USHORT	VCMPLgc;			/* PnBCF : /V-CMP 信号割り付け										*/
//	USHORT	BUSYLgc;			/* PnBD0 : /BUSY 信号割り付け										*/
//	USHORT	POSRDYLgc;			/* PnBD1 : /POSRDY 信号割り付け										*/
//	USHORT	PCOLgc;				/* PnBD2 : PCO 信号割り付け											*/
/*--------------------------------------------------------------------------------------------------*/
	USHORT	VLTLgc;				/* PnBD3 : /VLT 信号割り付け										*/
	USHORT	PSELALgc;			/* PnBDA : /PSELA 信号割り付け										*/
/*--------------------------------------------------------------------------------------------------*/
	USHORT	ZretPressTrq;		/* PnBDA : 押し付け原点復帰時の押し付けトルク						*/
	USHORT	ZretPressTime1;		/* PnBDB : 押し付け原点復帰時の押し付け検出時間						*/
	USHORT	ZretPressTime2;		/* PnBDC : 押し付け原点復帰時の原点復帰完了待ち時間					*/
/*--------------------------------------------------------------------------------------------------*/
	USHORT	TspdGain;			/* PnBE0 : 指令速度ゲイン											*/
/*--------------------------------------------------------------------------------------------------*/
	USHORT	spdDivision;		/* PnBF1 : 速度分解能設定											*/
	USHORT	IntEgear;			/* PnBF2 : 内部電子ギア												*/
} OPPRMDAT;
/*--------------------------------------------------------------------------------------------------*/



/****************************************************************************************************/
/*																									*/
/*		パラメータ設定データ変数Extern																*/
/*																									*/
/****************************************************************************************************/
extern	OPPRMDAT	OpPrm[];

#endif
/***************************************** end of file **********************************************/
