/****************************************************************************************************/
/*																									*/
/*																									*/
/*		SvFbkOpt.c : フィードバックオプションカード検出処理											*/
/*																									*/
/*																									*/
/****************************************************************************************************/
/*																									*/
/*																									*/
/*	機 能 : フィードバックオプションカードの検出処理を行う。										*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/************** Copyright (C) Yaskawa Electric Corporation ******************************************/
/*																									*/
/*		Rev.1.00 : 2007.02.01  (Den-S-Kai)															*/
/*					Comment rearranging for Sigma5 BaseSoft											*/
/*		Rev.1.01 : 2007.02.03	R.Uda																*/
/*					オプション構造体の見直しによるオプション変数の全面改訂							*/
/*		Rev.2.00 : 2013.09.30	<S04D>																*/
/*					SigmaV->Sigma7移植																*/
/*																									*/
/****************************************************************************************************/
#include	"SvOptCardIf.h"
#include	"HwDeviceIf.h"
#include 	"SerialEncIf.h"

/****************************************************************************************************/
/*																									*/
/*		Initialize Servo-Feedback Option I/F Variables												*/
/*																									*/
/****************************************************************************************************/
void	FbOptInitSvFeedbackOptVar( OPFBK_HNDL *FbkOpt, PRMDATA *Prm )
{

/*--------------------------------------------------------------------------------------------------*/
/*		Reset FbkOpt Parameters/Variables															*/
/*--------------------------------------------------------------------------------------------------*/
		MlibResetLongMemory( FbkOpt, sizeof(*FbkOpt)/4 );

/*--------------------------------------------------------------------------------------------------*/
/*		Initialize ID/Version/Number																*/
/*--------------------------------------------------------------------------------------------------*/
		FbkOpt->conf.OpInfo.IdType = FBKOP_ID_NONE;				/* オプションＩＤ			 		*/
		FbkOpt->conf.OpInfo.YNumber = 0xFFFF;					/* オプションＹ仕様番号				*/
		FbkOpt->conf.OpInfo.SoftVer = 0xFFFF;					/* オプションソフトＶｅｒ			*/
		FbkOpt->conf.OpInfo.SoftYspVer = 0xFFFF;				/* オプションソフトＹ仕様Ｖｅｒ		*/
		FbkOpt->conf.OpInfo.SoftTstVer = 0xFFFF;				/* オプションソフトテストＶｅｒ		*/
		FbkOpt->conf.OpInfo.PrmVer = 0xFFFF;					/* オプションパラメータＶｅｒ		*/

/*--------------------------------------------------------------------------------------------------*/
/*		Get The Required parameters																	*/
/*--------------------------------------------------------------------------------------------------*/
		FbkOpt->conf.PgBaudRateType = (ULONG)((Prm->encbaudrate >> 4 ) & 0x000F);
		
		return;
}


#if CSW_OPT_CARD_FBOPTION != CSW_FBOPTION_NO_SUPPORT
/****************************************************************************************************/
/*																									*/
/*		Detect Feedback Option Card																	*/
/* 				------------------------------------------------------------------------------------*/
/* 				: 本関数では、軸番号は0軸目/1軸目とする。											*/
/* 				------------------------------------------------------------------------------------*/
/* 				: フィードオプションでは、Ch1を使用するため、多軸アンプの1軸目と重複する。			*/
/* 				: 多軸アンプではフィードオプションに対応しない。									*/
/* 				: 	->	0軸目のみ。SGD7Wは、ｺﾝﾊﾟｲﾙｽｲｯﾁにより無効に設定済み							*/
/* 				------------------------------------------------------------------------------------*/
/* 				: HOST CPUの変数は、0軸目の領域に設定する。											*/
/* 				: シリアルエンコーダの送受信に関するUDLの設定は、0軸目に行う。						*/
/* 				: 位置補正モジュールに関するUDLの設定は、1軸目に行う								*/
/****************************************************************************************************/
void	FbOptDetectFeedbackOption( USHORT *OpDetInfo, OPFBK_HNDL *FbkOpt,
											ALMMAN_HANDLE *AlmManager, ASIC_HW_IF_STR *AsicHwReg )
{

	USHORT	i,cnt = 0;
	LONG	rc = FALSE;
/*--------------------------------------------------------------------------------------------------*/
/*		ID信号読み出し処理（3回読み多数決フィルタ）													*/
/*--------------------------------------------------------------------------------------------------*/
		for(i=0; i<3; i++) 
		{
			/* オプションカードＩＤコード読出し */
			if( HALDRV_GET_GPIO03 )
			{
				cnt++;
			}
			
			/* 次回読出し待ち時間 [250us] */
//			KpiResetWatchdogWaitus( 250 );	//TODO:Sigma7で同様の処理を実施する箇所はない？
		}

		/* 2回/3回以上でオプションカード接続とみなす */
		if( cnt >= 2 )
		{
			FbkOpt->conf.OpInfo.f.Connect = TRUE;
		}
		else
		{
			FbkOpt->conf.OpInfo.f.Connect = FALSE;
		}

/*--------------------------------------------------------------------------------------------------*/
/*		オプション検出処理																			*/
/*--------------------------------------------------------------------------------------------------*/

		/* 今回オプション接続ありの場合 */
		if( FbkOpt->conf.OpInfo.f.Connect )
		{
			/* cnt値のクリア <V785>	*/
			cnt = 0;

			/* CPU搭載情報読出し */
			for(i=0; i<3; i++) 
			{
				/* オプションカードＩＤコード読出し */
				if( HALDRV_GET_GPIO04 )
				{
					cnt++;
				}
				
				/* 次回読出し待ち時間 [250us] */
//				KpiResetWatchdogWaitus( 250 );	//TODO:Sigma7で同様の処理を実施する箇所はない？
			}

			/* 2回/3回以上でCPU搭載カードとみなす */
			if( cnt >= 2 )
			{
				FbkOpt->conf.OpInfo.IfType = FBKOP_SCNV_MODULE;	/* 現状、CPU搭載モジュールはシリアル変換型のみ 	*/
			}
			else
			{
				FbkOpt->conf.OpInfo.IfType = FBKOP_FULLCLS_ONLY;
			}

/*--------------------------------------------------------------------------------------------------*/
/*			仮処置：Pulse Encoder Cardをサポートした時点で削除										*/
/*--------------------------------------------------------------------------------------------------*/
/*--------------------------------------------------------------------------------------------------*/
/*			仮処置：Pulse Encoder Cardをサポートした時点で削除										*/
/*--------------------------------------------------------------------------------------------------*/

			switch( FbkOpt->conf.OpInfo.IfType ){
		/*------------------------------------------------------------------------------------------*/
		/*		Full-Closed I/F Card																*/
		/*------------------------------------------------------------------------------------------*/
				case FBKOP_FULLCLS_ONLY:
					*OpDetInfo |= 0x0100;		/* オプション検出情報(E51A)に正常検出(1)をセット*/
					FbkOpt->conf.OpInfo.IdType = FBKOP_ID_FULLCLOSE;
					FbkOpt->conf.OpInfo.YNumber = 0x0000;		/* オプションＹ仕様番号				*/
					FbkOpt->conf.OpInfo.SoftVer = 0x0000;		/* オプションソフトＶｅｒ			*/
					FbkOpt->conf.OpInfo.SoftYspVer = 0x0000;	/* オプションソフトＹ仕様Ｖｅｒ		*/
					FbkOpt->conf.OpInfo.SoftTstVer = 0x0000;	/* オプションソフトテストＶｅｒ		*/
					break;
		/*------------------------------------------------------------------------------------------*/
		/*		Pulse Encoder I/F Card																*/
		/*------------------------------------------------------------------------------------------*/
				case FBKOP_SCNV_MODULE:
					/* YASKAWAプロトコルのシリアル変換モジュールとのハンドシェイク処理 */
					rc = FbOptSCMHandShake( FbkOpt, AsicHwReg );
					/* ハンドシェイク成功 */
					if( rc == TRUE )
					{
						*OpDetInfo |= 0x0100;	/* オプション検出情報(E51A)に正常検出(1)をセット*/
					}
					/* ハンドシェイク失敗 */
					else
					{
						*OpDetInfo |= 0x0700;	/* オプション検出情報(E51A)に通信異常(7)をセット*/
					}
					break;
		/*------------------------------------------------------------------------------------------*/
		/*		Unsupported Card																	*/
		/*------------------------------------------------------------------------------------------*/
				case FBKOP_NOT_SUPPORTED:
				default:
					ALMSetServoAlarm( AlmManager, ALM_FBKOP_NSUP );	/* A.E75 : フィードバックオプションカード未サポート*/
					*OpDetInfo |= 0x0700;		/* オプション検出情報(E51A)に未サポート(7)をセット*/
					break;
			}

		}
		/* 今回オプション接続なしの場合 */
		else
		{
			/* 前回オプション接続ありの場合はアラーム */
			if( FbkOpt->conf.OpInfo.LastIdType != FBKOP_ID_NONE )
			{
				ALMSetServoAlarm( AlmManager, ALM_FBKOP_DET );	/* A.E72 : フィードバックオプションカード検出失敗	*/
				*OpDetInfo |= 0x0200;		/* オプション検出情報(E51A)に検出失敗(2)をセット	*/
			}
			FbkOpt->conf.OpInfo.IfType = FBKOP_NOT_CONNECTED;
		}

/*--------------------------------------------------------------------------------------------------*/
/*			EEPROM書き込み要求																		*/
/*--------------------------------------------------------------------------------------------------*/
		if( (FbkOpt->conf.OpInfo.IdType != FBKOP_ID_NONE) && (FbkOpt->conf.OpInfo.IdType != FbkOpt->conf.OpInfo.LastIdType) )
		{
			FbkOpt->conf.OpInfo.f.WrEepReq = TRUE;
		}

		return;
}

/****************************************************************************************************/
/*																									*/
/*		シリアル変換型フィードバックオプションモジュールハンドシェイク処理	<V785>にて変更			*/
/*																									*/
/****************************************************************************************************/
/*																									*/
/*	機 能 :	フィードバックセンサ信号をYASKAWA Protocolのシリアル信号に変換するフィードバックオプ	*/
/*			ションモジュールとのハンドシェイク処理を行う。											*/
/*																									*/
/****************************************************************************************************/
LONG FbOptSCMHandShake( OPFBK_HNDL *FbkOpt, ASIC_HW_IF_STR *AsicHwReg )
{
	SENCX	Enc;
	LONG	rc;
	UCHAR	PrmBuf[0x10];
	IDINFO	OptInfo;
	USHORT	work;
	USHORT	i,j;

/*--------------------------------------------------------------------------------------------------*/
/*		ローカル変数初期化																			*/
/*--------------------------------------------------------------------------------------------------*/
		rc = FALSE;
		MlibResetByteMemory( &OptInfo, sizeof(OptInfo) );

/*--------------------------------------------------------------------------------------------------*/
/*		開始処理																					*/
/*--------------------------------------------------------------------------------------------------*/
		/* Set Initialize Channel	*/
		SHalDrv_InitChangeToP0Mode(AsicHwReg, 1 );			/* Ｐ０モード設定				<S134>	*/
		Enc.TxBuf = (VULONG*)&(AsicHwReg->AREG_SE1_TXD01);	/* 送信バッファアドレス設定				*/
		Enc.RxBuf = (VULONG*)&(AsicHwReg->AREG_SE1_RXD01);	/* 受信バッファアドレス設定				*/
		Enc.RxFlg = &(AsicHwReg->AREG_SEPGSET11);			/* 受信完了フラグアドレス設定			*/
		Enc.TxCmd = KPX_CDAT_ENC0_ESYNC;					/* 送信開始コマンドデータ(ESYNC1)		*/
//		KpiResetWatchdogWaitus( 500 );						/* ResetWatchdog and Wait				*/

/*--------------------------------------------------------------------------------------------------*/
/*		エンコーダ通信速度設定(Pn250.1で設定された値)												*/
/*--------------------------------------------------------------------------------------------------*/
		if( (FbkOpt->conf.PgBaudRateType == SENCBR_AUTO_SEL)
						|| (FbkOpt->conf.PgBaudRateType == SENCBR_4MBPS_SEL) )
		{/* Initialize Current PG Baud Rate (4MBps) */
			FbkOpt->conf.PgBaudRate = SENC_COMRATE_4MBPS;
		}
		else
		{/* Initialize Current PG Baud Rate (8MBps) */
			FbkOpt->conf.PgBaudRate = SENC_COMRATE_8MBPS;
		}

/*--------------------------------------------------------------------------------------------------*/
/*		接続チェック																				*/
/*--------------------------------------------------------------------------------------------------*/
		SHalDrv_SetSencComRate( AsicHwReg, FbkOpt->conf.PgBaudRate, 1 );
//		KpiResetWatchdogWaitus( 500 );						/* ResetWatchdog and Wait				*///TODO:Sigma7で同様の処理を実施する箇所はない？

		rc = SencChkConnect( &Enc );							/* Check Connection						*/

/*--------------------------------------------------------------------------------------------------*/
		FbkOpt->var.f.ChekedConnect = TRUE;
		FbkOpt->var.f.Connect = (rc == TRUE)? TRUE: FALSE;

/*--------------------------------------------------------------------------------------------------*/
/*		接続時の処理																				*/
/*--------------------------------------------------------------------------------------------------*/
		if( rc == TRUE )									/* Check Return Code					*/
		{
	/*----------------------------------------------------------------------------------------------*/
	/*		ＩＤ読出し処理																			*/
	/*----------------------------------------------------------------------------------------------*/
			work = 0;
			for( work = 0; work < 0x0010; work += 8 )
			{
				if( SencReadParam8byte( &Enc, work, &PrmBuf[work] ) != TRUE )
				{
					rc = FALSE;
					break;
				}
			}
		}
	/*----------------------------------------------------------------------------------------------*/
	/*		ＩＤ処理																				*/
	/*----------------------------------------------------------------------------------------------*/
		if( rc == TRUE )
		{
			SencSetIDINFO( 0x00, PrmBuf, &OptInfo );
			SencSetIDINFO( 0x08, PrmBuf, &OptInfo );

			PrmBuf[2] = OptInfo.Model[1];
			PrmBuf[1] = OptInfo.Model[2];
			PrmBuf[0] = OptInfo.Model[3];
			work = 0;
			for( i = 0; i < 3; i++ )
			{
				for( j = 0; j < 0x10; j++ )			/* MlibAsciiTbl[]のサイズに従う				*/
				{
					if( PrmBuf[i] == MlibAsciiTbl[j] ) break;
				}
				if( j < 0x10 )						/* MlibAsciiTbl[]のサイズに従う				*/
				{
					work |= j<<(i*4);
				}
				else
				{
					work |= 0<<(i*4);
				}
			}
			FbkOpt->conf.OpInfo.IdType = work;
		}
/*--------------------------------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------------------------------*/
/*		終了処理																					*/
/*--------------------------------------------------------------------------------------------------*/
		SHalDrv_ChangeToP1Mode(AsicHwReg, 1 );				/* Ｐ１モード設定						*/
//		KpiResetWatchdog( );	//TODO

	return( rc );
}
#endif     /* <S09F> */

//#if CSW_OPT_CARD_FBOPTION != CSW_FBOPTION_NO_SUPPORT    /* <S09F> *//* <S19A> */
/****************************************************************************************************/
/*																									*/
/*		シリアル変換型フィードバックオプションモジュール情報設定									*/
/*		（from モータ／エンコーダパラメータ情報）													*/
/*																									*/
/****************************************************************************************************/
/*																									*/
/*	機 能 :	シリアル変換型フィードバックオプションモジュールがセミク制御またはフルク制御で使用さ	*/
/*			れる場合に呼ばれる処理。																*/
/*																									*/
/*		①モータ／エンコーダパラメータ情報からフィードバックオプションモジュール情報を設定する		*/
/*																									*/
/*			型式	：FbkOpt->conf.EncInfo.Model ⇒ FbkOpt->conf.OpInfo.ModelStr					*/
/*			ｼﾘｱﾙNO	：FbkOpt->conf.EncInfo.SNo 	⇒ FbkOpt->conf.OpInfo.SerNumStr					*/
/*			製造年月：FbkOpt->conf.EncInfo.Date 	⇒ FbkOpt->conf.OpInfo.Date						*/
/*																									*/
/*		  ※型式	:FbkOpt->conf.EncInfo.Modelに格納されるﾃﾞｰﾀとﾚｼﾞｽﾀ仕様のﾌｫｰﾏｯﾄ定義が異なるため、*/
/*					 並び替え後の型式ﾃﾞｰﾀをFbkOpt->conf.OpInfo.ModelStrへ格納する必要がある			*/
/*		  ※製造年月:FbkOpt->conf.EncInfo.Date(ｷｬﾗｸﾀ)とFbkOpt->conf.OpInfo.Date(ﾊﾞｲﾅﾘ)とでは型が	*/
/*					 異なるため、ﾊﾞｲﾅﾘ変換したﾃﾞｰﾀをFbkOpt->conf.OpInfo.Dateへ格納する必要がある。	*/
/*																									*/
/*		②フィードバックオプションモジュール情報をエンコーダ/モータ情報領域へコピーする。			*/
/*		  (上位が参照する可能性があるため、FBOpt情報をコピーする処理を行う)							*/
/*																									*/
/*		【エンコーダ関連】																			*/
/*			型式	：FbkOpt->conf.OpInfo.ModelStr	⇒ MencV->EncInfo.Model							*/
/*												⇒ FbkOpt->conf.EncInfo.Model						*/
/*			ｼﾘｱﾙNO	：FbkOpt->conf.OpInfo.SerNumStr 	⇒ MencV->EncInfo.SNo						*/
/*			製造年月：FbkOpt->conf.OpInfo.Date 		⇒ MencV->EncInfo.Date							*/
/*																									*/
/*		  ※FbkOpt->conf.EncInfo.Modelへｺﾋﾟｰするのは、ﾚｼﾞｽﾀ(C847H-C84EH,C896H-C8A1H,C8C3H-C8CAH)の	*/
/*			整合性を保つため。(ｺﾋﾟｰしないと、C847H-C84EH,C8C3H-C8CAHはﾚｼﾞｽﾀ仕様を満たさない)		*/
/*																									*/
/*		【モータ関連】																				*/
/*			型式	：FbkOpt->conf.MotInfo.Model	⇒ MencV->MotInfo.Model							*/
/*			ｼﾘｱﾙNO	：FbkOpt->conf.MotInfo.SNo 	⇒ MencV->MotInfo.SNo								*/
/*			製造年月：FbkOpt->conf.MotInfo.Date 	⇒ MencV->MotInfo.Date							*/
/*																									*/
/*--------------------------------------------------------------------------------------------------*/
/*	<V844> フルクの場合に、セミクエンコーダ情報エリアにフルク（FBオプション）情報を誤ってコピー		*/
/*		   していた不具合の修正(FBオプション不具合No20)のため、処理見直し							*/
/****************************************************************************************************/
void FbOptSetIDInfo( OPFBK_HNDL *FbkOpt, MENCV *MencV, BOOL SencFbOptUse )
{
	LONG	work, i;
	USHORT	Yflg;
	UCHAR	Chbuf[3];
#if CSW_OPT_CARD_FBOPTION != CSW_FBOPTION_NO_SUPPORT    /* <S19A> */
	/*----------------------------------------------------------------------------------------------*/
	/*	エンコーダＩＤ領域にフィードバックオプションモジュールＩＤがセットされているタイプの場合	*/
	/*		※ 現状はこのタイプしか存在しない。														*/
	/*----------------------------------------------------------------------------------------------*/
		if( FbkOpt->conf.OpInfo.IfType == FBKOP_SCNV_MODULE )
		{
		/*------------------------------------------------------------------------------------------*/
		/*		エンコーダ情報の取得、設定処理後に、エンコーダＩＤ情報をフィードバックオプショ		*/
		/*		ンモジュールＩＤ情報にコピーし、エンコーダＩＤ情報はクリアする。					*/
		/*------------------------------------------------------------------------------------------*/
		/*		形式コピー																			*/
		/*------------------------------------------------------------------------------------------*/
		/*---------- FBOptｶｰﾄﾞ型式情報設定 (固定部)-------------------------------------------------*/
			FbkOpt->conf.OpInfo.ModelStr[0] = 'S';
			FbkOpt->conf.OpInfo.ModelStr[1] = 'G';
			FbkOpt->conf.OpInfo.ModelStr[2] = 'D';
			FbkOpt->conf.OpInfo.ModelStr[3] = 'V';
			FbkOpt->conf.OpInfo.ModelStr[4] = '-';
			FbkOpt->conf.OpInfo.ModelStr[5] = 'O';
		/*---------- FBOptｶｰﾄﾞ型式情報設定 (可変部)-------------------------------------------------*/
			//ID (FBOptPrm:0x00-0x03)
			FbkOpt->conf.OpInfo.ModelStr[6] = FbkOpt->conf.EncInfo.Model[0];
			FbkOpt->conf.OpInfo.ModelStr[7] = FbkOpt->conf.EncInfo.Model[1];
			FbkOpt->conf.OpInfo.ModelStr[8] = FbkOpt->conf.EncInfo.Model[2];
			FbkOpt->conf.OpInfo.ModelStr[9] = FbkOpt->conf.EncInfo.Model[3];
			//Production revision  (FBOptPrm:0x04)
			FbkOpt->conf.OpInfo.ModelStr[10] = FbkOpt->conf.EncInfo.Model[4];
			//Parameter manufacture ID (FBOptPrm:0x05)
				//情報なし
			//Y仕様判定
			Chbuf[0] = FbkOpt->conf.EncInfo.Model[5];
			Chbuf[1] = FbkOpt->conf.EncInfo.Model[6];
			Chbuf[2] = FbkOpt->conf.EncInfo.Model[7];
			for( i = 0; i < 3; i++ )
			{ //文字の各桁が0x30<=ｘ<=0x39(0～9)の範囲内のみY仕様と判定する。その他は標準仕様扱い。
				if(('0' <= Chbuf[i]) && (Chbuf[i] <= '9'))
				{
					Yflg = TRUE;
				}
				else
				{
					Yflg = FALSE;
					break;
				}
			}
			
			if(Yflg == TRUE)
			{
				if(((FbkOpt->conf.EncInfo.Model[5] != '0') || 
						(FbkOpt->conf.EncInfo.Model[6] != '0') || (FbkOpt->conf.EncInfo.Model[7] != '0')))
				{	/* Ｙ仕様設定(ALL='0'は標準仕様とする) */
					FbkOpt->conf.OpInfo.ModelStr[11] = 'Y';
					FbkOpt->conf.OpInfo.ModelStr[12] = Chbuf[0];
					FbkOpt->conf.OpInfo.ModelStr[13] = Chbuf[1];
					FbkOpt->conf.OpInfo.ModelStr[14] = Chbuf[2];
				}
				else
				{
					/* 全桁'0'は標準とする */
					Yflg = FALSE;
				}
			}

		/*------------------------------------------------------------------------------------------*/
		/*		オプションＹ仕様番号 (0:標準, 1〜999(dec):Y仕様										*/
		/*------------------------------------------------------------------------------------------*/
			if(Yflg == FALSE)
			{
				FbkOpt->conf.OpInfo.YNumber = 0;
			}
			else
			{
				work = ( FbkOpt->conf.OpInfo.ModelStr[14] - 0x30 );
				work += ( FbkOpt->conf.OpInfo.ModelStr[13] - 0x30 ) * 10;
				work +=  ( FbkOpt->conf.OpInfo.ModelStr[12] - 0x30 ) * 100;
				FbkOpt->conf.OpInfo.YNumber = (USHORT)work;
			}

		/*------------------------------------------------------------------------------------------*/
		/*		形式コピー(この情報は先にOpInfoを作るので、EncInfoにコピーする						*/
		/*------------------------------------------------------------------------------------------*/
			work = MlibMIN( sizeof(FbkOpt->conf.OpInfo.ModelStr), sizeof(FbkOpt->conf.EncInfo.Model) );
			MlibCopyByteMemory( (UCHAR*)(FbkOpt->conf.OpInfo.ModelStr), (UCHAR*)(FbkOpt->conf.EncInfo.Model), work );
		/*------------------------------------------------------------------------------------------*/
		/*		シリアル番号コピー																	*/
		/*------------------------------------------------------------------------------------------*/
			work = MlibMIN( sizeof(FbkOpt->conf.EncInfo.SNo), sizeof(FbkOpt->conf.OpInfo.SerNumStr) );
			MlibCopyByteMemory( (UCHAR*)(FbkOpt->conf.OpInfo.SerNumStr), (UCHAR*)(FbkOpt->conf.EncInfo.SNo), work );
		/*------------------------------------------------------------------------------------------*/
		/*		製造年月設定コピー																	*/
		/*------------------------------------------------------------------------------------------*/
			FbkOpt->conf.OpInfo.Date[0] = (FbkOpt->conf.EncInfo.Date[0] - '0')*10 + (FbkOpt->conf.EncInfo.Date[1] - '0');
			FbkOpt->conf.OpInfo.Date[1] = (FbkOpt->conf.EncInfo.Date[3] - '0')*10 + (FbkOpt->conf.EncInfo.Date[4] - '0');
		/*------------------------------------------------------------------------------------------*/
		/*		オプションＩＤ情報終端コード挿入													*/
		/*------------------------------------------------------------------------------------------*/
			SencFillNullIDINFO( &FbkOpt->conf.EncInfo );

		/*------------------------------------------------------------------------------------------*/
		/*  オプションから得たモータとエンコーダの製品IDを既存のエリアにコピーする					*/
		/*   FbkOpt->conf.MotInfo ⇒ MencV->MotInfo													*/
		/*   FbkOpt->conf.MotInfo ⇒ MencV->MotInfo													*/
		/*------------------------------------------------------------------------------------------*/
			if(SencFbOptUse == TRUE)	
			{
				/* エンコーダ形式	：　オプション形式をエンコーダ形式とする				*/
				work = MlibMIN( sizeof(FbkOpt->conf.OpInfo.ModelStr), sizeof(MencV->EncInfo.Model) );
				MlibCopyByteMemory( (UCHAR*)(MencV->EncInfo.Model), (UCHAR*)(FbkOpt->conf.OpInfo.ModelStr), work );
				/* シリアル番号		：　オプションS/NをエンコーダS/Nとする					*/
				work = MlibMIN( sizeof(FbkOpt->conf.EncInfo.SNo), sizeof(MencV->EncInfo.SNo) );
				MlibCopyByteMemory( (UCHAR*)(MencV->EncInfo.SNo), (UCHAR*)(FbkOpt->conf.EncInfo.SNo), work );
				/* 製造年月			：	オプション製造年月をエンコーダ製造年月とする		*/
				MencV->EncInfo.Date[0] = FbkOpt->conf.EncInfo.Date[0];
				MencV->EncInfo.Date[1] = FbkOpt->conf.EncInfo.Date[1];
				MencV->EncInfo.Date[2] = FbkOpt->conf.EncInfo.Date[2];
				MencV->EncInfo.Date[3] = FbkOpt->conf.EncInfo.Date[3];
				MencV->EncInfo.Date[4] = FbkOpt->conf.EncInfo.Date[4];

				/* モータ形式	：　オプション内モータ形式を有効モータ形式とする			*/
				work = MlibMIN( sizeof(FbkOpt->conf.MotInfo.Model), sizeof(MencV->MotInfo.Model) );
				MlibCopyByteMemory( (UCHAR*)(MencV->MotInfo.Model), (UCHAR*)(FbkOpt->conf.MotInfo.Model), work );
				/* シリアル番号	：	オプション内モータS/Nを有効モータS/Nとする				*/
				work = MlibMIN( sizeof(FbkOpt->conf.MotInfo.SNo), sizeof(MencV->MotInfo.SNo) );
				MlibCopyByteMemory( (UCHAR*)(MencV->MotInfo.SNo), (UCHAR*)(FbkOpt->conf.MotInfo.SNo), work );
				/* 製造年月		：	オプション内モータ製造年月を有効モータ製造年月とする	*/
				work = MlibMIN( sizeof(FbkOpt->conf.MotInfo.Date), sizeof(MencV->MotInfo.Date) );
				MlibCopyByteMemory( (UCHAR*)(MencV->MotInfo.Date), (UCHAR*)(FbkOpt->conf.MotInfo.Date), work );
			}

		/*------------------------------------------------------------------------------------------*/
		/*		オプションソフトＹ仕様Ｖｅｒ	(情報元データなし：０固定)							*/
		/*------------------------------------------------------------------------------------------*/
			FbkOpt->conf.OpInfo.SoftYspVer = 0x0000;
		/*------------------------------------------------------------------------------------------*/
		/*		オプションソフトテストＶｅｒ	(情報元データなし：０固定)							*/
		/*------------------------------------------------------------------------------------------*/
			FbkOpt->conf.OpInfo.SoftTstVer = 0x0000;
		/*------------------------------------------------------------------------------------------*/
		/*		オプションパラメータＶｅｒ		(情報元データなし：０固定)							*/
		/*------------------------------------------------------------------------------------------*/
			FbkOpt->conf.OpInfo.PrmVer = 0x0000;
		}
/*--------------------------------------------------------------------------------------------------*/
#endif     /* <S19A> */
		return;
}
//#endif     /* <S09F> */

#if CSW_OPT_CARD_FBOPTION != CSW_FBOPTION_NO_SUPPORT    /* <S09F> */
/****************************************************************************************************/
/*																									*/
/*		機種情報レジスタ：フィードバックオプションモジュール情報設定								*/
/*																									*/
/****************************************************************************************************/
/*																									*/
/*	機 能 :	機種情報レジスタにＩＤ情報以外のフィードバックオプションモジュール情報をセットする		*/
/*																									*/
/****************************************************************************************************/
void FbOptInitRegister(OPFBK_HNDL *FbkOpt, MENCV *FencV, PRMDATA* Prm, BPRMDAT* Bprm)
{
	LONG	x;
	UCHAR	y;
		if( Bprm->FencUse == TRUE )
		{
		/*------------------------------------------------------------------------------------------*/
		/*		フィードバックオプションモジュール内エンコーダ情報									*/
		/*------------------------------------------------------------------------------------------*/
			FbkOpt->conf.EncType = FencV->EncType;						/* エンコーダタイプ／分解能	*/
		/*------------------------------------------------------------------------------------------*/
			FbkOpt->conf.XfbPulse2 = 1 << Prm->MencP.BitnoDpoint.b.l;		/* エンコーダ分解能			*/
		/*------------------------------------------------------------------------------------------*/
			y = (FencV->AbsoEncoder == TRUE)? 0x10 : 0x00;
			FbkOpt->conf.AbsEncType = ((y >> 4) & 0x0F) - 1;			/* 絶対値エンコーダタイプ	*/
		/*------------------------------------------------------------------------------------------*/
															/* エンコーダファームウエアバージョン	*/
			FbkOpt->conf.EncVer = (FbkOpt->conf.OpInfo.IfType == FBKOP_SCNV_MODULE)? 0 : FencV->SoftVer;
		/*------------------------------------------------------------------------------------------*/
		}
		else if( Bprm->SencFbOptUse == TRUE )
		{
		/*------------------------------------------------------------------------------------------*/
		/*	フィードバックオプションモジュール内モータ情報											*/
		/*------------------------------------------------------------------------------------------*/
		/*	セミクローズ制御で使用する場合にのみセットする											*/
		/*------------------------------------------------------------------------------------------*/
			FbkOpt->conf.MotID = Prm->MencP.typm_e.b.l;									/* モータＩＤ	*/
		/*------------------------------------------------------------------------------------------*/
			FbkOpt->conf.MotWat.dw = MlibScalKskxkx( Bprm->MotW, 1, 1, NULL, -30 );	/* モータ容量	*/
		/*------------------------------------------------------------------------------------------*/
			FbkOpt->conf.MotVolt = Bprm->MotVcode;							/* モータ電圧コード		*/
		/*------------------------------------------------------------------------------------------*/

		/*------------------------------------------------------------------------------------------*/
		/*		フィードバックオプションモジュール内エンコーダ情報									*/
		/*------------------------------------------------------------------------------------------*/
			x = (Prm->MencP.typm_e.b.h & 0xF0)? 0x0100 : 0x0000;
			FbkOpt->conf.EncType = x | Prm->MencP.bit_dp.b.l;					/* エンコーダタイプ／分解能	*/
		/*------------------------------------------------------------------------------------------*/
			FbkOpt->conf.XfbPulse2 = Bprm->XfbPulse2;					/* エンコーダ分解能			*/
		/*------------------------------------------------------------------------------------------*/
			FbkOpt->conf.AbsEncType = ((Prm->MencP.typm_e.b.h >> 4) & 0x0F) - 1;/* 絶対値エンコーダタイプ	*/
		/*------------------------------------------------------------------------------------------*/
															/* エンコーダファームウエアバージョン	*/
			FbkOpt->conf.EncVer = (FbkOpt->conf.OpInfo.IfType == FBKOP_SCNV_MODULE)? 0 : Prm->MencP.encver;
		/*------------------------------------------------------------------------------------------*/
		}
	return;
}
#endif     /* <S09F> */



#if 0/* TODO:Sigma7では同一ｱﾝﾌﾟ(ﾊﾟﾗﾒｰﾀの設定に依存しない)で回転形とリニア形に接続出来る */
/****************************************************************************************************/
/*		製品未サポートチェック処理 (フィードバックオプションモジュール								*/
/*																									*/
/*		未サポート条件 … (1) リニア型起動(PnE0B.bit1=1)且つフィードバックオプションモジュール側を	*/
/*							  セミクローズ制御で使用する設定(Pn002.3=0, Pn00B.3=1)で、フィードバッ	*/
/*							  クオプションモジュール内のモータ定数がリニア型でない場合。			*/
/*							  （フルクのチェックはリニア型の製品未サポートチェックで実施)。			*/
/*						  (2) 回転型起動(PnE0B.Bit1=0)且つフィードバックオプションモジュール側を	*/
/*							  セミクローズ制御で使用する設定(Pn002.3=0, Pn00B.3=1)で、フィードバッ	*/
/*							  クオプションモジュール内のモータ定数が回転型でない場合。				*/
/****************************************************************************************************/
void FbOptCheckConnectNonSupport( OPFBK_HNDL *FbkOpt )
{
	LONG	rc;

	rc = FALSE;

	if( Kprm.f.SencFbOptUse == TRUE )
	{
	/*----------------------------------------------------------------------------------------------*/
	/*		モータレステストモードチェック															*/
	/*----------------------------------------------------------------------------------------------*/
		if( (Kprm.f.MotorLessTestMode == FALSE)						/* モータレステストモードでない	*/
				|| (MotorLessTestDatas.f.SemiEncConnect == TRUE))	/* エンコーダ接続				*/
		{
		/*------------------------------------------------------------------------------------------*/
		/*		リニアタイプのアンプの場合の未サポート可能性判定（回転パラメータの場合）			*/
		/*------------------------------------------------------------------------------------------*/
			if( (Kprm.AmpType == AMPTYPE_LINEAR) && ((MencV->TypeCode & 0x02) == 0x02) )
			{
				rc |= TRUE;										/* 未サポートと判定					*/
			}
		/*------------------------------------------------------------------------------------------*/
		/*		回転タイプのアンプの場合の未サポート可能性判定（リニアパラメータの場合）			*/
		/*------------------------------------------------------------------------------------------*/
			if( (Kprm.AmpType == AMPTYPE_ROTARY) && ((MencV->TypeCode & 0x02) == 0x00) )
			{
				rc |= TRUE;										/* 未サポートと判定					*/
			}
		/*------------------------------------------------------------------------------------------*/
		}
	/*----------------------------------------------------------------------------------------------*/
	}

/*--------------------------------------------------------------------------------------------------*/
/*		製品未サポートアラームセット																*/
/*--------------------------------------------------------------------------------------------------*/
	if( rc == TRUE )
	{
		ALMSetServoAlarm( AxisRsc->AlmManager, ALM_NOTSUPPORT );/* A.051 : 製品未サポートアラーム	*/
	}
/*--------------------------------------------------------------------------------------------------*/
	return;
}
#endif


#if CSW_OPT_CARD_FBOPTION != CSW_FBOPTION_NO_SUPPORT    /* <S09F> */
/****************************************************************************************************/
/*																									*/
/*		フィードバックオプションエンコーダ選択リセット用処理										*/
/*																									*/
/****************************************************************************************************/
/*																									*/
/*	機 能 :	リセット時（パラメータ再計算時）のエンコーダ選択チェック								*/
/*																									*/
/****************************************************************************************************/
BOOL	FbOptPrstSelectEncoder(OPFBK_HNDL *FbkOpt, PRMDATA* Prm, BPRMDAT* Bprm )
{
	BOOL PrmError;
	
	PrmError = FALSE;/* <S052> */
/*--------------------------------------------------------------------------------------------------*/
/*	セミクローズで使用していたシリアルコンバータタイプオプションを、フルクローズで使用しようと		*/
/*	した場合、CN2接続のモータパラメータはREADされないため、異常とする。								*/
/*--------------------------------------------------------------------------------------------------*/
/*	Bprm->SencFbOptUse は 電源投入(CPUリセット)時にしか設定されないため、リセット前のシリアル		*/
/*	コンバータタイプオプションのセミクローズ使用の条件として使用する。								*/
/*--------------------------------------------------------------------------------------------------*/
	if( (Bprm->SencFbOptUse == TRUE) && ((Prm->b_prm2>>12) & 0x000F) )
	{
		PrmError = TRUE;								/* セミフルクパラメータ設定異常（A.044)		*/
	}

/*--------------------------------------------------------------------------------------------------*/
/*	フルクローズで使用していたシリアルコンバータタイプオプションを、セミクローズで使用しようと		*/
/*	した場合、オプション内のモータパラメータはREADされないため、異常とする。						*/
/*--------------------------------------------------------------------------------------------------*/
/*	FbkOpt->var.f.FullclosedUse は 電源投入(CPUリセット)時にしか設定されないため、リセット前の		*/
/*	シリアルコンバータタイプオプションのフルクローズ使用の条件として使用する。						*/
/*--------------------------------------------------------------------------------------------------*/
	if( (FbkOpt->var.f.FullclosedUse == TRUE) && (((Prm->b_prmB>>12) & 0x000F) == 1) )
	{
		PrmError = TRUE;								/* セミフルクパラメータ設定異常（A.044)		*/
	}
/*--------------------------------------------------------------------------------------------------*/
	return PrmError;
}
#endif     /* <S09F> */

#if CSW_OPT_CARD_FBOPTION != CSW_FBOPTION_NO_SUPPORT           /* <S09F> */
/****************************************************************************************************/
/*																									*/
/*		フルク／セミクパラメータチェック															*/
/*																									*/
/****************************************************************************************************/
/*																									*/
/*	機 能 : フルクローズエンコーダ／セミクローズドエンコーダの設定をチェックする。					*/
/*																									*/
/*		ChkSw																						*/
/*			TRUE ： オプション基盤接続チェック有													*/
/*			FALSE： オプション基盤接続チェック無													*/
/*																									*/
/*		RETRUN																						*/
/*			TRUE ： 	正常																		*/
/*			FALSE： パラメータ設定異常																*/
/*																									*/
/****************************************************************************************************/
LONG	FbOptFullSemiPrmChk( MENCV *MencV, OPFBK_HNDL *FbkOpt, PRMDATA* Prm, BPRMDAT* Bprm, LONG ChkSw )
{
	LONG	rc = TRUE ;
	if((Prm->b_prm2>>12) & 0x000F)						/* フルクローズとして使用？					*/
	{
		if(Prm->syssw1 & 0x0001)							/* フルクローズ対応機種？					*/
		{
			if(MencV->AxisMotType == MOTTYPE_ROTARY)			/* 回転型？									*/
			{
				if( (ChkSw == TRUE ) &&					/* フィードバックオプション基盤接続チェック有り	 &&	*/
					(FbkOpt->conf.OpInfo.f.Connect == FALSE))/* フィードバックオプション基盤接続されていない？	*/
				{
					rc = FALSE;
				}
				else if( (ChkSw == TRUE ) && (FbkOpt->conf.OpInfo.IfType == FBKOP_FULLCLS_ONLY) )
				{
					if((Prm->b_prmB>>12) & 0x000F)
					{
						rc = FALSE;
					}
				}
			}
			else										/* リニア型?								*/
			{
				rc = FALSE;
			}
		}
		else											/* フルク非対応機種？						*/
		{
			rc = FALSE;
		}
	}
	else												/* セミクローズとして使用？					*/
	{
		/* ﾌｨｰﾄﾞﾊﾞｯｸｵﾌﾟｼｮﾝ基板接続チェック有り かつ、												*/
		/* ﾌｨｰﾄﾞﾊﾞｯｸｵﾌﾟｼｮﾝ基板接続されていない、または、											*/
		/* ﾌｨｰﾄﾞﾊﾞｯｸｵﾌﾟｼｮﾝ基板接続されている、かつ ﾌｨｰﾄﾞﾊﾞｯｸｵﾌﾟｼｮﾝ基板ﾀｲﾌﾟがﾌﾙｸﾛｰｽﾞ					*/
		if((ChkSw == TRUE) &&
		   ( (FbkOpt->conf.OpInfo.f.Connect == FALSE) ||
		  	 ( (FbkOpt->conf.OpInfo.f.Connect == TRUE)&&(FbkOpt->conf.OpInfo.IfType == FBKOP_FULLCLS_ONLY) ) ) )
		{
			if((Prm->b_prmB>>12) & 0x000F)				/* フィードバックオプションに接続？			*/
			{
				rc = FALSE;
			}
		}
	}
	return(rc);
}
#endif     /* <S09F> */

//#endif/* CSW_FBOPTION_SUPPORT *//* <S09F> */
/***************************************** end of file **********************************************/

