/****************************************************************************************************/
/*																									*/
/*																									*/
/*		SvSftOpt.c : セーフティオプションカード検出処理												*/
/*																									*/
/*																									*/
/****************************************************************************************************/
/*																									*/
/*																									*/
/*	機 能 : セーフティオプションカードの検出処理を行う。											*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/************** Copyright (C) Yaskawa Electric Corporation ******************************************/
/*																									*/
/*		Rev.1.00 : 2007.02.01  (Den-S-Kai)															*/
/*					Comment rearranging for Sigma5 BaseSoft											*/
/*		Rev.1.01 : 2007.02.03	R.Uda																*/
/*					オプション構造体の見直しによるオプション変数の全面改訂							*/
/*		Rev.2.00 : 2014.01.07	<S0C1>																*/
/*					SigmaV->Sigma7移植																*/
/*																									*/
/****************************************************************************************************/
/*																									*/
/****************************************************************************************************/
#include	"SvOptCardIf.h"
#include	"HwDeviceIf.h"



/****************************************************************************************************/
/*																									*/
/*		Initialize Servo-Safety Option I/F Variables												*/
/*																									*/
/****************************************************************************************************/
void	SftOptInitSvSafetyOptVar( OPSFT_HNDL *SftOpt )
{

/*--------------------------------------------------------------------------------------------------*/
/*		Reset SftOpt Parameters/Variables															*/
/*--------------------------------------------------------------------------------------------------*/
		MlibResetLongMemory( SftOpt, sizeof(*SftOpt)/4 );

/*--------------------------------------------------------------------------------------------------*/
/*		Initialize ID/Version/Number																*/
/*--------------------------------------------------------------------------------------------------*/
		SftOpt->conf.OpInfo.IdType = SFTOP_ID_NONE;				/* オプションＩＤ			 		*/
		SftOpt->conf.OpInfo.YNumber = 0xFFFF;					/* オプションＹ仕様番号				*/
		SftOpt->conf.OpInfo.SoftVer = 0xFFFF;					/* オプションソフトＶｅｒ			*/
		SftOpt->conf.OpInfo.SoftYspVer = 0xFFFF;				/* オプションソフトＹ仕様Ｖｅｒ		*/
		SftOpt->conf.OpInfo.SoftTstVer = 0xFFFF;				/* オプションソフトテストＶｅｒ		*/
		SftOpt->conf.OpInfo.PrmVer = 0xFFFF;					/* オプションパラメータＶｅｒ		*/

		return;
}



/****************************************************************************************************/
/*																									*/
/*		Detect Safety Option Card																	*/
/*																									*/
/****************************************************************************************************/
void	SftOptDetectSafetyOption( OPSFT_HNDL *SftOpt, ALMMAN_HANDLE *AlmManager )
{
	USHORT	i,cnt = 0;
/*--------------------------------------------------------------------------------------------------*/
/*		ID信号読み出し処理（3回読み多数決フィルタ）													*/
/*--------------------------------------------------------------------------------------------------*/
		for(i=0; i<3; i++) 
		{
			/* オプションカードＩＤコード読出し */
			if( HALDRV_GET_GPIO02 )
			{
				cnt++;
			}
			
			/* 次回読出し待ち時間 [250us] */
//			KpiResetWatchdogWaitus( 250 );
		}

		/* 2回/3回以上でオプションカード接続とみなす */
		if( cnt >= 2 )
		{
			SftOpt->conf.OpInfo.f.Connect = TRUE;
		}
		else
		{
			SftOpt->conf.OpInfo.f.Connect = FALSE;
		}
#if	CSW_OPT_CARD_SAFETY == CSW_SAFETY_NO_SUPPORT
		if ( SftOpt->conf.OpInfo.f.Connect == TRUE )
		{
// 			コメント：暫定処置		
//			ALMSetServoAlarm( AlmManager, ALM_SFTOP_NSUP );	/* A.E74 : セーフティオプションカード未サポート */
		}
#endif
		return;
}
/***************************************** end of file **********************************************/
