/****************************************************************************************************/
/*																									*/
/*																									*/
/*		JL086ServoIpReg.h : JL-086 SERVOIPレジスタ定義ヘッダファイル								*/
/*																									*/
/*																									*/
/****************************************************************************************************/
/*																									*/
/*																									*/
/*		1. JL-086 SERVOIPレジスタ定義																*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/************** Copyright (C) Yaskawa Electric Corporation ******************************************/
/*																									*/
/*		2014.02.19 : Made by Excel Macro															*/
/*																									*/
/*																									*/
/****************************************************************************************************/
#ifndef _JL086_SERVOIP_REG_H
#define _JL086_SERVOIP_REG_H



/****************************************************************************************************/
/*																									*/
/*		ASIC JL-086 SERVOIP H/Wレジスタ構造体定義													*/
/*																									*/
/****************************************************************************************************/
typedef struct _ASIC_HW_IF_STR {
	VULONG	AREG_PWMU;				/* 0x0000 アナログモニタPWM出力U								*/
	VULONG	AREG_PWMV;				/* 0x0004 アナログモニタPWM出力V								*/
	VULONG	AREG_IOSTAT;			/* 0x0008 汎用同期シリアル出力＆送信バッファ転送				*/
	VULONG	SPARE0;					/* 0x000C Reserve												*/
	VULONG	AREG_ITDO;				/* 0x0010 初期化時用タイマ(RD)									*/
	VULONG	AREG_TIM1SET;			/* 0x0014 タイマ1設定レジスタ									*/
	VULONG	AREG_UARTSTS;			/* 0x0018 UARTステータス										*/
	VULONG	AREG_UARTXD;			/* 0x001C 汎用非同期ポート送信データ(WR)＆受信データ(RD)		*/
	VULONG	AREG_DIVCSEV;			/* 0x0020 エンコーダパルス出力分周比設定						*/
	VULONG	SPARE1[4];				/* 0x0024-0x0030 Reserve										*/
	VULONG	AREG_INT1SET;			/* 0x0034 INT1割込み設定&アクノリッジ							*/
	VULONG	AREG_PFNCSET;			/* 0x0038 端子機能設定											*/
	VULONG	SPARE2;					/* 0x003C Reserve												*/
/*--------------------------------------------------------------------------------------------------*/
	VULONG	AREG_FBCSET;			/* 0x0040 分周入力フィルタ設定									*/
	VULONG	AREG_POCSET;			/* 0x0044 指令カウンタ設定										*/
	VULONG	AREG_DINCSET;			/* 0x0048 分周機能設定											*/
	VULONG	AREG_LODSET;			/* 0x004C ロード設定											*/
	VULONG	AREG_T_FBLD;			/* 0x0050 FBカウンタ設定										*/
	VULONG	AREG_T_CMDLD;			/* 0x0054 CMDカウンタ設定										*/
	VULONG	AREG_ALMCLR;			/* 0x0058 アラームラッチリセット								*/
	VULONG	AREG_ALMSET;			/* 0x005C アラーム設定											*/
	VULONG	AREG_IOSTATX;			/* 0x0060 汎用入力												*/
	VULONG	AREG_FLTSTAT;			/* 0x0064 故障入力												*/
	VULONG	SPARE3;					/* 0x0068 Reserve												*/
	VULONG	AREG_SETREG1;			/* 0x006C 内部設定レジスタ										*/
	VULONG	AREG_SETREG2;			/* 0x0070 機能選択レジスタ										*/
	VULONG	AREG_CLKO;				/* 0x0074 シリアルエンコーダIF伝送速度設定レジスタ				*/
	VULONG	AREG_CSTP;				/* 0x0078 機能停止選択レジスタ("1"で停止)						*/
	VULONG	AREG_SEPGSET00;			/* 0x007C シリアルエンコーダIF設定：CH0設定0					*/
/*--------------------------------------------------------------------------------------------------*/
	VULONG	AREG_SETREG3;			/* 0x0080 回生機能設定レジスタ									*/
	VULONG	AREG_SEPGSET01;			/* 0x0084 シリアルエンコーダIF設定：CH0設定1					*/
	VULONG	AREG_SEPGSET10;			/* 0x0088 シリアルエンコーダIF設定：CH1設定0					*/
	VULONG	AREG_SEPGSET11;			/* 0x008C シリアルエンコーダIF設定：CH1設定1					*/
	VULONG	SPARE4;					/* 0x0090 Reserve												*/
	VULONG	AREG_FCCSET;			/* 0x0094 指令フィルタ設定レジスタ								*/
	VULONG	AREG_T_FLC;				/* 0x0098 フルクローズドカウンタ設定							*/
	VULONG	AREG_ESYNC;				/* 0x009C シリアルエンコーダ同期カウンタ外部同期				*/
	VULONG	AREG_SE0_TXD01;			/* 0x00A0 シリアルエンコーダCH0送信データ0,1					*/
	VULONG	AREG_SE0_TXD23;			/* 0x00A4 シリアルエンコーダCH0送信データ2,3					*/
	VULONG	AREG_SE0_TXD45;			/* 0x00A8 シリアルエンコーダCH0送信データ4,5					*/
	VULONG	AREG_SE0_TXD67;			/* 0x00AC シリアルエンコーダCH0送信データ6,7					*/
	VULONG	AREG_SE0_RXD01;			/* 0x00B0 シリアルエンコーダCH0受信データ0,1					*/
	VULONG	AREG_SE0_RXD23;			/* 0x00B4 シリアルエンコーダCH0受信データ2,3					*/
	VULONG	AREG_SE0_RXD45;			/* 0x00B8 シリアルエンコーダCH0受信データ4,5					*/
	VULONG	AREG_SE0_RXD67;			/* 0x00BC シリアルエンコーダCH0受信データ6,7					*/
/*--------------------------------------------------------------------------------------------------*/
	VULONG	SPARE5[8];				/* 0x00C0-0x00DC Reserve										*/
	VULONG	AREG_GSSRD;				/* 0x00E0 汎用同期シリアル受信データ							*/
	VULONG	SPARE6;					/* 0x00E4 Reserve												*/
	VULONG	AREG_CMDCLML;			/* 0x00E8 指令カウンタCMLラッチ値								*/
	VULONG	AREG_SPRGCMD0;			/* 0x00EC SENC：CH0コマンド/レスポンスバッファ					*/
	VULONG	AREG_CDLTD;				/* 0x00F0 シリアルエンコーダCH0カウンタラッチ値					*/
	VULONG	AREG_CMDLDL;			/* 0x00F4 指令カウンタロードラッチ値							*/
	VULONG	AREG_SPRGCMD1;			/* 0x00F8 SENC：CH1コマンド/レスポンスバッファ					*/
	VULONG	AREG_SEDLLD;			/* 0x00FC シリアルエンコーダ遅延同期ロード値					*/
/*--------------------------------------------------------------------------------------------------*/
	VULONG	SPARE7[2];				/* 0x0100-0x0104 Reserve										*/
	VULONG	AREG_TSTEELWL;			/* 0x0108 EEPROM IF Lowワード値(テスト用)						*/
	VULONG	AREG_TSTDCCNT;			/* 0x010C 分周DDA現在値											*/
	VULONG	AREG_TSTT1CNT;			/* 0x0110 タイマT1値(テスト用)									*/
	VULONG	SPARE8;					/* 0x0114 Reserve												*/
	VULONG	AREG_TSTPWMUCNT;		/* 0x0118 PWMUカウンタ下位8ビット値(テスト用)					*/
	VULONG	AREG_TSTPWMVCNT;		/* 0x011C PWMVカウンタ下位8ビット値(テスト用)					*/
	VULONG	AREG_SDMCONF1;			/* 0x0120 デシメーションフィルタ設定							*/
	VULONG	AREG_SDMCONF2;			/* 0x0124 オーバレンジ検出マスクビット設定、試験設定			*/
	VULONG	AREG_PWMCCD;			/* 0x0128 PWMキャリアカウンタ現在値								*/
	VULONG	SPARE9;					/* 0x012C Reserve												*/
	VULONG	AREG_DYSETUP;			/* 0x0130 U相P側オンディレイ時間設定							*/
	VULONG	AREG_DYSETUN;			/* 0x0134 U相N側オンディレイ時間設定							*/
	VULONG	AREG_DYSETVP;			/* 0x0138 V相P側オンディレイ時間設定							*/
	VULONG	AREG_DYSETVN;			/* 0x013C V相N側オンディレイ時間設定							*/
/*--------------------------------------------------------------------------------------------------*/
	VULONG	AREG_DYSETWP;			/* 0x0140 W相P側オンディレイ時間設定							*/
	VULONG	AREG_DYSETWN;			/* 0x0144 W相N側オンディレイ時間設定							*/
	VULONG	SPARE10[2];				/* 0x0148-0x014C Reserve										*/
	VULONG	AREG_ZDR;				/* 0x0150 パルス変換原点補正設定								*/
	VULONG	AREG_ZENBR;				/* 0x0154 原点通過ビット位置設定								*/
	VULONG	AREG_DIVHSR;			/* 0x0158 分周回路ヒステリシス設定								*/
	VULONG	SPARE11;				/* 0x015C Reserve												*/
	VULONG	AREG_PUMPON;			/* 0x0160 チャージポンプ設定									*/
	VULONG	AREG_DIVSET;			/* 0x0164 分周機能設定											*/
	VULONG	AREG_PLSET;				/* 0x0168 パルス変換設定										*/
	VULONG	AREG_WDT1SET;			/* 0x016C 演算部用WDT設定										*/
	VULONG	AREG_POSET0;			/* 0x0170 シリアルPG-パルス変換位置設定							*/
	VULONG	AREG_POSET1;			/* 0x0174 シリアルPG-パルス変換原点補正1						*/
	VULONG	AREG_POSET2;			/* 0x0178 シリアルPG-パルス変換原点補正2						*/
	VULONG	AREG_POTEST;			/* 0x017C シリアルPG-パルス変換設定L(テスト用)					*/
/*--------------------------------------------------------------------------------------------------*/
	VULONG	AREG_POSET0H;			/* 0x0180 シリアルPG-パルス変換位置設定bit16-23					*/
	VULONG	SPARE12;				/* 0x0184 Reserve												*/
	VULONG	AREG_POSET12H;			/* 0x0188 シリアルPG-パルス変換原点補正H						*/
	VULONG	AREG_WDT2SET;			/* 0x018C ホスト用WDT設定										*/
	VULONG	AREG_DCTRIM;			/* 0x0190 分周出力原点補正設定(Bit0-15)							*/
	VULONG	AREG_ADSET1;			/* 0x0194 AD設定												*/
	VULONG	AREG_ADSET2;			/* 0x0198 指令AD設定：基本クロック								*/
	VULONG	AREG_ADSET3;			/* 0x019C 指令AD設定：IFサイクル								*/
	VULONG	AREG_ADSET4;			/* 0x01A0 指令AD設定：ラッチタイミング							*/
	VULONG	AREG_ADSET5;			/* 0x01A4 指令AD設定：コントロールCH0							*/
	VULONG	AREG_ADSET6;			/* 0x01A8 指令AD設定：コントロールCH1							*/
	VULONG	AREG_ADSYNC;			/* 0x01AC 指令ADサイクル同期									*/
	VULONG	AREG_ADFCNT1;			/* 0x01B0 電流AD設定：基本クロック								*/
	VULONG	AREG_ADFCNT2;			/* 0x01B4 電流AD設定：IFサイクル								*/
	VULONG	AREG_ADFCNT3;			/* 0x01B8 電流AD設定：ラッチタイミング							*/
	VULONG	AREG_ADFCNT4;			/* 0x01BC 電流AD設定：コントロールCH0							*/
/*--------------------------------------------------------------------------------------------------*/
	VULONG	AREG_ADFCNT5;			/* 0x01C0 電流AD設定：コントロールCH1							*/
	VULONG	AREG_ADFSYNC;			/* 0x01C4 電流ADサイクル同期									*/
	VULONG	AREG_INT0SET;			/* 0x01C8 INT0割込み設定										*/
	VULONG	AREG_ACULH;				/* 0x01CC 指令AD：CH0ラッチデータ(Bit16-23)						*/
	VULONG	AREG_INT0TRG;			/* 0x01D0 INT0割込み同期ポート/カウンタ値読出し					*/
	VULONG	AREG_DCNTV;				/* 0x01D4 分周カウンタ設定値(Bit0-15)							*/
	VULONG	AREG_ACUL;				/* 0x01D8 指令AD：CH0ラッチデータ								*/
	VULONG	AREG_ACVL;				/* 0x01DC 指令AD：CH1ラッチデータ(Bit0-15)						*/
	VULONG	AREG_AFUL;				/* 0x01E0 電流AD：U相電流ラッチデータ							*/
	VULONG	AREG_AFVL;				/* 0x01E4 電流AD：V相電流ラッチデータ							*/
	VULONG	AREG_CMDAD1;			/* 0x01E8 指令ADデータ1(テスト用)								*/
	VULONG	AREG_CMDAD2;			/* 0x01EC 指令ADデータ2(テスト用)								*/
	VULONG	AREG_CURAD1;			/* 0x01F0 電流ADデータ1(テスト用)								*/
	VULONG	AREG_CURAD2;			/* 0x01F4 電流ADデータ2(テスト用)								*/
	VULONG	AREG_DDACT;				/* 0x01F8 シリアルPG-パルス変換DDA値(テスト用)					*/
	VULONG	AREG_ACVLH;				/* 0x01FC 指令AD：CH1ラッチデータ(Bit16-23)						*/
/*--------------------------------------------------------------------------------------------------*/
	VULONG	AREG_STIMLT5;			/* 0x0200 ラッチタイマラッチ値1d								*/
	VULONG	AREG_STIMLT6;			/* 0x0204 ラッチタイマラッチ値2d								*/
	VULONG	AREG_STIMLT7;			/* 0x0208 ラッチタイマラッチ値3d								*/
	VULONG	AREG_STIMLT8;			/* 0x020C エンコーダ読込み時のタイマラッチ値					*/
	VULONG	AREG_SFBLT0;			/* 0x0210 CA端子立ち上がり時のフィードバック位置				*/
	VULONG	AREG_SFBLT1;			/* 0x0214 CA端子立ち下がり時のフィードバック位置				*/
	VULONG	AREG_SFBLT2;			/* 0x0218 CB端子立ち上がり時のフィードバック位置				*/
	VULONG	AREG_SFBLT3;			/* 0x021C CB端子立ち下がり時のフィードバック位置				*/
	VULONG	AREG_SFBLT4;			/* 0x0220 CC端子立ち上がり時のフィードバック位置				*/
	VULONG	AREG_SFBLT5;			/* 0x0224 CC端子立ち下がり時のフィードバック位置				*/
	VULONG	SPARE13;				/* 0x0228 Reserve												*/
	VULONG	AREG_OCDCONF1;			/* 0x022C OC検出デシメーションフィルタ動作モード設定			*/
	VULONG	AREG_OCLVUP;			/* 0x0230 U相上限OC検出レベル									*/
	VULONG	AREG_TIM;				/* 0x0234 ラッチタイマ現在値									*/
	VULONG	AREG_OCLVUM;			/* 0x0238 U相下限OC検出レベル									*/
	VULONG	AREG_OCLVVP;			/* 0x023C V相上限OC検出レベル									*/
/*--------------------------------------------------------------------------------------------------*/
	VULONG	AREG_NCTCSET;			/* 0x0240 指令用NCT設定											*/
	VULONG	AREG_AFULH;				/* 0x0244 電流AD：CH0ラッチデータ(Bit16-23)						*/
	VULONG	AREG_AFVLH;				/* 0x0248 電流AD：CH1ラッチデータ(Bit16-23)						*/
	VULONG	AREG_ACMC4;				/* 0x024C 指令マルチプレクサチャネル4							*/
	VULONG	AREG_NCTCTM;			/* 0x0250 指令用NCT：タイマカウンタ値							*/
	VULONG	AREG_NCTCFB;			/* 0x0254 指令用NCT：FBカウンタ値								*/
	VULONG	AREG_NCTCCD;			/* 0x0258 指令用NCT：CDカウンタ値								*/
	VULONG	AREG_NCTCTP;			/* 0x025C 指令用NCT：TPカウンタ値								*/
	VULONG	AREG_POTESTH;			/* 0x0260 シリアルPG-パルス変換設定H(テスト用)					*/
	VULONG	AREG_HINT1;				/* 0x0264 演算部割込みポート1									*/
	VULONG	AREG_HINT2;				/* 0x0268 演算部割込みポート2									*/
	VULONG	AREG_ACMC5;				/* 0x026C 指令マルチプレクサチャネル5							*/
	VULONG	AREG_SRESET;			/* 0x0270 ソフトリセット										*/
	VULONG	AREG_NCTRSTL;			/* 0x0274 NCTリセット											*/
	VULONG	AREG_ACMC6;				/* 0x0278 指令マルチプレクサチャネル6							*/
	VULONG	AREG_ACMC7;				/* 0x027C 指令マルチプレクサチャネル7							*/
/*--------------------------------------------------------------------------------------------------*/
	VULONG	AREG_SE1_TXD01;			/* 0x0280 シリアルエンコーダCH1送信データ0,1					*/
	VULONG	AREG_SE1_TXD23;			/* 0x0284 シリアルエンコーダCH1送信データ2,3					*/
	VULONG	AREG_SE1_TXD45;			/* 0x0288 シリアルエンコーダCH1送信データ4,5					*/
	VULONG	AREG_SE1_TXD67;			/* 0x028C シリアルエンコーダCH1送信データ6,7					*/
	VULONG	AREG_SE1_RXD01;			/* 0x0290 シリアルエンコーダCH1受信データ0,1					*/
	VULONG	AREG_SE1_RXD23;			/* 0x0294 シリアルエンコーダCH1受信データ2,3					*/
	VULONG	AREG_SE1_RXD45;			/* 0x0298 シリアルエンコーダCH1受信データ4,5					*/
	VULONG	AREG_SE1_RXD67;			/* 0x029C シリアルエンコーダCH1受信データ6,7					*/
	VULONG	AREG_OCSDMCONF3;		/* 0x02A0 OC検出設定3											*/
	VULONG	AREG_OCSDMCONF4;		/* 0x02A4 OC検出設定4											*/
	VULONG	AREG_OCVADSYNC;			/* 0x02A8 OC検出用ADサイクル同期（データ任意）					*/
	VULONG	AREG_OCADU;				/* 0x02AC OC検出用U相ADデータ									*/
	VULONG	AREG_OCADV;				/* 0x02B0 OC検出用V相ADデータ									*/
	VULONG	AREG_OCADW;				/* 0x02B4 OC検出用W相ADデータ									*/
	VULONG	SPARE14[2];				/* 0x02B8-0x02BC Reserve										*/
/*--------------------------------------------------------------------------------------------------*/
	VULONG	AREG_STIMLT0;			/* 0x02C0 ラッチタイマラッチ値0									*/
	VULONG	AREG_STIMLT1;			/* 0x02C4 ラッチタイマラッチ値1									*/
	VULONG	AREG_STIMLT2;			/* 0x02C8 ラッチタイマラッチ値2									*/
	VULONG	AREG_STIMLT3;			/* 0x02CC ラッチタイマラッチ値3									*/
	VULONG	AREG_STIMLT4;			/* 0x02D0 ラッチタイマラッチ値4									*/
	VULONG	AREG_STIMSTAT;			/* 0x02D4 ラッチタイマ設定										*/
	VULONG	AREG_ENCOFS;			/* 0x02D8 フィードバック位置補正値(符号付)						*/
	VULONG	AREG_STCLRLT;			/* 0x02DC ラッチステータスのクリア条件							*/
	VULONG	AREG_SADAT_A;			/* 0x02E0 エンコーダADデータA									*/
	VULONG	AREG_SADAT_AA;			/* 0x02E4 エンコーダADデータAA									*/
	VULONG	AREG_SADAT_B;			/* 0x02E8 エンコーダADデータB									*/
	VULONG	AREG_SADAT_BB;			/* 0x02EC エンコーダADデータBB									*/
	VULONG	AREG_EIFSET1;			/* 0x02F0 エンコーダADIF設定1									*/
	VULONG	AREG_EIFSET2;			/* 0x02F4 エンコーダADIF設定2									*/
	VULONG	AREG_SRCNT0;			/* 0x02F8 シリアルエンコーダIF0伝送周期設定						*/
	VULONG	AREG_SRCNT1;			/* 0x02FC シリアルエンコーダIF1伝送周期設定						*/
/*--------------------------------------------------------------------------------------------------*/
	VULONG	AREG_FBZRND;			/* 0x0300 フィードバックカウンタZRNラッチデータ					*/
	VULONG	AREG_FBCLT;				/* 0x0304 フィードバックカウンタロードラッチデータ				*/
	VULONG	AREG_FBPUD;				/* 0x0308 フィードバックカウンタPUラッチデータ					*/
	VULONG	AREG_FBPCD;				/* 0x030C フィードバックカウンタPCラッチデータ					*/
	VULONG	AREG_TCNT;				/* 0x0310 フィードバックタイマ現在値							*/
	VULONG	AREG_T1LT;				/* 0x0314 フィードバックタイマA/Bパルスラッチ値					*/
	VULONG	AREG_T2LT;				/* 0x0318 フィードバックタイマキャリアラッチ値					*/
	VULONG	AREG_T3LT;				/* 0x031C フィードバックタイマT1直前値ラッチ値					*/
	VULONG	AREG_FCCFZRNL;			/* 0x0320 フルクローズドカウンタZRNラッチデータ					*/
	VULONG	AREG_FCLDL;				/* 0x0324 フルクローズドカウンタロードラッチデータ				*/
	VULONG	AREG_DCTRIMH;			/* 0x0328 分周出力原点補正設定(Bit16-23)						*/
	VULONG	AREG_DCNTVH;			/* 0x032C 分周カウンタ設定値(Bit16-23)							*/
	VULONG	AREG_OCLVVM;			/* 0x0330 V相負値OC検出レベル									*/
	VULONG	AREG_OCLVWP;			/* 0x0334 W相正値OC検出レベル									*/
	VULONG	AREG_OCLVWM;			/* 0x0338 W相負値OC検出レベル									*/
	VULONG	AREG_FLTRANGE;			/* 0x033C OCアラームフィルタ回数設定							*/
/*--------------------------------------------------------------------------------------------------*/
	VULONG	AREG_SDMCONF3;			/* 0x0340 デシメーションフィルタ設定3							*/
	VULONG	AREG_SDMCONF4;			/* 0x0344 デシメーションフィルタ設定4							*/
	VULONG	AREG_VADSYNC;			/* 0x0348 電圧検出用ADサイクル同期(レジスタ書き込み同期)		*/
	VULONG	AREG_AVL;				/* 0x034C 電圧検出用ADラッチデータ								*/
	VULONG	AREG_VAD;				/* 0x0350 電圧検出用ADデータ									*/
	VULONG	SPARE15;				/* 0x0354 Reserve												*/
	VULONG	AREG_SETMSK;			/* 0x0358 マスク設定およびO2CDAT								*/
	VULONG	AREG_DMASET;			/* 0x035C DMA設定												*/
	VULONG	AREG_ENCTXDLY0;			/* 0x0360 エンコーダch0送信開始遅延時間設定						*/
	VULONG	AREG_ENCTXDLY1;			/* 0x0364 エンコーダch1送信開始遅延時間設定						*/
	VULONG	AREG_ENCRDDLY0;			/* 0x0368 エンコーダ位置補正開始ch0遅延時間設定					*/
	VULONG	AREG_ENCRDDLY1;			/* 0x036C エンコーダ位置補正開始ch1遅延時間設定					*/
	VULONG	AREG_INTASET;			/* 0x0370 ScanA割込み設定										*/
	VULONG	AREG_INTBSET;			/* 0x0374 ScanB割込み設定										*/
	VULONG	AREG_INTCSET;			/* 0x0378 ScanC割込み設定										*/
	VULONG	AREG_INTNSET;			/* 0x037C ScanN割込み設定										*/
/*--------------------------------------------------------------------------------------------------*/
	VULONG	AREG_INTCYCLE;			/* 0x0380 割込み周期設定										*/
	VULONG	AREG_INTMPESET;			/* 0x0384 マイクロエンコーダ処理割込み設定						*/
	VULONG	AREG_INTSET;			/* 0x0388 割込み設定											*/
	VULONG	SPARE16;				/* 0x038C Reserve												*/
	VULONG	AREG_ENCFLAG;			/* 0x0390 エンコーダ補正設定およびアラーム						*/
	VULONG	AREG_PGDCAL;			/* 0x0394 位置データ関連設定									*/
	VULONG	AREG_PULSENO;			/* 0x0398 1回転エンコーダパルス数設定							*/
	VULONG	SPARE17;				/* 0x039C Reserve												*/
	VULONG	AREG_ACCERRLVL;			/* 0x03A0 加速度エラーレベル設定								*/
	VULONG	SPARE18;				/* 0x03A4 Reserve												*/
	VULONG	AREG_SPGFAIL;			/* 0x03A8 累計エラーレベル設定									*/
	VULONG	AREG_LCHCLKNUM;			/* 0x03AC ラッチ周期中クロック数設定							*/
	VULONG	AREG_SACLKNUM;			/* 0x03B0 演算周期中クロック数設定								*/
	VULONG	AREG_BASTIM;			/* 0x03B4 ベースタイマ値ロードラッチデータ						*/
	VULONG	AREG_LASTBASTIM;		/* 0x03B8 前回ベースタイマ値ロードラッチデータ					*/
	VULONG	AREG_HENKAITITIM;		/* 0x03BC 変化位置タイマ値ロードラッチデータ					*/
/*--------------------------------------------------------------------------------------------------*/
	VULONG	SPARE19;				/* 0x03C0 Reserve												*/
	VULONG	AREG_COMERRCNT;			/* 0x03C4 通信エラーカウンタ値ロードラッチデータ				*/
	VULONG	AREG_ACCERRCNT;			/* 0x03C8 加速度エラーカウンタ値ロードラッチデータ				*/
	VULONG	AREG_RSTSET;			/* 0x03CC リセット/セット設定									*/
	VULONG	AREG_SPGRXF;			/* 0x03D0 受信フラグ設定										*/
	VULONG	AREG_SPGD12;			/* 0x03D4 エンコーダ受信データ設定								*/
	VULONG	AREG_SPGD34;			/* 0x03D8 エンコーダ受信データ設定								*/
	VULONG	AREG_SPGD5;				/* 0x03DC エンコーダ受信データ設定								*/
	VULONG	AREG_CURMOTPOS;			/* 0x03E0 補正後位置データ レジスタラッチデータ					*/
	VULONG	AREG_LSTMOTPOS;			/* 0x03E4 前回の補正後位置データ レジスタラッチデータ			*/
	VULONG	AREG_CURRCVPOS;			/* 0x03E8 補正無し位置データ レジスタラッチデータ				*/
	VULONG	AREG_LSTRCVPOS;			/* 0x03EC 前回の補正無し位置データ レジスタラッチデータ			*/
	VULONG	AREG_CURRXPOS0_L;		/* 0x03F0 受信データ レジスタラッチデータ Lo					*/
	VULONG	AREG_CURRXPOS0_H;		/* 0x03F4 受信データ レジスタラッチデータ Hi					*/
	VULONG	AREG_LSTRXPOS0_L;		/* 0x03F8 前回の受信データ レジスタラッチデータ Lo				*/
	VULONG	AREG_LSTRXPOS0_H;		/* 0x03FC 前回の受信データ レジスタラッチデータ Hi				*/
/*--------------------------------------------------------------------------------------------------*/
	VULONG	MREG_UPLDA;				/* 0x0400 ASIC MicroPrg Load Pointer							*/
	VULONG	MREG_UPLD;				/* 0x0404 ASIC MicroPrg Load Buffer								*/
	VULONG	MREG_CTSTW;				/* 0x0408 制御status(READ-ONLY)									*/
	VULONG	MREG_CTSTR;				/* 0x040C 制御cmdport(WRITE-ONLY)								*/
	VULONG	MREG_HSUR;				/* 0x0410 ホスト指令ポート(WRITE-ONLY)							*/
} ASIC_HW_IF_STR;
/*--------------------------------------------------------------------------------------------------*/



/****************************************************************************************************/
/*																									*/
/*		ASIC JL-086 SERVOIP μプログラムレジスタ構造体定義											*/
/*																									*/
/****************************************************************************************************/
/*--------------------------------------------------------------------------------------------------*/
/*		Axis information register																	*/
/*--------------------------------------------------------------------------------------------------*/
typedef struct _AXIS_INFO {
	LONG	AxisNum;			/* 0xC0007000 : 制御軸数											*/
} AXIS_INFO;

/*--------------------------------------------------------------------------------------------------*/
/*		32 bit registers																			*/
