#ifndef _FN_PRG_JOG_H
#define _FN_PRG_JOG_H
/****************************************************************************
Description	: Fn Program JOG
----------------------------------------------------------------------------
Author        : Yaskawa Electric Corp., 
				Copyright (c) 2010 All Rights Reserved

Project       : INGRAM

----------------------------------------------------------------------------
Changes		:
Name   Date          Description
------------------------------------------------------------------------
T.Kira  2011.02.18    created

*****************************************************************************/
#include "Basedef.h"
#include "SystemSetting.h"
#include "BaseCmnStruct.h"

/****************************************************************************************/
/*																						*/
/*		プログラムJOG運転 Fn用データ定義												*/
/*																						*/
/****************************************************************************************/
/*--------------------------------------------------------------------------------------*/
/*		プログラムJOG運転ステータス定義													*/
/*--------------------------------------------------------------------------------------*/
#define	PJOG_INIT	0x00				/* イニシャル状態								*/
#define	PJOG_ABORT	0x10				/* 中断状態										*/
#define	PJOG_START	0x01				/* 運転状態										*/
#define	PJOG_AFTER	0x11				/* 運転後処理状態								*/
#define	PJOG_END	0x02				/* 終了状態										*/
#define	PJOG_ERROR	0x03				/* 異常終了										*/
/*--------------------------------------------------------------------------------------*/
/*		プログラムJOG運転コマンド定義													*/
/*--------------------------------------------------------------------------------------*/
#define	PJOGCMD_NONE	0x00			/* コマンドなし									*/
#define	PJOGCMD_INIT	0x01			/* イニシャライズ								*/
#define	PJOGCMD_ABORT	0x02			/* 中断											*/
#define	PJOGCMD_START	0x03			/* 運転											*/

#define		LMTLOWSPEED	10
/*--------------------------------------------------------------------------------------*/
/*		プログラムJOG運転関連関数定義													*/
/*--------------------------------------------------------------------------------------*/
void PcalPjogSw( void *Axis );			/* Pn530 : プログラムJOG運転関係スイッチ		*/
void PcalPjogDistance( void *Axis );	/* Pn531,532 : プログラムJOG移動距離[指令単位]	*/
void PcalPjogRotspd( void *Axis );		/* Pn533 : プログラムJOG移動速度[min-1]			*/
void PcalPjogAcctime( void *Axis );		/* Pn534 : プログラムJOG加減速時間[ms]			*/
void PcalPjogWaitTime( void *Axis );	/* Pn535 : プログラムJOG待ち時間[ms]			*/
void PcalPjogNum( void *Axis );			/* Pn536 : プログラムJOG移動回数				*/


#endif //_FN_PRG_JOG_H 
/***************************************** end of file **********************************/
