/****************************************************************************************************/
/*																									*/
/*																									*/
/*		UsbMsgIf.c : USB function Server	 														*/
/*																									*/
/*																									*/
/****************************************************************************************************/
/*																									*/
/*	機 能 : USB通信のメッセージ送受信の管理を行う。													*/
/*																									*/
/*			1) ＵＳＢ通信指令メッセージを受信しする。												*/
/*			2) ＵＳＢ通信指令メッセージ受信確認にて、受信完了通知を行う。							*/
/*			3) ＵＳＢ通信応答メッセージ送信開始要求にて、応答の送信を開始する。						*/
/*			4) 送受信監視シーケンスにて、シリアル通信データの受信と送信の制御を行う。				*/
/*																									*/
/*																									*/
/*	補 足 : (Jupiter)UsbMsgIf.c + (Ingram)UsbFunctionIF.c => UsbMsgIf								*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/************** Copyright (C) Yaskawa Electric Corporation ******************************************/
/*																									*/
/*		Rev.1.00 : 2005.10.17  K.Ando																*/
/*		Rev.1.10 : 2008.05.21  T.Taniguchi															*/
/*		Rev.1.20 : 2013.07.04  K.Ozaki																*/
/*																									*/
/*																									*/
/****************************************************************************************************/
/*																									*/
/* Author        : Yaskawa Electric Corp.,															*/
/* Project       : Mercury																			*/
/* Functions	 :																					*/
/*																									*/
/**** APIs ******************************************************************************************/
/* 																									*/
/**** Locals ****************************************************************************************/
/*																									*/
/****************************************************************************************************/
#include "KnlApi.h"											/* Kernel API */
//<S146>#include "arm.h"
#ifndef	_MERCURY_PLATFORM_			/*<S190>*/
#include "UsbFunctionIF.h"
#endif	/*_MERCURY_PLATFORM_*/
#include "usb_f.h"

#ifdef	_MERCURY_PLATFORM_			/*<S190>*/
#ifndef NULL
	#define NULL 0
#endif
const UCHAR	MsgReadSvSerial[] = {0x01,0x40,0x00,0x03,0xc8,0x08,0x00,0x08,0x3a,0x67};
#define	LEN_MSGREADSVSERIAL		sizeof(MsgReadSvSerial)
const UCHAR	ResReadSvSerial[] = {0x01,0x40,0x00,0x03,0x00,0x08,0x30,0x00,0x30,0x00,0x30,0x00,0x30,0x00,0x30,0x00,0x30,0x00,0x30,0x00,0x30,0x00,0x7f,0xfa};
#define	LEN_RESREADSVSERIAL		sizeof(ResReadSvSerial)
const UCHAR	MsgReadMaxRegSizeA[] = {0x01,0x40,0x00,0x41,0x00,0x03,0x10,0x10};
#define	LEN_MSGREADMAXREGSIZEA	sizeof(MsgReadMaxRegSizeA)
const UCHAR	ResReadMaxRegSizeA[] = {0x01,0x40,0x00,0x41,0x00,0x03,0x00,0x1b,0x4c,0x07};
#define	LEN_RESREADMAXREGSIZEA	sizeof(ResReadMaxRegSizeA)
const UCHAR	MsgReadMaxRegSizeB[] = {0x01,0x40,0x00,0x41,0x00,0x0d,0x91,0xd4};
#define	LEN_MSGREADMAXREGSIZEB	sizeof(MsgReadMaxRegSizeB)
const UCHAR	ResReadMaxRegSizeB[] = {0x01,0x40,0x00,0x41,0x00,0x0d,0x00,0x1b,0x2d,0xc4};
#define	LEN_RESREADMAXREGSIZEB	sizeof(ResReadMaxRegSizeB)
const UCHAR	MsgReadMaxRegSizeC[] = {0x01,0x40,0x00,0x41,0x00,0x10,0x51,0xdd};
#define	LEN_MSGREADMAXREGSIZEC	sizeof(MsgReadMaxRegSizeC)
const UCHAR	ResReadMaxRegSizeC[] = {0x01,0x40,0x00,0x41,0x00,0x10,0x00,0x15,0x3c,0x06};
#define	LEN_RESREADMAXREGSIZEC	sizeof(ResReadMaxRegSizeC)
const UCHAR	MsgReadMaxRegSizeD[] = {0x01,0x40,0x00,0x41,0x00,0x0e,0xd1,0xd5};
#define	LEN_MSGREADMAXREGSIZED	sizeof(MsgReadMaxRegSizeD)
const UCHAR	ResReadMaxRegSizeD[] = {0x01,0x40,0x00,0x41,0x00,0x0e,0x00,0x17,0xdd,0xc1};
#define	LEN_RESREADMAXREGSIZED	sizeof(ResReadMaxRegSizeD)
#endif	/*_MERCURY_PLATFORM_*/

/****************************************************************************************************/
/*																									*/
/*		Function Prototypes																			*/
/*																									*/
/****************************************************************************************************/
/*--------------------------------------------------------------------------------------------------*/
/*		Kpx Functions																				*/
/*--------------------------------------------------------------------------------------------------*/
void	KpxInitUsbMsgIf(						/* ＵＳＢ通信メッセージＩＦ初期化					*/
		LONG	DriveID,						/* ドライブ機種ＩＤ									*/
		LONG	ComAddr,						/* 通信アドレス										*/
		LONG	AxisNumber						/* 多軸ドライブ軸数(0/1/2/...)						*/
		);
/*--------------------------------------------------------------------------------------------------*/
void	KpxSetUsbComAddr(						/* ＵＳＢ通信アドレス設定処理						*/
		LONG	ComAddr,						/* 通信アドレス										*/
		LONG	AxisNumber	);					/* 多軸ドライブ軸数(0/1/2/...)						*/
/*--------------------------------------------------------------------------------------------------*/
//<S150>宣言移動 void	KpxUsbMsgManager( void );				/* ＵＳＢ通信メッセージ送受信監視					*/
/*--------------------------------------------------------------------------------------------------*/
/*		Kpi Functions																				*/
/*--------------------------------------------------------------------------------------------------*/
void	KriInitUsbHmsg(							/* ＵＳＢ通信Hmsg初期化処理							*/
		HMSGIF	Hmsg		);					/* メッセージＩＦハンドル(ポインタ)					*/
/*--------------------------------------------------------------------------------------------------*/
void	KriUsbMsgManager( CSIF *this );			/* ＵＳＢ通信メッセージ送受信監視					*/
/*--------------------------------------------------------------------------------------------------*/
LONG	KriCheckRxUsbMsg(						/* ＵＳＢ通信指令メッセージ受信チェック				*/
		struct _CSIF *this,						/* this pointer										*/
		USHORT* pCmdMsgLen	);					/* 指令メッセージ長格納先ポインタ					*/
/*--------------------------------------------------------------------------------------------------*/
LONG	KriStartTxUsbMsg(						/* ＵＳＢ通信応答メッセージ送信開始指令				*/
		struct _CSIF *this,						/* this pointer										*/
		UCHAR*	TxBuf,							/* 送信データバッファ								*/
		LONG	TxSize		);					/* 送信データサイズ(ByteSize,無応答時はゼロ)		*/
/*--------------------------------------------------------------------------------------------------*/
/*		Local Functions																				*/
/*--------------------------------------------------------------------------------------------------*/
UCHAR	LpxUsbChkRxMessage( CSIF *this );		/* 受信メッセージチェック							*/

/****************************************************************************************************/
/*																									*/
/*		ＵＳＢハードウェアＩＦ関数一覧																*/
/*																									*/
/****************************************************************************************************/
/*--------------------------------------------------------------------------------------------------*/
/*		初期化処理																					*/
/*--------------------------------------------------------------------------------------------------*/
/*--------------------------------------------------------------------------------------------------*/
/*		スキャン処理／割込み処理																	*/
/*--------------------------------------------------------------------------------------------------*/
//void	DpiUsbConnectSequence( void );			/* ＵＳＢ　接続－切断処理シーケンス					*/
/*--------------------------------------------------------------------------------------------------*/


/****************************************************************************************************/
/*																									*/
/*		Variable Definition																			*/
/*																									*/
/****************************************************************************************************/
/*--------------------------------------------------------------------------------------------------*/
/*		Local Parameter Structure Definition														*/
/*--------------------------------------------------------------------------------------------------*/
typedef	struct {							/*														*/
	USHORT	DriveID;						/* ドライブ機種ＩＤ										*/
	UCHAR	ComAddr;						/* 通信アドレス(自局Addr)								*/
	UCHAR	AxisNum;						/* 多軸ドライブ軸数										*/
	UCHAR	AxisAddrBgn;					/* 多軸ドライブ先頭軸アドレス							*/
	UCHAR	AxisAddrEnd;					/* 多軸ドライブ最終軸アドレス							*/
} MUSBP;
/*--------------------------------------------------------------------------------------------------*/
/*		Local Variables Structure Definition														*/
/*--------------------------------------------------------------------------------------------------*/
typedef	struct {							/*														*/
#ifndef	_MERCURY_PLATFORM_			/*<S190>*/
	UCHAR	RxBuf[MSG_MAXBUFSZB];			/* 受信データバッファ									*/
	UCHAR	TxBuf[MSG_MAXBUFSZB];			/* 送信データバッファ									*/
#else	/*_MERCURY_PLATFORM_*/
	UCHAR	RxBuf[512];			/* 受信データバッファ									*/
	UCHAR	TxBuf[512];			/* 送信データバッファ									*/
#endif	/*_MERCURY_PLATFORM_*/
} MUSBV;
/*--------------------------------------------------------------------------------------------------*/
#define	REQSTX_NONE			0x00			/* 指令なし												*/
#define	REQSTX_STARTTX		0x01			/* 応答送信開始指令										*/
#define	REQSTX_NORESPONSE	0x02			/* 無応答指令(MsgErr)									*/
/*--------------------------------------------------------------------------------------------------*/
MUSBP	MusbP;								/* Local Parameter for USB Message						*/
MUSBV	MusbV;								/* Local Variables for USB Message						*/
/*--------------------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------------------*/
#ifndef	_MERCURY_PLATFORM_			/*<S190>*/
CSIF		USif[USBIF_N_CH];				/* USB Interface Instance								*/
#else	/*_MERCURY_PLATFORM_*/
CSIF		USif[1];				/* USB Interface Instance								*/
#endif	/*_MERCURY_PLATFORM_*/

/****************************************************************************************************/
/*																									*/
/*		Macro Definition																			*/
/*																									*/
/****************************************************************************************************/
/*--------------------------------------------------------------------------------------------------*/
/*		Error Code Definition																		*/
/*--------------------------------------------------------------------------------------------------*/
#define	USBERR_RXTMOVER		0x01				/* 受信タイムオーバ									*/
#define	USBERR_USERERR		0x10				/* ユーザエラー(無応答)								*/
#define	USBERR_OTHERERR		0xFF				/* その他エラー										*/
/*--------------------------------------------------------------------------------------------------*/
/*		Set Sif Error Macro																			*/
/*--------------------------------------------------------------------------------------------------*/
#define SET_USBERR( code )	{ this->ErrCod = code; ++(this->ErrCnt);}
/*--------------------------------------------------------------------------------------------------*/
/*		Message Buffer Size Definition																*/
/*--------------------------------------------------------------------------------------------------*/
#define USB_CMDBUF_SIZE		(sizeof( MusbV.RxBuf ) - 2)		/* Command  Message Buffer Size			*/
#define USB_RESBUF_SIZE		(sizeof( MusbV.TxBuf ) - 2)		/* Response Message Buffer Size			*/
/*--------------------------------------------------------------------------------------------------*/

/****************************************************************************************************/
/*																									*/
/*		ＵＳＢ通信メッセージＩＦ初期化																*/
/*																									*/
/****************************************************************************************************/
void	KpxInitUsbMsgIf( LONG DriveID, LONG ComAddr, LONG AxisNumber
				)
{
/*--------------------------------------------------------------------------------------------------*/
/*		ＵＳＢ通信ＩＦ初期化処理																	*/
/*--------------------------------------------------------------------------------------------------*/
		MlibResetByteMemory( &MusbV, sizeof(MusbV)/4 );		/* USBメッセージＩＦ用変数初期化		*/
/*--------------------------------------------------------------------------------------------------*/
/*		ＵＳＢ通信アドレス設定処理																	*/
/*--------------------------------------------------------------------------------------------------*/
		MusbP.DriveID = (USHORT)DriveID;					/* Set DriveID							*/
		KpxSetUsbComAddr( ComAddr, AxisNumber );			/* Set ComAddr, AxisNumber				*/
/*--------------------------------------------------------------------------------------------------*/
/*		ＵＳＢハードＩＦ初期化処理																	*/
/*--------------------------------------------------------------------------------------------------*/
		UsbFuncInitializeDriver( ComAddr );					/* USBハードＩＦ初期化					*/
/*--------------------------------------------------------------------------------------------------*/
/*--------------------------------------------------------------------------------------------------*/
	{
CSIF *pSif = &(USif[0]);
		MlibResetLongMemory( pSif, sizeof(CSIF)/4 );		/* USBメッセージＩＦ用変数初期化		*/
/*--------------------------------------------------------------------------------------------------*/
		pSif->Com = NULL;									/* 										*/
		pSif->AxisNumber = AxisNumber;						/* set axis number						*/
		pSif->DoRxTx = KriUsbMsgManager;					/* RxTx sequence						*/
		pSif->ChkCmd = KriCheckRxUsbMsg;					/* check receive cmd method				*/
		pSif->StxRes = KriStartTxUsbMsg;					/* start tx response method				*/
/*--------------------------------------------------------------------------------------------------*/
		pSif->RcvBufSize = USB_CMDBUF_SIZE;					/* rcv buf size */
		pSif->SndBufSize = USB_RESBUF_SIZE;					/* send buf size */
/*--------------------------------------------------------------------------------------------------*/
		pSif->RxBuf = MusbV.RxBuf;							/* set receive buffer					*/
		pSif->TxBuf = MusbV.TxBuf;							/* set send buffer						*/
	}
		return;
}


/****************************************************************************************************/
/*																									*/
/*		ＵＳＢ通信アドレス設定処理																	*/
/*																									*/
/****************************************************************************************************/
void	KpxSetUsbComAddr( LONG ComAddr, LONG AxisNumber )
{
/*--------------------------------------------------------------------------------------------------*/
/*		ＵＳＢ通信ＩＦパラメータ初期化																*/
/*--------------------------------------------------------------------------------------------------*/
		MusbP.ComAddr = (UCHAR)ComAddr;						/* Com Address							*/
		MusbP.AxisNum = (UCHAR)AxisNumber;					/* Multi-Axis Number					*/
/*--------------------------------------------------------------------------------------------------*/
		if( AxisNumber < 0 )								/* Disable USB							*/
		{
			MusbP.AxisAddrBgn = 0xFF;						/* Axis Addr Begin						*/
			MusbP.AxisAddrEnd = 0x00;						/* Axis Addr End						*/
		}
		else if( AxisNumber <= 0 )							/* For SGDV								*/
		{
			MusbP.AxisAddrBgn = (UCHAR)ComAddr;				/* Axis Addr Begin						*/
			MusbP.AxisAddrEnd = (UCHAR)ComAddr;				/* Axis Addr End						*/
		}
		else												/* For Jupiter							*/
		{
			MusbP.AxisAddrBgn = 1;							/* Axis Addr Begin						*/
			MusbP.AxisAddrEnd = (UCHAR)(AxisNumber);		/* Axis Addr End						*/
		}
/*--------------------------------------------------------------------------------------------------*/
		return;
}


/****************************************************************************************************/
/*																									*/
/*		ＵＳＢ通信Hmsg初期化処理																	*/
/*																									*/
/****************************************************************************************************/
void	KriInitUsbHmsg( HMSGIF Hmsg )
{
/*--------------------------------------------------------------------------------------------------*/
/*		Init Hmsg Data																				*/
/*--------------------------------------------------------------------------------------------------*/
//		Hmsg->CmdBuf = MusbV.RxBuf;
//		Hmsg->ResBuf = MusbV.TxBuf;
//		Hmsg->CmdBufSize = USB_CMDBUF_SIZE;
//		Hmsg->ResBufSize = USB_RESBUF_SIZE;
//		Hmsg->ChkCmdMsg  = KriCheckRxUsbMsg;
//		Hmsg->StxResMsg  = KriStartTxUsbMsg;
/*--------------------------------------------------------------------------------------------------*/
		return;
}


/****************************************************************************************************/
/*																									*/
/*		ＵＳＢ通信メッセージ定周期監視処理 ( ScanC Cycle )											*/
/*																									*/
/****************************************************************************************************/
void	KpxUsbMsgManager( void )
{
#ifndef	_MERCURY_PLATFORM_			/*<S190>*/
	if( USB0_PORT_USE == 1) { USif[COM0_USB].DoRxTx( &(USif[COM0_USB]) ); /* USB ch:0 */ }
#else	/*_MERCURY_PLATFORM_*/
	USif[0].DoRxTx( &(USif[0]) ); /* USB ch:0 */
#endif	/*_MERCURY_PLATFORM_*/
	return;
}

enum	SQSTEP	{
		SQSTEP_INITIAL		= 0,
		SQSTEP_CHK_USB		,
		SQSTEP_START_RX		,
		SQSTEP_WAIT_SRX		,
		SQSTEP_WAIT_ERX		,
		SQSTEP_WAIT_STX		,
		SQSTEP_START_TX		,
		SQSTEP_WAIT_ETX		,
/*------------------------------------------*/
		SQSTEP_USBRXERR,
};
/*--------------------------------------------------------------------------------------------------*/
void	KriUsbMsgManager( CSIF *this )
{
	if( UsbFuncChkAvailable() == FALSE )
	{
		return;
	}

/*--------------------------------------------------------------------------------------------------*/
/*		初期化完了チェック																			*/
/*--------------------------------------------------------------------------------------------------*/
//		if( MusbP.AxisAddrBgn > MusbP.AxisAddrEnd )
//		{
//			if( KsysV.MainTimer < 20000 ){ return;}			/* 20sec経過後は、Download対応			*/
//		}
/*--------------------------------------------------------------------------------------------------*/
/*		ＵＳＢハードウェアＩＦ処理																	*/
/*--------------------------------------------------------------------------------------------------*/
//		DpiUsbConnectSequence( );							/* USBバス接続－切断シーケンス			*/
//		UsbFuncIntIntu2f();									/* プラグイン／プラグアウト処理			*/
//		UsbFuncIntIntu2fepc();								/* バス・リセット／バス・スピード変更	*/
															/* EP0 SETUP検出処理					*/

		UsbFuncPollBulkOutIn( );							/* USBドライババルク転送サービス		*/
/*--------------------------------------------------------------------------------------------------*/
/*		ＵＳＢメッセージ送受信監視シーケンス														*/
/*--------------------------------------------------------------------------------------------------*/
		switch( this->SqStep )
		{
	/*----------------------------------------------------------------------------------------------*/
		case SQSTEP_INITIAL:		/* Initial Step													*/
	/*----------------------------------------------------------------------------------------------*/
			 UsbFuncResetBuffer( );								/* Endpoint1/2 送受信バッファクリア	*/
			 this->SqStep = SQSTEP_CHK_USB;
			 break;
	/*----------------------------------------------------------------------------------------------*/
		case SQSTEP_CHK_USB:		/* Check USB Port												*/
	/*----------------------------------------------------------------------------------------------*/
			 if( UsbFuncPortConfiguration() == TRUE )			/* USBポート状態チェック			*/
			 {
				this->SqStep = SQSTEP_START_RX;					/* 受信開始STEPに遷移				*/
			 }
			 break;
	/*----------------------------------------------------------------------------------------------*/
		case SQSTEP_START_RX:		/* Start Receive Message										*/
	/*----------------------------------------------------------------------------------------------*/
			 if( UsbFuncPortConfiguration() == FALSE )			/* USBポート状態チェック			*/
			 {
				this->SqStep = SQSTEP_INITIAL;					/* 無効時ｲﾆｼｬﾙに戻す				*/
			 }
			 else if( UsbFuncStartBkout( this->RxBuf, USB_CMDBUF_SIZE ) == TRUE )	/* 受信開始		*/
			 {
				this->SqStep = SQSTEP_WAIT_SRX;					/* 受信開始待ちSTEPに遷移			*/
			 }
			 break;
	/*----------------------------------------------------------------------------------------------*/
		case SQSTEP_WAIT_SRX:		/* Wait Start of Receive Message								*/
	/*----------------------------------------------------------------------------------------------*/
			 if( UsbFuncPortConfiguration() == FALSE )			/* USBポート状態チェック			*/
			 {
				this->SqStep = SQSTEP_INITIAL;					/* 無効時ｲﾆｼｬﾙに戻す				*/
			 }
			 else if( UsbFuncChkRcvComp() == BLKTRNS_END )		/* 全データ受信完了？				*/
			 {
				this->SqStep = LpxUsbChkRxMessage( this );		/* 受信メッセージチェック			*/
			 }
			 else if( UsbFuncGetRcvSize() > 0 )					/* 受信開始？						*/
			 {
				KpiRstLongTimer( &this->RxTimer );				/* 受信監視タイマリセット			*/
				this->SqStep = SQSTEP_WAIT_ERX;					/* 受信完了待ちSTEPに遷移			*/
			 }
			 break;
	/*----------------------------------------------------------------------------------------------*/
		case SQSTEP_WAIT_ERX:		/* Wait End of Receive Message									*/
	/*----------------------------------------------------------------------------------------------*/
			 if( UsbFuncPortConfiguration() == FALSE )			/* USBポート状態チェック			*/
			 {
				this->SqStep = SQSTEP_INITIAL;					/* 無効時ｲﾆｼｬﾙに戻す				*/
			 }
			 else if( UsbFuncChkRcvComp() == BLKTRNS_END )		/* 全データ受信完了？				*/
			 {
				this->SqStep = LpxUsbChkRxMessage( this );		/* 受信メッセージチェック			*/
			 }
			 else if( KpiGetLongTimer(&this->RxTimer) >= 500 )	/* 受信監視タイムオーバ				*/
			 {
				this->SqStep = SQSTEP_INITIAL;					/* 異常時INITIAL-STEPに遷移			*/
			 }
			 break;
	/*----------------------------------------------------------------------------------------------*/
		case SQSTEP_WAIT_STX:		/* Wait Start Transmit											*/
	/*----------------------------------------------------------------------------------------------*/
			 if( this->ReqStx == REQSTX_STARTTX )				/* 送信開始要求チェック				*/
			 {
				this->ReqStx = 0x00;							/* Reset ReqStx						*/
				this->SqStep = SQSTEP_START_TX;					/* 送信開始処理STEPに遷移			*/
			 }
			 else if( this->ReqStx == REQSTX_NORESPONSE )		/* 無応答(MsgErr)要求チェック		*/
			 {
				this->ReqStx = 0x00;							/* Reset ReqStx						*/
//				SET_USBERR( USBERR_USERERR );					/* Set User Error					*/
//				this->SqStep = SQSTEP_START_TX;					/* 送信開始処理STEPに遷移			*/
				this->SqStep = SQSTEP_INITIAL;					/* INITIAL-STEPに遷移			*/
			 }
			 break;
	/*----------------------------------------------------------------------------------------------*/
		case SQSTEP_START_TX:		/* Start Transmit Message										*/
	/*----------------------------------------------------------------------------------------------*/
			 if( UsbFuncPortConfiguration() == FALSE )			/* USBポート状態チェック			*/
			 {
				this->SqStep = SQSTEP_INITIAL;					/* 無効時ｲﾆｼｬﾙに戻す				*/
			 }
			 else if( UsbFuncStartBkin( this->TxBuf, this->TxResLen ) == TRUE )		/* 送信開始		*/
			 {
				this->SqStep = SQSTEP_WAIT_ETX;					/* 送信完了待ちSTEPへ遷移			*/
			 }
			 break;
	/*----------------------------------------------------------------------------------------------*/
		case SQSTEP_WAIT_ETX:		/* Wait End of Transmit Message									*/
	/*----------------------------------------------------------------------------------------------*/
			 if( UsbFuncPortConfiguration() == FALSE )			/* USBポート状態チェック			*/
			 {
				this->SqStep = SQSTEP_INITIAL;					/* 無効時ｲﾆｼｬﾙに戻す				*/
			 }
			 else if( UsbFuncChkTrnsComp() == BLKTRNS_END )		/* 全データ送信完了問合せ			*/
			 {
				this->SqStep = SQSTEP_START_RX;					/* 受信開始STEPに遷移				*/
			 }
			 break;
	/*----------------------------------------------------------------------------------------------*/
		default:					/* Not Used														*/
	/*----------------------------------------------------------------------------------------------*/
			 break;
		}
/*--------------------------------------------------------------------------------------------------*/
		return;
}


/****************************************************************************************************/
/*																									*/
/*		ＵＳＢ受信メッセージチェック																*/
/*																									*/
/****************************************************************************************************/
UCHAR	LpxUsbChkRxMessage( CSIF *this )
{
/*--------------------------------------------------------------------------------------------------*/
/*		スレーブアドレスのチェック 																	*/
/*--------------------------------------------------------------------------------------------------*/
		if( this->RxBuf[0] == 0x00 )
		{
			;											/* OK										*/
		}
		else if( this->RxBuf[0] == MusbP.ComAddr )
		{
			;											/* OK										*/
		}
		else if( this->RxBuf[0] < MusbP.AxisAddrBgn )
		{
			return( SQSTEP_INITIAL );					/* 受信開始処理Stepに戻る。					*/
		}
		else if( this->RxBuf[0] > MusbP.AxisAddrEnd )
		{
			return( SQSTEP_INITIAL );					/* 受信開始処理Stepに戻る。					*/
		}
/*--------------------------------------------------------------------------------------------------*/
/*		ファンクションコードのチェック 																*/
/*--------------------------------------------------------------------------------------------------*/
		if( 1 )											/* 正常										*/
		{
			this->RxCmdLen = UsbFuncGetRcvSize( );		/* 受信完了バイト数を得る					*/
			return(	SQSTEP_WAIT_STX );					/* 送信開始待ちStepに遷移					*/
		}
/*--------------------------------------------------------------------------------------------------*/
//		return( SQSTEP_INITIAL );						/* 上記以外は、全て初期Stepに戻る			*/
}


/****************************************************************************************************/
/*																									*/
/*		ＵＳＢ通信指令メッセージ受信チェック														*/
/*																									*/
/****************************************************************************************************/
LONG	KriCheckRxUsbMsg( 
		struct _CSIF *this,						/* this pointer										*/
		USHORT* pCmdMsgLen )					/* pointer to the message length					*/
{
	if( UsbFuncChkAvailable() == FALSE )
	{
		return( FALSE );
	}

/*--------------------------------------------------------------------------------------------------*/
/*		受信完了時																					*/
/*--------------------------------------------------------------------------------------------------*/
		if( this->SqStep == SQSTEP_WAIT_STX )
		{
			*pCmdMsgLen = this->RxCmdLen;
			return( TRUE );
		}
/*--------------------------------------------------------------------------------------------------*/
/*		受信未完時																					*/
/*--------------------------------------------------------------------------------------------------*/
	return( FALSE );
}

/****************************************************************************************************/
/*																									*/
/*		ＵＳＢ通信応答メッセージ送信開始指令														*/
/*																									*/
/****************************************************************************************************/
LONG	KriStartTxUsbMsg(							/* 応答メッセージ送信開始指令処理				*/
		struct _CSIF *this,						/* this pointer										*/
		UCHAR*	TxBuf,								/* 送信データバッファ							*/
		LONG	TxSize )							/* 送信データサイズ(ByteSize,無応答時はゼロ)	*/
{
	if( UsbFuncChkAvailable() == FALSE )
	{
		return( FALSE );
	}

/*--------------------------------------------------------------------------------------------------*/
/*		応答メッセージタイプのチェック																*/
/*--------------------------------------------------------------------------------------------------*/
		if( this->SqStep != SQSTEP_WAIT_STX )		/* シーケンスチェック							*/
		{
			return( FALSE );						/* 異常リターン									*/
		}
		else if( TxSize > 0 )						/* 送信データサイズチェック						*/
		{
			this->ReqStx   = REQSTX_STARTTX;		/* 送信開始リクエスト設定						*/
			this->pTxRes   = TxBuf;					/* 応答バッファアドレス設定						*/
			this->TxResLen = (USHORT)TxSize;		/* 応答メッセージ長(Byte数)設定					*/
			return( TRUE );
		}
		else
		{
			this->ReqStx   = REQSTX_NORESPONSE;		/* 無応答リクエスト設定							*/
			this->pTxRes   = NULL;					/* 応答バッファアドレス設定						*/
			this->TxResLen = 0;						/* 応答メッセージ長(Byte数)設定					*/
			return( TRUE );
		}
/*--------------------------------------------------------------------------------------------------*/
}



/****************************************************************************************************/
/*																									*/
/*																									*/
/*		ＵＳＢハードウェアＩＦ処理																	*/
/*																									*/
/*																									*/
/****************************************************************************************************/
// 別ファイル










/**************************** Start of Local Functions **********************************************/

/***************************************** end of file **********************************************/
