/****************************************************************************/
/*                                                                          */
/*            MECHATROLINK サーボ通信ＩＦアプリ 通信コンポーネント          */
/*                                                                          */
/*            Ｕｔｉｌｉｔｙ　ライブラリ	 								*/
/*																			*/
/****************************************************************************/
/* 定義関数 :                                                               */
/*																			*/
/* void *UtilMemmset()			メモリセット								*/
/* void *UtilMemcpy()			メモリコピー								*/
/*                                                                          */
/****************************************************************************/
/*	【改版履歴】															*/
/*		Ver1.00																*/
/*                                                                          */
/*******************  2003 Yaskawa Electric Corporation *********************/

/* includes */
#include "Basedef.h"
/* defines */


typedef union UNION_DW_ {
	LONG	dw;
	SHORT	wd[2];
	UCHAR	bd[4];
} UNION_DW;


/* globals */
#if defined(__ghs__)
#pragma ghs startzda
#elif !defined(WIN32)
#pragma section sidata begin
#endif
ULONG TimerCnt;
#if defined(__ghs__)
#pragma ghs endzda
#elif !defined(WIN32)
#pragma section sidata end
#endif



/* forward declarations */
void *UtilMemSet(void *s,UCHAR c,LONG n);
void *UtilMemCpy(void *s1,void *s2,LONG n);
char *UtilStrCpy(char *s1, char *s2);

LONG UtilGetDWData(UCHAR *data_ptr);
SHORT UtilGetWData(UCHAR *data_ptr);
VOID UtilSetDWData(UCHAR *buf_ptr, LONG data);
VOID UtilSetWData(UCHAR *buf_ptr, SHORT data);
VOID UtilSetLLData(VOID *buf_ptr, VOID *data_ptr);

/****************************************************************************/
/* 概要		：メモリセット関数												*/
/****************************************************************************/
/* 引数		：void *s ：記憶対象											*/
/*			  UCHAR c ：設定する値											*/
/*			  LONG n  : 設定バイト数										*/
/* 戻り値	：s       ：記憶対象											*/
/****************************************************************************/
/* 改版履歴	:																*/
/*	Ver1.00																	*/
/****************************************************************************/
void *UtilMemSet(void *s,UCHAR c,LONG n)
{
	CHAR *p = s;
	while(n>0)
	{
		*p = (CHAR)c;
		p++;
		n--;
	}
	return s;
}

/****************************************************************************/
/* 概要		：メモリコピー関数												*/
/****************************************************************************/
/* 引数		：void *s1 ：複写先												*/
/*			  void *s2 ：複写元												*/
/*			  LONG n  : 複写バイト数										*/
/* 戻り値	：s       ：記憶対象											*/
/****************************************************************************/
/* 改版履歴	:																*/
/*	Ver1.00																	*/
/****************************************************************************/
void *UtilMemCpy(void *s1,void *s2,LONG n)
{
	char *p=s1,*s=s2;
	
	while(n>0)
	{
		*p = *s;
		*p++;
		*s++;
		n--;
	}
	return s1;
}

#if 0
/****************************************************************************/
/* 概要		：文字列コピー関数												*/
/****************************************************************************/
/* 引数		：char *s1 ：複写先												*/
/*			  char *s2 ：複写元												*/
/* 戻り値	：s       ：記憶対象											*/
/****************************************************************************/
char *UtilStrCpy(char *s1, char *s2)
{
	char *p;
	for(p = s1; *s1 = *s2; s1++, s2++);
	return p;
}
#endif

/****************************************************************************/
/* 概要		：メカトロリンクバッファから指定のフィールドから始まる４バイト	*/
/*		      データを切り出し、LONG型で返します。							*/
/*		      ※奇数ｱﾄﾞﾚｽのﾜｰﾄﾞｱｸｾｽが行えない為の処理						*/
/****************************************************************************/
/* 引数		：UCHAR* data_ptr 	：データの先頭のポインタ					*/
/* 戻り値	：LONG data			：４バイトデータ							*/
/****************************************************************************/
/* 改版履歴	:																*/
/*	Ver1.00																	*/
/****************************************************************************/
LONG UtilGetDWData(UCHAR *data_ptr)
{
	UNION_DW data;

	data.bd[0] = data_ptr[0];
	data.bd[1] = data_ptr[1];
	data.bd[2] = data_ptr[2];
	data.bd[3] = data_ptr[3];

	return data.dw;
}

/****************************************************************************/
/* 概要		：メカトロリンクバッファから指定のフィールドから始まる２バイト	*/
/*		      データを切り出し、SHORT型で返します。							*/
/*		      ※奇数ｱﾄﾞﾚｽのﾜｰﾄﾞｱｸｾｽが行えない為の処理						*/
/****************************************************************************/
/* 引数		：UCHAR* data_ptr 	：データの先頭のポインタ					*/
/* 戻り値	：SHORT data		：２バイトデータ							*/
/****************************************************************************/
/* 改版履歴	:																*/
/*	Ver1.00																	*/
/****************************************************************************/
SHORT UtilGetWData(UCHAR *data_ptr)
{
	UNION_DW data;

	data.bd[0] = data_ptr[0];
	data.bd[1] = data_ptr[1];

	return data.wd[0];
}

/****************************************************************************/
/* 概要		：メカトロリンクバッファへ指定のフィールドから始まる４バイト	*/
/*		      データを設定します。											*/
/*		      ※奇数ｱﾄﾞﾚｽのﾜｰﾄﾞｱｸｾｽが行えない為の処理						*/
/****************************************************************************/
/* 引数		：UCHAR* buf_ptr 	：設定先の先頭のポインタ					*/
/* 			：LONG data			：４バイトデータ（設定データ）				*/
/* 戻り値	：なし															*/
/****************************************************************************/
/* 改版履歴	:																*/
/*	Ver1.00																	*/
/****************************************************************************/
VOID UtilSetDWData(UCHAR *buf_ptr, LONG data)
{
	UCHAR *p = (UCHAR*)&data;

	buf_ptr[0] = *(p+0);
	buf_ptr[1] = *(p+1);
	buf_ptr[2] = *(p+2);
	buf_ptr[3] = *(p+3);
}

/****************************************************************************/
/* 概要		：メカトロリンクバッファへ指定のフィールドから始まる４バイト	*/
/*		      データを設定します。											*/
/*		      ※奇数ｱﾄﾞﾚｽのﾜｰﾄﾞｱｸｾｽが行えない為の処理						*/
/****************************************************************************/
/* 引数		：UCHAR* buf_ptr 	：設定先の先頭のポインタ					*/
/* 			：LONG data			：２バイトデータ（設定データ）				*/
/* 戻り値	：なし															*/
/****************************************************************************/
/* 改版履歴	:																*/
/*	Ver1.00																	*/
/****************************************************************************/
VOID UtilSetWData(UCHAR *buf_ptr, SHORT data)
{
	UCHAR *p = (UCHAR*)&data;

	buf_ptr[0] = *(p+0);
	buf_ptr[1] = *(p+1);
}

/****************************************************************************/
/* 概要		：メカトロリンクバッファへ指定のフィールドから始まる８バイト	*/
/*		      データを設定します。											*/
/*		      ※奇数ｱﾄﾞﾚｽのﾜｰﾄﾞｱｸｾｽが行えない為の処理						*/
/****************************************************************************/
/* 引数		：UCHAR* buf_ptr 	：設定先の先頭のポインタ					*/
/* 			：UCHAR* data_ptr	：８バイトデータ（設定データ）				*/
/* 戻り値	：なし															*/
/****************************************************************************/
/* 改版履歴	:																*/
/*	Ver1.00																	*/
/****************************************************************************/
VOID UtilSetLLData(VOID *buf_ptr, VOID *data_ptr)
{
	UCHAR *buf_wk = buf_ptr,*data_wk = data_ptr;

	*buf_wk = *data_wk;
	*(buf_wk+1) = *(data_wk+1);
	*(buf_wk+2) = *(data_wk+2);
	*(buf_wk+3) = *(data_wk+3);
	*(buf_wk+4) = *(data_wk+4);
	*(buf_wk+5) = *(data_wk+5);
	*(buf_wk+6) = *(data_wk+6);
	*(buf_wk+7) = *(data_wk+7);
}

