/****************************************************************************************************/
/*																									*/
/*																									*/
/*		M3MsgIF.c : MECHATROLINK-Ⅲメッセージ通信ＩＦ管理											*/
/*																									*/
/*																									*/
/****************************************************************************************************/
/*																									*/
/*	機 能 : MECHATROLINK-Ⅲメッセージ通信ＩＦ処理を行う												*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/*																									*/
/************** Copyright (C) Yaskawa Electric Corporation ******************************************/
/*																									*/
/*	Note	:	初版	2010.09.06	T.Kira	For INGRAM												*/
/*																									*/
/*																									*/
/*																									*/
/****************************************************************************************************/
#include "NetDriver.h"
#include "M3msgIF.h"
#include "MercuryGlobals.h"	/* <S150> */
#include "Sif.h"			/* <S150> */
#include "MsgIfDef.h"		/* <S150> */


/* <S150> >>>>> */
/****************************************************************************************************/
/*																									*/
/*		Variable Definition																			*/
/*																									*/
/****************************************************************************************************/
/*--------------------------------------------------------------------------------------------------*/
/*		Local Parameter Structure Definition														*/
/*--------------------------------------------------------------------------------------------------*/
typedef	struct {							/*														*/
	LONG	Rc;								/* 戻り値を一時置いておく変数							*/
	UCHAR	Channel;						/* チャンネル情報										*/
	UCHAR	Reserved[3];					/* 予備												*/
	UCHAR	RxBuf[MSG_MAXBUFSZB];			/* 受信データバッファ									*/
	UCHAR	TxBuf[MSG_MAXBUFSZB];			/* 送信データバッファ									*/
} MM3SIFV;

/****************************************************************************************************/
/*																									*/
/*		Function Prototypes																			*/
/*																									*/
/****************************************************************************************************/
/*--------------------------------------------------------------------------------------------------*/
/*		Kpx Functions																				*/
/*--------------------------------------------------------------------------------------------------*/
void	KpxInitMlinkMsgIf(						/* MECHATROLINK通信メッセージＩＦ初期化					*/
		LONG	DriveID,						/* ドライブ機種ＩＤ									*/
		LONG	ComAddr,						/* 通信アドレス										*/
		LONG	AxisNumber,						/* 多軸ドライブ軸数(0/1/2/...)						*/
		UCHAR	Channel							/* チャンネル										*/
		);
/*--------------------------------------------------------------------------------------------------*/
/*		Kpi Functions																				*/
/*--------------------------------------------------------------------------------------------------*/
#if 0	//実体なし
void	KriInitMlinkHmsg(						/* MECHATROLINK通信Hmsg初期化処理					*/
		HMSGIF	Hmsg		);					/* メッセージＩＦハンドル(ポインタ)					*/
#endif
/*--------------------------------------------------------------------------------------------------*/
void	KriM3MsgIfManager( CSIF *this );		/* MECHATROLINK通信メッセージ送受信監視					*/
/*--------------------------------------------------------------------------------------------------*/
LONG	KriCheckRxMlinkMsg(						/* MECHATROLINK通信指令メッセージ受信チェック				*/
		struct _CSIF *this,						/* this pointer										*/
		USHORT* pCmdMsgLen	);					/* 指令メッセージ長格納先ポインタ					*/
/*--------------------------------------------------------------------------------------------------*/
LONG	KriStartTxMlinkMsg(						/* MECHATROLINK通信応答メッセージ送信開始指令				*/
		struct _CSIF *this,						/* this pointer										*/
		UCHAR*	TxBuf,							/* 送信データバッファ								*/
		LONG	TxSize		);					/* 送信データサイズ(ByteSize,無応答時はゼロ)		*/
/*--------------------------------------------------------------------------------------------------*/


MM3SIFV		MM3SifV[2];							/* Local Variables for M3 Message						*/
CSIF		M3Sif[2];							/* MECHATROLINK Interface Instance					*/
extern void KpxMsgManager2( UCHAR Channel );	/* メッセージ処理								*/

/****************************************************************************************************/
/*																									*/
/*		MECHATROLINK通信メッセージＩＦ初期化														*/
/*																									*/
/****************************************************************************************************/
void	KpxInitMlinkMsgIf( LONG DriveID, LONG ComAddr, LONG AxisNumber, UCHAR Channel )
{
	CSIF 	*pSif;
	MM3SIFV	*pSifV;

	pSif = &M3Sif[Channel];
	pSifV = &MM3SifV[Channel];

	MlibResetByteMemory( pSifV, sizeof(MM3SIFV) );
	MlibResetLongMemory( pSif, sizeof(CSIF)/4 );		/* MECHATROLINKメッセージＩＦ用変数初期化		*/
/*--------------------------------------------------------------------------------------------------*/
	pSif->Com = pSifV;									/* 										*/
	pSif->AxisNumber = AxisNumber;						/* set axis number 						*/
	pSif->DoRxTx = NULL;								/* TODO: RxTx sequence 					*/
	pSif->ChkCmd = KriCheckRxMlinkMsg;					/* check receive cmd method 			*/
	pSif->StxRes = KriStartTxMlinkMsg;					/* start tx response method 			*/
/*--------------------------------------------------------------------------------------------------*/
	pSif->RcvBufSize = MSG_MAXBUFSZB;					/* rcv buf size */
	pSif->SndBufSize = MSG_MAXBUFSZB;					/* send buf size */
/*--------------------------------------------------------------------------------------------------*/
	pSif->RxBuf = pSifV->RxBuf; 						/* rcv buf */
	pSif->TxBuf = pSifV->TxBuf; 						/* send buf */
/*--------------------------------------------------------------------------------------------------*/
	pSifV->Channel = Channel;
	return;
}

/****************************************************************************************************/
/*																									*/
/*		MECHATROLINK通信指令メッセージ受信チェック														*/
/*																									*/
/****************************************************************************************************/
LONG	KriCheckRxMlinkMsg(
		struct _CSIF *this,						/* this pointer										*/
		USHORT* pCmdMsgLen )					/* pointer to the message length					*/
{
/*--------------------------------------------------------------------------------------------------*/
/*		受信完了時																					*/
/*--------------------------------------------------------------------------------------------------*/
		*pCmdMsgLen = this->RxCmdLen;
		return( TRUE );
}

/****************************************************************************************************/
/*																									*/
/*		MECHATROLINK通信応答メッセージ送信開始指令													*/
/*																									*/
/****************************************************************************************************/
LONG	KriStartTxMlinkMsg(							/* 応答メッセージ送信開始指令処理				*/
		struct _CSIF *this,							/* this pointer										*/
		UCHAR*	TxBuf,								/* 送信データバッファ							*/
		LONG	TxSize )							/* 送信データサイズ(ByteSize,無応答時はゼロ)	*/
{
	this->TxResLen = TxSize;						/* 送信サイズの設定のみ */
	return( TRUE );									/* 正常リターン									*/
}

/* <<<<< <S150> */

#if 0	/* <S150> */
/****************************************************************************************************/
/*																									*/
/*		MECHATROLINK-Ⅲメッセージ 初期化処理														*/
/*																									*/
/****************************************************************************************************/
void M3MsgIfInit(M3MSGIFV *M3MsgPtr, MEMOBUS_ADDR_MAP *AxisCfg, UCHAR Channel )
{
	ND_PARAM *nd_param;
	
	/* 通信パラメータ取得 */
	nd_param = NdGetNdParamPtr(); 

	/* Memobus IF Initialize */
	MbusFuncInitialize( (MEMOBUS_IF*)&(M3MsgPtr->MbusIf), AxisCfg, (LONG)nd_param->NodeAddress);

	/* 送受信監視シーケンスStep */
	M3MsgPtr->stateOfM3Msg = M3MSGSTEP_INITIAL;

	/* Channel */
	M3MsgPtr->Channel = Channel;

}
#endif	/* <S150> */


/****************************************************************************************************/
/*																									*/
/*		MECHATROLINK-Ⅲ通信メッセージ通信定周期監視処理 ( Round Cycle )								*/
/*																									*/
/****************************************************************************************************/
/*																									*/
/*	機 能 : MECHATROLINK-Ⅲの通信ドライバAPIを使用して、M-Ⅲ通信データの受信と送信の制御を行う。	*/
/*			対C1マスタ通信と対C2マスタ通信を並行して行う。両者は独立しており干渉しない。			*/
/*																									*/
/*--------------------------------------------------------------------------------------------------*/
/*																									*/
/*	0) 初期ステップ				: 受信開始状態に遷移												*/
/*	1) 受信開始					: M-Ⅲメッセージ受信開始APIの戻り値が受信開始状態であることを確認	*/
/*	2) 受信完了確認				: M-Ⅲメッセージ受信完了APIの戻り値が受信完了状態であることを確認	*/
/*  3) メッセージ解析&処理実行	: 受信データを解析し、指令されたコマンドを実行する					*/	
/*	   送信データセット			: 送信データをセットする											*/
/*	4) 送信完了確認				: M-Ⅲドライバへ送信開始指令を出す									*/
/*	5) 送信完了					: M-Ⅲドライバの送信完了が確認出来たら送信完了。初期ステップへ戻る	*/
/*																									*/
/*																									*/
/****************************************************************************************************/
void	M3MsgIfManager( void )
{
	KriM3MsgIfManager( &M3Sif[0] );	/* C1メッセージ */
	KriM3MsgIfManager( &M3Sif[1] );	/* C2メッセージ */
}

void	KriM3MsgIfManager( CSIF *this )
{
	MM3SIFV	*pSifV;
	USHORT	RcvWordSize;

	pSifV = (MM3SIFV *)this->Com;

	/*----------------------------------------------------------------------------------------------*/
	/*		Ｍ－Ⅲメッセージ通信送受信監視シーケンス												*/
	/*----------------------------------------------------------------------------------------------*/
	switch( this->SqStep )
	{
		/*------------------------------------------------------------------------------------------*/
		/*						初期ステップ														*/
		/*------------------------------------------------------------------------------------------*/
		case M3MSGSTEP_INITIAL:
			this->SqStep = M3MSGSTEP_START_RX;	/* 受信開始処理Stepに遷移 */
			//break;
		/*------------------------------------------------------------------------------------------*/
		/*						受信開始															*/
		/*------------------------------------------------------------------------------------------*/
		case M3MSGSTEP_START_RX:
			pSifV->Rc = NdReqRecvMsg( pSifV->Channel );
			if( pSifV->Rc == ND_SUCCESS )							/* 受信した? */
			{
				this->SqStep = M3MSGSTEP_WAIT_RX;					/* 受信完了待ちSTEPに遷移 */
			}
			break;
		/*------------------------------------------------------------------------------------------*/
		/*						受信完了確認														*/
		/*------------------------------------------------------------------------------------------*/
		case M3MSGSTEP_WAIT_RX:

			/* 受信完了待ち */	
			pSifV->Rc = NdGetRecvMsgSts( pSifV->Channel,
									  &RcvWordSize, &this->RxCmdLen );

			if( pSifV->Rc == ND_SUCCESS )
			{
				/* メッセージデータ読み込み */
				NdReadMsgData( pSifV->Channel, (USHORT*)this->RxBuf, RcvWordSize );
				
				this->SqStep = M3MSGSTEP_EXE;					/* メッセージ解析&処理実行STEPへ遷移*/
			}
			else if( pSifV->Rc != ND_RECV_BUSY )				/* 処理中でない時ERROR				*/
			{
				this->SqStep = M3MSGSTEP_INITIAL;				/* ERROR時、初期STEPに遷移			*/
			}
			break;
		/*------------------------------------------------------------------------------------------*/
		/*						メッセージ解析&処理実行												*/
		/*------------------------------------------------------------------------------------------*/
		case M3MSGSTEP_EXE:
		
			/* 受信データSwap処理 */
			mbusFuncBufSwap( this->RxBuf);

			/* メッセージ解析&処理実行 */
			KpxMsgManager2( pSifV->Channel );

			/* プロトコルＩＤエラー	(アボートする) */
			if( this->TxResLen == 0 )
			{
				NdSendMsgAbort( pSifV->Channel );		/* アボートメッセージ送信	*/
				this->SqStep = M3MSGSTEP_INITIAL;		/* 初期STEPに遷移			*/
				return;
			}

			/* 送信メッセージSwap処理 */
			mbusFuncBufSwap( this->TxBuf );
			
			/*------------------------------------------------------------------------------------------*/
			/*						送信データセット													*/
			/*------------------------------------------------------------------------------------------*/
			/* メッセージデータ書き込み */
			NdWriteMsgData( pSifV->Channel, (USHORT*)pSifV->TxBuf, this->TxResLen );
			
			/* 送信完了待ちに遷移 */
			this->SqStep = M3MSGSTEP_WAIT_STX;

			break;
		/*------------------------------------------------------------------------------------------*/
		/*						送信開始															*/
		/*------------------------------------------------------------------------------------------*/
		case M3MSGSTEP_WAIT_STX:

			/* 送信開始指令	*/
			if( ND_SUCCESS != NdReqSendMsg( pSifV->Channel ))
			{
				NdSendMsgAbort( pSifV->Channel );			/* アボートメッセージ送信			*/
				this->SqStep = M3MSGSTEP_INITIAL;		/* ERROR：初期ステップに戻る		*/
			}
			else
			{
				this->SqStep = M3MSGSTEP_WAITETX;		/* 送信完了待ちに遷移				*/
			}

			break;
		/*------------------------------------------------------------------------------------------*/
		/*						送信完了確認														*/
		/*------------------------------------------------------------------------------------------*/
		case M3MSGSTEP_WAITETX: 
			if( ND_SEND_BUSY != NdGetSendMsgSts( pSifV->Channel ))
			{
				this->SqStep = M3MSGSTEP_INITIAL;		/* 初期STEPに遷移					*/
			}			
			break;
		/*------------------------------------------------------------------------------------------*/
		/*						デフォルト(保険)													*/
		/*------------------------------------------------------------------------------------------*/
		default:
			 break;
	}
	
	return;
}


/***************************************** end of file **********************************************/
